{"name": "overview", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMiddle07.asp", "summary": "The sub-title of Middlemarch is \"A study of Provincial Life.\" Both the title and the sub-title make it clear that the subject is not a character or even a family, but the lives of people in a provincial town. Thus, one has roughly four stories, all set in and around Middlemarch, with at least one major character from one story being present in another, and hence threads linking all the tales together. One has the story of Dorothea Brooke being given prominence in the Prelude. Dorothea is a young girl with great ideals and ambitions. She would like to dedicate her life to some great cause, which would reform the society around her. Having no clear notion about how to do it, she marries Edward Casaubon, the elderly clergymen, who seems to represent knowledge and piety. Disillusion soon follows. She comes in contact with his dependent cousin, Will. She enjoys his company. Casaubon is jealous. He makes a will forbidding her marriage to Will, and dies of a heart ailment. The will creates a scandal in that rigid society. The two decide to remain apart. Ultimately, after much soul searching, they marry. Dorotheas ideals are toned down, and she devotes her life to Will, his political career, and their children. The second story is about Tertius Lydgate - a young, handsome, clever and idealistic doctor. He is highly -connected but has no fortune. He is attractive to the town beauty Rosamond Vincy, who wants to escape from her \"bourgeois\" background into the nobility. They marry, here too, disillusion follows. Lydgate is forced to give up his ideals to preserve his marriage. They get into debt. Lydgate is involved in a medical scandal involving his rich sponsor, Nicholas Bulstrode. His only supporter is Dorothea, who has been his patient earlier. He gives in to his wifes wish to live in London, and ends his days as a physician of the rich. He dies early, and Rosamond marries a rich man. Like Dorothea, he too gives up his ideals, but his end is far bleaker. The third story is that of Mary Garth a plain intelligent girl, who works as a housekeeper. Her family stands for the ideal of hard work and self-respect, Fred, Rosamonds idle scamp of a brother has loved Mary from childhood. Unlike Rosamond, he is warm, affectionate, and capable of improvement. His love for Mary makes him change himself into a hard working farm- manager, and they marry and live happily in prosperity. The last major story is that of Nicholas Bulstrode Lydgate's sponsor. Bulstrode has once been an ardent Dissident preacher in a sect in the city. He has then been patronized by a rich Jewish pawnbroker. After the Jews death he married his widow who is in search of her runaway daughter. Bulstrode suppresses news of the daughter and thus has the whole property for himself. The lady dies. He then moves away and makes a fresh start as a \"respectable\" businessman and banker, away from the taint of the pawnshop. He marries Harriet Vincy aunt of Fred and Rosamond, and becomes a pillar of Middlemarch society. Inevitably, his past catches up in the form of a seedy black mailer, Raffles. The drunken Raffles confides the facts in several Middlemarchers, including Will Ladislaw, whose mother has been disinherited through Bulstrode. Raffles then dies while being nursed by Bulstrode and attended by Dr. Lydgate. The circumstances point towards the guilt of Bulstrode in Raffles death. Lydgate is also involved. The ensuing scandal ruins Bulstrode, who gives up public life, and decides to leave the town. Lydgate services because Dorothea and her friends believe in his innocence. These four stories also involve a host of lesser characters and recreate the rich and dense texture of the life of a town and the nearly villages.", "analysis": ""}