{"name": "overview", "url": "https://web.archive.org/web/20180820042551/http://www.pinkmonkey.com/booknotes/monkeynotes/pmAroundWorld09.asp", "summary": "The story begins at England. We are introduced to Fogg, a very precise man who regularly goes to the Reform Club every evening. At one such visit to the club to play cards, he gets into a conversation with his fellow card players as to whether it is possible to go around the world in eighty days following this schedule: RouteTravel Method Duration London / Suezrail and ship7 days Suez / Bombayship13 days Bombay / Calcuttarail and elephant3 days Calcutta / Hong Kongship13 days Hong Kong / Yokohamaship6 days Yokohama / San Franciscoship22 days San Francisco / New Yorkrail7 days New York / Londonship9 days Total 80 days He believes that it is possible and he is challenged to complete the adventure. This is the beginning of the entire plot and from then on we see how Fogg goes around the world and we witness the amazing adventures that he has with his companions. The main plot is based on Foggs travels, while other such plots merely support the central theme Fix, the detective follows Fogg all over. He believes that Fogg is the bank robber who has robbed a great sum from the bank of England. He puts obstacles in Foggs path just so that he can arrest him whenever he gets the warrant from England. The suspicion that Fogg might be a clever gentleman robber is the sub-theme of the book and the author makes the reader also suspicious. Passepartout too wonders whether his master might be a robber though in his heart he has ample trust in Foggs integrity. The plot moves ahead with Fogg striving through various obstacles to reach London in time. He goes through Brindisi, Suez, Bombay, Calcutta, Hong Kong, Yokohama, San Francisco, New York and finally Liverpool. Fix arrests Fogg at Liverpool and this delays our hero. He thinks that he has missed the deadline and hasn't reached London in time when in reality he reached a full day earlier. Thus Fogg wins the wager and in the course of his travels, finds himself a worthy charming, beautiful wife too.", "analysis": ""}