{"name": "overview", "summary": "Madame Bovary opens with a description of the student life of          Charles Bovary. With diligent application, he becomes a doctor and begins          his practice in Tostes, a rural town. He marries a supposedly rich widow,          who dies soon after. A year later, he marries Emma Rouault, the daughter          of one of his clients. She is young and pretty, and Charles is thoroughly          enamored with her. After a few weeks of marriage, Emma begins to tire          of the union. She finds Charles too dull to understand her passionate          romantic yearnings. The high point of her early married life is the ball          she attends at La Vaubyessard. Memories of the Viscount she meets at the          party remain with her for a long time. Due to her failing health, brought          on by a severe mental depression, Emma, with her husband, moves to Yonville,          France, another small town, near Rouen. A daughter is born to them there. Emma's romantic desires grow during her acquaintance with a young clerk,          Leon. The two share many interests, but their relationship does not bloom,          and Leon leaves for Paris to study law and improve his job prospects. After his departure, Emma enters a major phase of depression and becomes          very irritable. Monsieur Rodolphe Boulanger walks into her life at this          stage. He convinces Emma to have an adulterous relationship with him. For a while, passions run high, and neither can have enough of the other. With the passage of time, however, Emma's romantic sentimentalism begins          to irk Rodolphe. When Emma expresses the desire to run away with him, he decides to terminate          the affair. The effect on Emma is disastrous. She cannot withstand the          shock and is bed- ridden for months. After her recovery, she becomes religious,          but only for a while. A visit to Rouen re-acquaints her with Leon, and          their dormant passions are roused. Emboldened by the affair with Rodolphe,          she plunges into a tumultuous relationship with Leon. Unmindful of the consequences, Emma liberally borrows money  from the local moneylender, Lheureux. She satisfies her every  whim concerning furniture, fashion, and love. Experienced in the  art of love-making, she begins to dominate Leon, who comes to  resent her. When this affair fails, Emma becomes frustrated. Furthermore, her financial affairs are in shambles. She begins to  receive notices on the amounts she has borrowed and not repaid. Eventually, Emma receives the final blow in the form of a royal order          demanding payment of her debts within twenty-four hours. Fear grips her,          as she has not told her husband of her secret borrowings. She tries several          sources in order to raise the money, but all fail her. Even Leon is unconcerned          about her fate. Cornered in this manner, Emma chances upon Justin, the          pharmacist's helper. Because of an incident she had observed earlier in          the pharmacy, she knows where the arsenic is kept. With no financial aid          forthcoming, she coerces Justin into parting with the key to the storeroom,          where she swallows a fistful of arsenic. Emma's death is lengthy and torturous. Her death only temporarily  stalls the total financial ruin of Charles. Soon after Emma dies,  creditors crowd in. Charles cannot pay these debts. He becomes  bankrupt and eventually withdraws from social life. One night he  discovers proof of his wife's infidelity, but he is not angry. He  spends time with his daughter, whom he loves. It is she who finds  him dead in the garden one day. The child, now orphaned by the  tragic deaths of her parents, is sent to live with a poor aunt. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMadameBovary06.asp"}