{"name": "overview", "url": "https://web.archive.org/web/20180820041120/http://www.pinkmonkey.com/booknotes/monkeynotes/pmDracula05.asp", "summary": "The plot of Dracula is a story of a vampire, Count Dracula, who lives in Transylvania. He calls Jonathan Harker on some pretext. Jonathan Harker is a lawyer - young, brave and enthusiastic. As he travels to Count Dracula's dark castle, he realizes, as he sees villagers scared faces and wolves barking, that something is amiss. As days and deadly nights pass, he realizes that he is in big trouble. There, in the castle, are three beautiful women beside Dracula, who Jonathan is fascinated with, but later he realizes that they are all as deadly as Dracula. He sees them feasting on young children, flitting like bats and lying in wait for him to feast on him. He somehow manages to escape delirious with fear and shock. In the mean time, his fiancee Mina Murray, in her journal to her friend, Lucy, tells of her fear and trauma because of her missing fiancee. Her friend, Lucy, a beautiful and frivolous girl, cannot decide on who to marry amongst her three suitors: Arthur Holmwood, Quincey Morris or Doctor Seward. Doctor Seward, in the meantime, is fascinated by a strange case of a man named Renfield, who eats spiders and flies in his mental asylum. Mina is overjoyed that her fiancee returns. She spends sometime with Lucy, who is engaged to Arthur. One night, Mina witnesses Lucy walking in her sleep and walking to an isolated area where she returns with blood on her nightdress. In the meantime, a strange ship approaches at the port in England. The ship is wrecked and nobody survives. In the logbook found in the ship there is a newspaper cutting with strange tale of a mysterious man in black, who kills everybody. Van Helsing meets Mina Harker regarding Lucy. The two scars on Lucy's throat disturb him, and there is a loss of blood without any sign of hemorrhage. He is then given Jonathan's journal of the activities in Transylvania. Van Helsing believes Jonathan's story of Dracula. Everybody thinks Jonathan's strange tale is because of his fever, but not Professor Abraham Van Helsing, who is present to see an ailing Lucy. Van Helsing has heard of Dracula. He calls Mina who is now married to Jonathan and meets the couple. Lucy is going from bad to worse and the symptoms are suspiciously like a vampire. Arthur, Quincey, Seward and Van Helsing give her blood but it is not enough, so she dies. But she reappears as a vampire to prey on children. The band of Doctor Sword, Professor Van Helsing and the Harkers kill her by cutting off her head and putting garlic in her mouth. The band is now pursuing Dracula. Dracula attacks Mina and devours on her blood. But she bravely tries to resist and help the band. They pursue Dracula to Transylvania and they kill Dracula by stabbing him in the heart. Quincey is fatally wounded in the battle and he dies. Seven years later, the Harkers have a child, a boy who is born on the same day as Quincey Morris died. The rest are also married. They, however, cannot speak of the past happenings as they feel no one will believe them. They burn the journals and are happy their trauma has passed.", "analysis": ""}