{"name": "overview", "summary": "Love's Labour's Lost opens on a grandiose note, as Ferdinand,  King of Navarre, informs the audience that he and his companion  lords, Biron, Longaville and Dumain, have sworn to abstinence  and the pursuit of knowledge. They are to lock themselves away  in court to study for three years, and visits by females will be very  limited. When the King instructs his lords to sign an oath to the  plan, both Longaville and Dumain quickly comply, claiming that  a three-year period of fasting and celibacy can easily be endured  for the sake of knowledge. Biron, however, initially finds the plan  unreasonable and is hesitant to sign the oath. His initial skepticism  is soon overcome, and he makes his pledge along with the others. As Biron signs, however, he reminds the King of the impending  visit from the Princess of France, which threatens the  proclamations of the agreement, since she will have to be  entertained for the sake of \"gentility\". The conversation is interrupted by Constable Dull, who brings  with him a letter concerning the crime committed by Costard, who  is in tow. The letter is from Don Armado, the Spanish \"child of  fancy\", who accuses Costard of having broken the law by flirting  with a country girl. Costard is given a punishment, and Don  Armado is put in charge of enforcing it. He is happy to do this  since the country girl is someone to whom he is attracted. While this matter is sorted out, the Princess of France arrives at  the gates of Navarre and is shocked by the lack of hospitality  shown towards herself and her ladies, due to the King's oath. The  King and his men finally enter, and a debate over the land the  Princess has come to claim follows. The king's lords immediately  show an interest in ladies of the princess. After they exit with the  king, they quickly return to be with them. Dumain reveals a  curiosity for Katherine, Longaville shows an interest in Maria,  and Biron comes in to confirm whether or not Rosaline is married. The third act reveals the parallel development in both the main  plot and the comic sub-plot. Biron accosts Costard, the clown and,  having tipped him generously, asks him to take to the lady  Rosaline a letter confessing his love for her. Costard agrees, just  as he has earlier agreed to take a similar letter to Jaquenetta from  Don Armado. Costard faithfully hands over the letter to the  Princess while she occupies herself with shooting. However,  Costard has mixed up the letters, and hands over the Princess the  letter intended for Jaquenetta rather than the one for Rosaline. Nevertheless, the Princess insists it be read aloud. After being  amused at the letter, she proceeds to the shoot, while Rosaline and  Boyet take part in a witty dialogue. The next scene opens with a highly artificial intellectual  conversation between Holofernes and Nathaniel, whose extremely  literate remarks stand in direct contrast to the rather plain  language of Anthony Dull, the constable. They argue about  whether the Princess killed a 'pricket', a 'sore', or a 'sorel', a futile  argument, for all three words mean a deer and only differentiate  the age of the deer . Jaquenetta and Costard arrive on the  scene. Jaquenetta wishes that the curate read to her the letter she  has just received from Costard, and Nathaniel obliges. Holofernes,  however, informs Jaquenetta that the letter is not addressed to her  and that she must take it to the King post-haste, for it is written by  Biron, \"one of the votaries with the King\". ", "analysis": "", "url": "https://web.archive.org/web/20180820051943/http://www.pinkmonkey.com/booknotes/monkeynotes/pmLovesLabours06.asp"}