{"name": "overview", "summary": "Dr. Stockmann is the Medical Officer of the Baths. He is a jovial  and independent person who likes to live in style and be  surrounded by cheerful, intelligent people. After sampling and  testing the water from the baths, he discovers that they are  contaminated and dangerous for the health of the people. Dr. Stockman reports his discovery to Hovstad, the editor of the local  newspaper, the People's Messenger. At first, the citizens praise the  doctor for his discovery; it is even suggested that they hold a  torchlight procession in his honor. Morten Kiil, Stockmann's father-in-law, visits the doctor to  confirm the reports about the baths. He is delighted when  Stockman confirms the contamination of the water, for he wants to  expose the misdeeds of the Burgomaster and his followers, who  have dislodged Kiil from the Town Council. Aslaksen, the leader  of the Homeowners' Association, also calls on the doctor to extend  his support, but cautiously urges Stockmann to proceed with  moderation. Peter Stockmann is the Burgomaster  and the Chairman of  the Baths Committee. He is also Dr. Stockmann's brother and is  very angry about his discovery of the contamination. He wants to  hush up the matter, claiming the town cannot afford the huge cost  of re-laying the pipes leading to the baths. He also feels that the  citizens will suffer financially if the baths are closed for nearly two  years for repairs. Dr. Stockmann cannot believe his brother wants  to cover up the contamination and refuses to be a party to such  dishonesty, which he feels is a crime against society. The  Burgomaster threatens his brother with dismissal from his position  if the doctor refuses to withdraw his claim. Dr. Stockmann vows to  continue his fight and assumes that the press and the compact  majority will support him in his struggle. Dr. Stockmann's article is discussed by Hovstad and his staff. They  then tell the doctor that his article is a masterpiece, which will  sway every intelligent person to his side on the issue. The  Burgomaster, however, comes to have a private talk with Hovstad  in order to explain the technical and economic aspects of the baths. He warns that the citizens may have to bear the entire cost of  repairs if the improvements suggested by Dr. Stockmann are to be  implemented. Additionally, Peter Stockmann states that the baths  will have to be closed for two years for repairs, causing  considerable hardships to the citizens who depend on the baths for  their livelihood. Hovstad and Aslaksen have not taken these facts  into account while extending their support to Dr. Stockmann. The editor decides to publish the Burgomaster's statement instead  of Dr. Stockmann's article, a change that shocks the doctor. When  he criticizes his brother for his stance, Dr. Stockmann is removed  from his office by the Burgomaster. Dr. Stockmann then  determines to read his article to a mass meeting of the citizens, but  his brother warns him that no place in town will let him hold a  meeting for such a purpose. As a result, Dr. Stockmann decides to  read his paper at every street corner, an action that is supported by  his wife. ", "analysis": "", "url": "https://web.archive.org/web/20180820053844/http://www.pinkmonkey.com/booknotes/monkeynotes/pmEnemyPeople05.asp"}