{"name": "overview", "summary": "King Henry IV receives the news of two wars. The English have  lost a battle against the Welsh and their commander, Mortimer, is  being held captive by the Welsh leader, Glendower. The second  tiding of the day is that the English have won in a battle against the  Scots and that the English commander, Hotspur, has captured the  Scots' commander, Douglas, and several other important nobles. The king is glad to know of Hotspurs victory, but he is annoyed  that Hotspur refuses to hand over his captives to the crown. He  sends orders to the Percies to appear before him. At this point, the comic subplot is introduced. Prince Hal, to his  father's disappointment, has been neglecting his royal duties and  engaging in drinking and debauchery with friends of questionable  reputations - Bardolph, Peto, Poins, Gadshill, and, of course, the  errant knight Falstaff. While Hal and Falstaff drink at a tavern,  Poins arrives with a plan to commit a robbery and to play a joke on  Falstaff at the same time. After Bardolph, Peto, and Falstaff  commit the robbery, Poins and Hal will rob Falstaff, and expose  him as a cowardly liar. Hal agrees to participate. When his  associates leave, Hal engages in a soliloquy, in which he swears  that although he is engaging in fun for now, he will soon take up  his princely duties. King Henry meets with the Percies. Hotspur demands that Henry  ransom Mortimer, his brother-in-law, as terms of releasing the  captives. Henry IV doubts Mortimers loyalty, as Mortimer has  married Glendowers daughter, and refuses to pay the ransom. The  Percies are furthermore angry with him, as he has not rewarded  them for their services in helping him come to power. The king  ignores their complaints and orders Hotspur to turn over the  captives. When the king exits, the Percies begin to plot against the  king, with Worcester inciting and encouraging Hotspur's anger. Henry IV is now in a delicate position, as this civil strife may cost  him his throne. In the comic subplot, Bardolph, Peto, and Falstaff rob a group of  travelers at Gad's Hill and are in turn robbed by Poins and Hal. The next day, Falstaff relates a spicy tale of valor and adventure to  Poins and Prince Hal, saying that he bravely fought upwards of a  hundred men. When Hal and Poins reveal the truth, that he ran  away and left the booty after being faced by only them, Falstaff  comes up with a quick defense. He claims that he recognized the  prince and therefore did not fight him, as it would not be right to  harm the heir apparent to the throne. When a messenger arrives  from the king summoning the prince to court, Hal and Falstaff  play-act the upcoming meeting between father and son. Hal hides  Falstaff when the sheriff arrives looking for suspects in the  robbery. While Prince Hal is frolicking around, his fathers enemies are  working day and night for the rebellion. In a scene at Hotspur's  castle, the hotheaded young leader is highly disturbed at not  getting the expected support from one of his expected allies and  fears that news of the rebellion will soon reach the king. Later, in  Wales, the rebels have a tense meeting in which they divide up the  kingdom and outline their plans for the coming war. Prince Hal returns to the palace and declares his support for the  king and his cause. Overjoyed, the king gives him the command of  a royal army and the two prepare to march toward Shrewsbury,  where the rebels are assembling. Hal returns to the inn, where he  announces to Falstaff that he has cleared up the robbery and orders  him to gather up and lead a troop of foot soldiers in the war. ", "analysis": "", "url": "https://web.archive.org/web/20180820040441/http://www.pinkmonkey.com/booknotes/monkeynotes/pmHenry4107.asp"}