{"name": "overview", "summary": "The novel opens with Alice and her sister sitting on the bank of a river. Feeling absolutely bored since she (Alice) did not have anything to do          she decides to take a short walk. Just then she spots a small white rabbit          dart across the grass. What amazes her is that the rabbit takes out a          small watch from its pocket and exclaims, \"I will be late\". Alice had never heard a rabbit talk and moreover felt that it was very          strange for a rabbit to own a pocket watch. Curiosity takes Alice down          the rabbit hole and this leads her into a land where her main pre- occupation          seems to be either growing tall or becoming short. Her desire to get through a little door that leads to a beautiful garden          takes her on an adventure to the house of a Duchess, a mad tea-party where          she meets the Mad Hatter and March Hare. Her encounter with the caterpillar          is very helpful because it is through the caterpillar that she manages          to know the way in which one could change their height depending on the          situation. Her experience in the house of White Rabbit is another interesting          episode. On the whole, her adventures prior to entry into the beautiful          garden are of a kind that leads her to question herself and the knowledge          that she has about herself and of the world. Her entry into the beautiful garden signals the beginning of a turn of events  where she is subjected to various questions. It is typical of a situation in which  the readers confront the fact that appearances are deceptive. The Queen  becomes very symbolic of a character that is a sadist at heart and ironically she  is indeed the Queen of Hearts. The game of croquet which represents the cruel  rules of the game (land) and the lop-sided legal system (courtroom  proceedings) are typical of all that one despises. Alices final realization of  reality (that the characters are just a pack of cards) is the realization of the  manner in which external features can influence the mind of a human being,  especially that of a child. The novel ends on a very typical fairy tale like note. Alice wakes up          to realize that she has been dreaming. However the fairy tale end is only          for Alice. Her sister is the one who leads her out of the dream to the          world of reality. In a waking reality she sees in her minds eye all that          Alice had dreamt. In her imagination, time - past, present and future          collapse. The past (Alices dream) is re-experienced by Alices sister,          who is symbolic of the present. This leads her (Alices sister) to foresee          the days when her sister would gather round her a dozen bright and innocent          children who would in turn listen with curiosity all about that intriguing          land called \"Wonderland\". ", "analysis": "", "url": "https://web.archive.org/web/20180820042551/http://www.pinkmonkey.com/booknotes/monkeynotes/pmAlice05.asp"}