{"name": "overview", "summary": "Summary    The book begins with a bonfire celebration on the fifth of  November, Guy Fawkes Day. It is a tradition on Egdon Heath, and  many of the village folk have gathered. They discuss the recent  events of the heath, and much of the conversation centers on  Thomasin Yeobright and Damon Wildeve, who were supposedly  married earlier in the day. When Thomasin's aunt, Mrs. Yeobright,  finds out from her niece that the marriage has not taken place, she  goes into the inn that Wildeve owns, \"The Quiet Woman,\" to  demand an explanation from him. With the arrival of heath people  to sing to the supposed newlyweds, aunt and niece slip out the  back, and Wildeve leaves for a tryst with Eustacia Vye, his former  lover who has signaled him to come to her again. With the help of Johnny Nunsuch, Eustacia is tending a bonfire  before the house of her grandfather, Captain Vye. She is awaiting  the arrival of Wildeve, who was her lover before his latest  infatuation with Thomasin. The beautiful Eustacia is not about to  let Wildeve go or forget about her. That is why she has signaled  him. Almost at her beck and call, Wildeve arrives. Neither  Eustacia nor Wildeve, however, is willing to openly pledge their  love for one another    Venn, the reddleman and an admirer and rejected suitor of  Thomasin, accidentally comes to hear of the meeting between  Eustacia and Wildeve from Johnny Nunsuch, who also tells him  the couple will meet again the next day. He eavesdrops on their  conversation when they meet at Rainbarrow. Venn goes to  Eustacia and requests her to help Thomasin, revealing that he  knows of her meetings with Wildeve. Venn, in turn, offers to  marry Thomasin; however, Mrs. Yeobright only uses Venn's offer  as a weapon to force Wildeve into marrying Thomasin, but her  plan backfires. Wildeve rushes to Eustacia and asks her to leave  with him for America. She does not give him a definite answer. Meanwhile the news of the arrival of Clement Yeobright becomes  common knowledge in every house on the heath. Eustacia is quite curious about this native of the Heath who has  travelled to Paris, something that she herself has often longed to  do. Losing interest in Wildeve, Eustacia tells Venn that she would  assist in the marriage of Thomasin and Wildeve. Eustacia writes  Wildeve a letter, and he seeks vengeance on her by deciding to  marry Thomasin, just as Eustacia has planned. With Eustacia  ironically giving away the bride during the marriage ceremony,  Wildeve weds Thomasin. Clym has returned to Egdon Heath for good and wants to become a  schoolteacher for the poor and needy. He has given up what his  mother considers a promising career, that of business manager to a  diamond merchant in Paris. She strongly disapproves of his career  decision and of his growing attraction for Eustacia Vye. Clym soon  proposes to Eustacia and is accepted. Eustacia is hopeful that they  will soon permanently leave the heath, which she hates, and return  to Paris. Mother and son quarrel over Clym's love of Eustacia. Clym leaves  his mother's house and rents a cottage in Alderworth. He then  persuades Eustacia to marry him immediately, and Mrs. Yeobright  does not attend the wedding. As an act of reconciliation, Mrs. Yeobright sends a small inheritance of a hundred guineas both to  her son Clym and her niece Thomasin. Christian Cantle is to  deliver the money, but he loses all of it while gambling with  Wildeve, who is angry that Mrs. Yeobright did not trust him with  the money. Venn wins the money away from Wildeve and gives  the entire sum to Thomasin, not knowing that half of it was meant  for Clym. ", "analysis": "", "url": "https://web.archive.org/web/20180820044717/http://www.pinkmonkey.com/booknotes/monkeynotes/pmReturnNative06.asp"}