{"name": "overview", "url": "https://web.archive.org/web/20180820032827/http://www.pinkmonkey.com/booknotes/monkeynotes/pmGreenwood07.asp", "summary": "On Christmas Eve the members of the Mellstock choir prepare themselves for the annual caroling. Mellowed by generous mugs of cider, the men and boys gather at the home of Reuben Dewy, from where they depart with their fiddles. The first stop is at the school to sing for Fancy Day, the new schoolmistress. At first there is no indication that she has heard them, but at last she appears, framed picture-like at a window. Later the men miss young Dick Dewy. They find him leaning against the school, staring up dreamily at the now darkened window. At church on the following morning, Fancy Day causes a stir of excitement. She is the primary attraction for three men: Dick Dewy, Farmer Shiner, and the new vicar, Mr. Maybold. She also commits what amounts to blasphemy when she leads the young girls in singing along with the men. As long as anyone can remember, only the males have provided music for the church service. Some of the older and wiser men foresee more trouble from a girl who is so forward. Mr. Dewy, Dick's father, is a well-respected man, who is called the Tranter by everyone in town. Each year he gives a holiday party, held in the afternoon and evening on Christmas Day. During the dancing, Dick is alternately delighted and depressed by Fancy. He is very happy when he can claim her as his partner, but he feels dejected when she dances with Farmer Shiner, who is a handsome and wealthy man. When Farmer Shiner takes her home, the evening is ruined for the young Dick. After a few days, using a handkerchief left behind by Fancy as an excuse, Dick finds courage to call on the schoolmistress at the school. Being a very inexperienced lover, he simply returns the handkerchief, stammers a good day, and departs. Through the remaining winter, he pines away in silence for Fancy. By the time that spring arrives, Dick has become a pale and shadowy figure of a man. It is obvious to all, except Fancy and her two other admirers, that Dick is not himself, but no one is certain of the cause since he says nothing of his feelings. The male church choir is upset, for the members have heard disquieting rumors that they are to be displaced by an organ, played by Fancy Day. They learn from the new vicar, Maybold, that their fears are well founded, for he has brought an organ to the church, preferring that instrument to the voices of a choir. Out of kindness to the choir members, he agrees to wait for a time before dispensing with their singing; he also promises to have their last performance on a special day, rather than on an ordinary Sunday. Dick is excited to learn that Fancy is to dine at the Dewey home. When he arrives, full of excitement to see her, he is dismayed to find Farmer Shiner already present at the house. During dinner, however, his spirits rise when Fancy allows him to touch her hand. He is even more excited that he is to drive her home and plans to state his feelings for her. During the trip, however, Dick cannot find the words to express what is in his heart. In the weeks following the dinner, Dick hears many rumors about Fancy's friendliness with the vicar and Farmer Shiner; the news drives him to desperation. One day, he steels himself and writes Fancy a letter, asking bluntly whether he means anything to her. When he receives no reply from her, he resolves that he will have it out with Fancy the next Sunday. Before Sunday arrives, however, he has to go on an errand for the vicar's mother, which will take him to a neighboring town. As he is about to leave the village, he sees Fancy waiting for the carrier to take her home. Seizing the opportunity, Dick helps her to get into his cart and triumphantly carries her off. On the way home, he finally proposes to her. He is both surprised and overjoyed to hear her acceptance. Fancy and Dick keep their betrothal a secret, for they cannot marry for sometime. Also, Fancy's father has told her that he hopes she will accept Farmer Shiner as her husband, since he is wealthy and available.", "analysis": ""}