{"name": "overview", "summary": "The novel  is divided into five books with a framing introduction. In the introduction, the  character-narrator Jim Burden meets an old friend with whom he grew up in Nebraska. She is the fictional writer of this introduction. She describes him as a successful  lawyer who is unhappily married to a socialite. They discuss their love of the  Midwest and the fact that no one who didnt grow up on the Midwest during its  early days of colonization would understand the experience. He tells her he has  been writing about a girl whom he grew up with named Antonia. Weeks later, he  brings her the completed manuscript. In Book 1, Jim Burden is a boy of ten. He has been orphaned recently and his relatives in Virginia have sent him to live  with his paternal grandparents in Nebraska. On the train to Black Hawk, Nebraska  he is accompanied by Jake Marpole, a man who has been hired by Jims grandparents. He hears about an immigrant family on the train who are also headed for Black  Hawk but is too shy to meet them. They turn out to be the Shimerdas and they are  from Bohemia. Jake finds life on his grandparents farm exciting and also  nurturing. He has Otto Fuchs, their Austrian hired hand, to admire, his grandmother  to care for him, his grandfather to provide moral instruction, and soon he meets  the Shimerdas. The Shimerdas have been badly cheated in their move out to the  land and they are in great need. Jim is impressed with Mr. Shimerda, a gentlemanly  man who is respectful of children, but he is bothered by Mrs. Shimerdas importunate  manners and her eldest son, Ambroschs rudeness. He likes Antonia and Julka, the  two daughters of the family and begins to tutor them in English immediately. They  spend a great deal of time together and meet several of the neighboring settlers. Two of these are Peter and Pavel, Russian bachelors who have a nearby homestead. Antonia tells Jim all about her father who was a trombone player in Bohemia and  greatly admired for his skill and general erudition. He is very unhappy in the  United States, though he tries to do his best for his family. One day Jim is feeling peeved at Antonia for treating him like a kid. They are  playing around a prairie dog town and happen upon a five-foot long rattlesnake  which Jim kills. Antonia begins to respect him after that. During winter, Jims  family hears that the Shimerdas are eating prairie dogs, and they set out with  provisions to help get them through the winter. They find them near starvation  with little warm clothing for the winter. On Christmas day, the land is hit by  a blizzard and no one can get to Black Hawk to buy Christmas presents. They make  gifts for the Shimerdas and for each other. Otto Fuchs brings a tree home and  they decorate it with exquisite decorations his mother has been sending him from  Austria over the past years. Mr. Shimerda visits to thank them for the gifts and  stays for dinner. He is so pleased with the tree that he bows before it and prays. He seems perfectly contented in the Burdens cozy home. Weeks later, Mrs. Shimerda  visits along with Antonia. She snoops around the house exclaiming over all that  the Burdens have and all that she doesnt have. Mrs. Burden tells Jim to understand  that Mrs. Shimerdas rudeness probably comes from seeing her children in want. When Jim is eleven years old, Mr. Shimerda commits suicide. Since the Catholic  Church refuses to admit his body into its graveyard, the neighbor's appeal to  the Norwegians in the nearby Norwegian settlement, but they, too, refuse the body. Anton Jelinek, a new immigrant from Bohemia, explains the Catholic customs to  the Burdens and helps with the funeral arrangements. He tells a story of the Prussian  war when he was an altar boy to a priest. During a cholera epidemic, he and the  priest went into the killing fields to give the last rites to the dying soldiers  and never contracted cholera. Mrs. Shimerda wants the body to be buried at a crossroads. All the neighbors come to the funeral. It is one of the only times Jim sees all  of them together. Jim has a special feeling for this gravesite. The two roads  by pass it and a fence is put around it protecting it from all the development  of the land so that it is the last place where the red grass of the Nebraska prairie  is left natural. Spring arrives with a fury and Jim is euphoric over it. He  is saddened when Antonia can no longer play with him or take lessons from him  because she works the fields on her familys farm. When a school is opened, Antonia  cannot attend even though she is fifteen years old and eager to learn. Jake Marpole  gets into a fight with Ambrosch Shimerda over a halter that Ambrosch borrowed  and then misused. He hits him and knocks him down. Antonia and her mother come  running and Antonia tells Jake and Jim they are no longer her friends. Mr. Burden  sends Jake to town to pay a fine for the assault. While he is there he sells a  pig. The Shimerdas find out that he sold a pig the same day he paid the find and  think one was done to pay for the other. They are satisfied that Jake has paid  a high price and Antonia taunts him whenever she sees him. Weeks later, Mr. Burden  decides to heal the rift by inviting Ambrosch to come help with his harvest and  Antonia to help Mrs. Burden in the house. He also gives Mrs. Shimerda a cow that  she has bought from him but only partially paid for. Jim enjoys having Antonia  in the house while she is working for his grandmother and they get to have nice  talks as they used to. Book 2, titled \"Hired Girls\" is begun three  years after the novels opening. Jims grandparents move to Black Hawk for their  retirement. Otto and Jake leave for gold prospecting in the West. Jim settles  into the ways of a town boy. He loves to spend time with the Harlings, the Burdens  next door neighbors. Mr. Harling is a successful cattle buyer and is most times  away from home. Mrs. Harling is an energetic and loving woman who makes the childrens  lives fun. Mrs. Burden arranges to get Mrs. Harling to hire Antonia as her housekeeper. She wants Antonia to learn manners and to save her from the drudgery of farm work. Antonia, now seventeen years old, loves working for the Harlings. Jims happy  times at the Harlings are periodically interrupted by the return of Mr. Harling  who takes all of Mrs. Harlings attention away from the children. One day  Lena Lingard comes to visit the Harlings and asks Antonia to come and see her  sometimes. Antonia is reluctant to be friendly to her. Jim learns that Lena has  a bad reputation on the prairie. She is the eldest daughter of a poor-farming  family. Her job has been to herd cattle. A neighbor man, Ole Benson, became infatuated  with her and spent his days with her. His wife, Crazy Mary, tried to kill Lena. At Christmas, Jim sees Lena at a Black Hawk store helping him make purchases for  the family. He is touched by her devotion to her family. She tells him she is  determined to build her mother a house some day. Winter hits Black Hawk hard,  but Jim enjoys warm times at the Harlings where Antonia has become a second mother  to the children. Once she tells the story of a threshing suicide. She was working  on the threshing machine during a harvest and a man came walking up out of the  blue. He spoke strangely to her and then called up to the man working the thresher  to let him have a go at it. As soon as he got up there, he dove into the thresher  and died. One day Jim hears that Blind dArnault is coming to town. He plays for  the men at the Boys Club, a favorite hotel among traveling salesmen and railroad  men. He hears Blind dArnaults story. He is a Black man who grew up in the south  on a plantation. He was blind from birth and developed a habit of rocking back  and forth. His mother loved him but was ashamed of him so she hid him away. He  loved to get away and listen outside the house of the white plantation owners  to the piano music. One day he crawled into the window and began playing. When  the white mistress found him, she gave him piano lessons. Since then he travels  around playing the piano for white audiences. In the summer, the Vannis, an  Italian couple, come to town and set up a dance company. All the middle-class  children in town take dance lessons during the week and on Saturday night, there  is a dance open to all. Middle-class town boys get the chance to dance with the  hired girls who have come in from the country to work. One of these boys is Sylvester  Lovett, the town bankers son. He becomes infatuated with Lena, but after dallying  with her for a time, he rushes into a marriage with a widow who has land. Antonia  begins to love dancing and spends all her free time preparing for the dances. One night Mr. Harling hears her slapping a man who has escorted her home and tried  to force a kiss out of her. He forbids her from going to the dances any more. She refuses to let him dictate her private life and quits. Quitting means she  will be ostracized by the Harlings. She goes to work for the Cutters, an extraordinarily  quarrelsome couple. Mr. Cutter has made his fortune by charging usurious interest  rates to farmers. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMyAntonia08.asp"}