{"name": "overview", "summary": "Pride and Prejudice is the story of Mr. and Mrs. Bennet and their five unmarried daughters. They live in the estate of \nLongbourn in Hertfordshire, a rural district about thirty miles from London. The family is not rich. Their property is \nentailed to pass to the nearest male heir in the family, in this case to Mr. Collins. The main concern of Mrs. Bennets \nlife is to see that all her daughters are married, preferably to men with large fortunes. She sees an opportunity for her \neldest daughter Jane when Mr. Charles Bingley, a wealthy gentlemen from the city, occupies the nearby estate of \nNetherfield Park. In her excitement, she urges her husband to visit Mr. Bingley on the very first day of his arrival, \nbefore any of the other neighbors. Mr. Bennet complies to his wifes request and visits Mr. Bingley, but withholds \ninformation about his visit from the family.<PARAGRAPH>At the next social gathering in Meryton, Bingley brings along his two sisters, Caroline Bingley and Louisa Hurst. But \nmore importantly, he brings his closest friend, Mr. Fitzwilliam Darcy. Bingley, who is charming and social, is \nimmediately attracted to the modest and gentle Jane Bennet. Darcy, in contrast to Bingley, is proud, rude, and \ndisagreeable. When Bingley suggests that Darcy dance with Elizabeth Bennet, he refuses and negatively comments on \nher looks. Elizabeth overhears the comment and develops a strong prejudice against Darcy. At the next ball in \nNetherfield, Darcy feels an attraction for Elizabeth and asks her for a dance. She refuses to dance with him, thereby \navenging the earlier insults.<PARAGRAPH>Jane and Bingley continue to be attracted to one another. Caroline Bingley invites Jane to Netherfield for a visit. While \nat Netherfield, Jane falls ill and Elizabeth comes to look after her sister. While at Netherfield, Elizabeth is forced to \nconfront Darcy. She approaches him with wit and sarcasm. Since Darcy has known only flattery from others, he is \ncharmed by Elizabeths frankness. During her short stay at Netherfield, Elizabeth realizes Caroline is very \ncontemptuous of her family, its social status, and Mrs. Bennets vulgarity. Elizabeth concludes that Carolines \nfriendship and cordiality towards Jane is only a pretense.<PARAGRAPH>The male relative to whom the Longbourn estate is entailed is Rev. William Collins of Hunsfort. Mr. Collins pays a \nvisit to Longbourn with the intention of proposing marriage to one of the Bennet daughters. His pompous manners and \nhis bloated rhetoric disgust everyone, except Mrs. Bennet, who looks upon him as a prospective son-in-law. Collins is \nattracted to Jane, but Mrs. Bennet informs him that she is about to be engaged. He then turns his attention to Elizabeth \nand makes a ridiculous proposal of marriage to her. When Elizabeth rejects him, he proposes to her friend Charlotte \nLucas, who, to everyones shock, accepts him. Mrs. Bennet is distressed by Elizabeths rejection of Mr. Collins \nbecause it is the one opportunity she has of keeping the Longbourn estate in the family.<PARAGRAPH>Bingley and his companions soon depart for London. Both Bingley and Caroline write to Jane to say that they have \nclosed Netherfield and have no plans of returning to it in the near future. Jane is very disappointed. As Jane feels \nfrustration over Bingley, Elizabeth finds a new attraction. She meets Mr. Wickham and is foolishly and magnetically \ndrawn to him. They have a friendly conversation in which she reveals her dislike of Darcy. Taking advantage of this \ninformation, Wickham concocts a story and tells Elizabeth that he has been cheated by Darcy. Elizabeth takes pity on \nhim and almost falls in love. Mrs. Gardiner, however, warns Elizabeth about Wickham, who soon marries Miss King.<PARAGRAPH>At the invitation of the Gardiners, Jane goes to London for some rest and change of air. She hopes that she sees \nBingley, even accidentally. Jane makes many attempts to get in touch with him, but Caroline does not even inform her \nbrother about Janes presence in London. Jane is heart broken, but grows to accept her rejection.<PARAGRAPH>Elizabeth goes to Hunsford to visit Mr. Collins and his new wife Charlotte, who is Elizabeths dear friend. During \nElizabeths stay in Hunsford, Darcy happens to visit his aunt, who also lives there, and attempts to build a relationship \nwith Elizabeth. To her surprise, Darcy proposes marriage to her in a language so arrogant that Elizabeth turns him \ndown indignantly. She asks him how he dares to propose to her after separating Jane and Bingley, who were in love \nwith each other, and after victimizing Wickham. She ends her tirade by saying that she would not marry him even if he \nwere the last man on the earth. Darcy is upset and leaves in a huff. The next morning he meets Elizabeth when she goes \nout for a walk and hands her a long letter that answers all her accusations. He explains to her that he did not believe \nthat Jane was really in love with Bingley. He also tells her the truth about Wickham. Elizabeth is shocked by his \nanswers.<PARAGRAPH>There is also another shock awaiting her. Her youngest sister Lydia has been invited to Brighton by a young officers \nwife. Lydia is very excited about the trip; but Elizabeth knows how stupid, scatter brained, and flirtatious Lydia is. She \ntries to persuade her father not to allow Lydia to go to Brighton. Her father, however, dismisses Elizabeths fears.<PARAGRAPH>Mr. and Mrs. Gardiner plan a tour of the Lake District and take Elizabeth with them. At the last minute, however, the \ntour is cut short and the Gardiners decide to restrict their trip to Derbyshire, where Darcy has his vast estate in \nPemberley. Elizabeth makes sure that Darcy is away on business and then agrees to visit Pemberley, out of sheer \ncuriosity. Pemberley is one of the most beautiful places she has ever visited, and Darcys elegant tastes are evident \neverywhere. To top it all, Ms. Reynolds, the housekeeper who has known Darcy since his childhood, speaks very \nhighly of him, saying he is just and fair. Elizabeth cannot believe that she has made such a mistake in judging his \ncharacter. As Elizabeth is looking over Pemberleys lovely grounds, Darcy himself appears, returning a day before he \nis expected. He looks surprised to see Elizabeth, and she is intensely embarrassed. He is polite to her and the \nGardiners, and Elizabeth notices that there is no trace of pride in him.<PARAGRAPH>The following day, Bingley calls on Elizabeth, and his anxious inquiries about Jane indicate that he is still in love with \nher. Darcy and his beautiful sister, Georgiana, also call on Elizabeth at the inn to invite her and the Gardiners to dinner. \nElizabeth accepts the dinner invitation. During the dinner, Caroline tries her best to destroy the friendly relationship \nbetween Darcy and Elizabeth by running down Elizabeths family, but she does not succeed. Darcy is fond of \nElizabeth.<PARAGRAPH>News comes that Lydia has eloped with Wickham, so Elizabeth leaves Derbyshire with the Gardiners to return home. \nAll attempts at tracing the runaway couple have failed. Darcy, touched by Elizabeths distress over Lydia, seeks to find \nher and catches up with the couple in London. Darcy convinces Wickham to marry Lydia, gives him ten thousand \npounds, pays up his debts, and persuades him to settle in the North of London. Darcy then requests that the Gardiners \nnot reveal his help to the Bennet family. Elizabeth, however, finds out the truth about Darcys assistance. She is \nimpressed with his kindness.<PARAGRAPH>Bingley makes an unannounced reappearance at Netherfield Park, and renews his courtship of Jane. They are soon \nengaged. Lady Catherine also arrives unannounced and acts very haughty towards the Bennet family. She threatens \nElizabeth with dire consequences if she marries Darcy, but Elizabeth refuses to promise that she will not accept a \nproposal from Darcy. A few days later, Darcy comes to visit and makes a second proposal of marriage to Elizabeth. \nThis time she accepts wholeheartedly. He thanks Elizabeth for teaching him the lesson of humility.<PARAGRAPH>The two couples, Jane and Bingley and Elizabeth and Darcy, are married on \n        the same morning. Mrs. Bennet is overjoyed at having three of her daughters \n        married, two of them to very rich young men. After a years stay at Netherfield \n        Park, Bingley purchases an estate in Derbyshire. His mother-in-laws tiresome \n        company and her vulgar behavior are too much even for his calm temperament. \n        The novel finally ends on a note of reconciliation with all of the characters \n        trying to forgive and forget past insults.", "analysis": "", "url": "https://web.archive.org/web/20190903025227/http:/thebestnotes.com/booknotes/Pride_And_Prejudice_Austen/Pride_And_Prejudice_Study_Guide04.html"}