{"name": "overview", "summary": "Dr. Jekyll and Mr. Hyde is the story of a gifted doctor who  discovers a drug which can release the evil side of one's nature. This drug changes Dr. Jekyll into Mr. Hyde. Stevenson does not  reveal the details of Jekyll's story until the end of the novel, but  presents the tale as a mystery, in which the main characters try to  figure out the identity of Mr. Hyde and understand his strange  relationship with Dr. Jekyll. Stevenson begins the novel on a street in Soho. Mr. Utterson, a lawyer,          and his cousin, Mr. Enfield, are taking their usual Sunday walk. They          stop at an unusual door, and Enfield tells Utterson that sometime back,          he had seen a strange and ill-tempered man trample a small girl and then          walk away. Enfield and other bystanders had forced the stranger to pay          money to the girl's family to avoid trouble. The man then entered the          door and emerged with ten pounds in gold and a check signed by Dr. Jekyll. This stranger is none other than Mr. Hyde. Enfield has a hard time describing          Hyde, other than to say that everyone present found him strangely repulsive. Utterson returns home, deeply disturbed, as Jekyll's will, which is  in his possession, stipulates that in the event of his death or  disappearance, his entire estate should go to his \"friend and  benefactor Edward Hyde.\" He visits Dr. Lanyon, a mutual friend,  to ask him if he knows anything of Hyde, but Lanyon has had a  falling out with Jekyll and has lately seen little of him. Utterson  begins searching for Hyde. One evening, he meets him at the door,  but Hyde, suspicious of Utterson's intentions, becomes enraged  and runs into the house. Like Enfield, Utterson, too, is repulsed by  Hyde and cannot say exactly why. He goes to Jekyll's house and  meets with Poole, Jekyll's butler. At this point it is revealed that  the mysterious door is the back entrance to Jekyll's house. Poole  tells Utterson that Hyde has access to the house and that the  servants have orders to obey him. After a dinner party a few weeks later, Utterson tries to persuade Jekyll          to have his will changed, but Jekyll insists that he cannot and asks that          Utterson please comply with his wishes regarding Hyde. Utterson is convinced          that Hyde is blackmailing Jekyll for some youthful indiscretion. Nearly a year later, Hyde murders Sir Danvers Carew, a  respectable gentleman. Knowing of Jekyll's and Hyde's  association, Utterson visits Jekyll and is surprised to find him  looking ill. Jekyll presents to Utterson a letter which he says is  from Hyde. It states that Hyde is making good his escape and that  Dr. Jekyll need not take any further trouble regarding his safety. Hyde vanishes and Jekyll regains his health and spirits. He even  reconciles with Lanyon. Shortly after a dinner party, however, he  goes into sudden seclusion and refuses to see Utterson. Perplexed,  Utterson again visits Lanyon and is shocked to find him near death. Lanyon does not wish to talk about Jekyll. A few weeks later,  Lanyon dies. Among his papers is an envelope addressed to  Utterson, with the instructions that it not be opened except on the  death or disappearance of Jekyll. Utterson, feeling that Hyde must  somehow be involved, is both curious and suspicious, but he does  not open the envelope. Jekyll continues to remain in seclusion, and eventually Utterson stops          attempting to see him. One Sunday, Utterson and Enfield go for their usual          walk and happen by the back of Jekyll's house. They see Jekyll sitting          near the window, looking sad and ill. They speak to him, and he brightens          momentarily, before being struck with a look of terror and pain and closing          the window. Enfield and Utterson are terrified and walk away in silence. Although they do not realize it, they have witnessed the beginning of          the transformation process from Jekyll to Hyde. One evening, Poole comes to Utterson and asks him for his help, and they          return to Jekyll's house. Jekyll has recently been acting very strangely,          having locked himself in his laboratory and sending Poole out to various          chemists in search of a certain drug. Poole has not heard his master's          voice in over a week, and he fears that Jekyll has been murdered and that          someone or something is hiding in Jekyll's laboratory. When the two men          break into the laboratory, they discover the body of Edward Hyde. It appears          that Hyde has committed suicide. Searching in vain for Dr. Jekyll's body,          they find an enclosure from Jekyll addressed to Utterson, instructing          him to read Dr. Lanyon's note and then, if he so wishes, his own, enclosed          confession. The last two chapters consist of these documents. Dr. Lanyon, in his          note, reveals that he has discovered that Jekyll and Hyde are one. Dr. Jekyll confesses through his written statement that he had wanted to separate          the good and the bad aspects of himself and had discovered a drug, which          would allow him to do so. By turning into Mr. Hyde, his evil aspect, he          could commit various sins and escape punishment or censure for them. Although          he was ashamed of himself, he could not help his actions. Over time, Hyde          became stronger, and eventually he was becoming Hyde without the aid of          the drug. He managed to keep Hyde in check by taking the drug which transformed          himself back into Jekyll, but eventually his supply began to be exhausted,          and, due to an unknown impurity in his original batch, he could not make          any more of it. He writes his confession as Jekyll, under the influence          of the last of the drug, knowing that soon thereafter, he will turn into          Hyde for the very last time. He does not care what happens to Hyde after          that, for at that moment, his own life, as Jekyll, will be over. ", "analysis": "", "url": "https://web.archive.org/web/20180820041120/http://www.pinkmonkey.com/booknotes/monkeynotes/pmJekyll05.asp"}