{"name": "overview", "summary": "Emma  is a social comedy revolving around the domestic life of a few families of the  upper middle class, primarily the landed gentry, in the small town of Highbury. The key families of the novel and Highbury society are the Woodhouses of Hartfield,  the Knightleys of Donwell Abbey, the Westons of Randalls, a merchant family by  the name of Coles, the vicar Mr. Elton, old Mrs. Bates, and her middle-aged unmarried  daughter Miss Bates. The novel opens with Emma, the twenty-one year old daughter  of the sick, old Henry Woodhouse, boasting of her success in getting her governess,  Miss Taylor, married to the middle-aged widower, Mr. Weston of Randalls. Emma  herself has resolved never to marry, for she cannot bear the thought of leaving  her old father. She, therefore, amuses herself by arranging marriages for others  and believes herself good at matchmaking. She is eager to arrange the marriage  of Mr. Elton, the twenty-seven year old clergyman who often visits Hartfield to  play cards. Her brother-in-law, Mr. Knightley, who also visits Hartfield regularly,  advises Emma not to think of Mr. Elton's marriage. In spite of the advice, she  begins to groom the good-looking and sweet-tempered Harriet Smith to become Elton's  wife. Since Harriet thinks she is in love Robert Martin, a tenant farmer, Emma  must convince her not to marry below her rank. Emma does all kinds of things to encourage Harriet to fall in love with Mr. Elton,  the Vicar. She invites Elton to stay at Hartfield while she draws the portrait  of Harriet. Then she plays riddles with Elton and makes Harriet enter Elton's  riddles in her diary. One day in the course of her morning walk with Harriet,  Emma cleverly breaks her shoe laces and goes to Elton's house with Harriet on  the pretext of mending her laces. She assumes things are going well between Harriet  and Elton; then to Emma's surprise, during Christmas week, Elton proposes to her. Emma rejects his proposal and points out that his real object of love should be  Harriet Smith. Hurt by Emma's rejection, Elton goes to Bath and stays for three  weeks. While in Bath, he wins the love of Miss Augusta Hawkins, the daughter of  a tradesman, who has a dowry of ten thousand pounds. While Elton is away from  Highbury, Jane Fairfax comes to stay in Highbury with her aunt, Miss Bates. Emma  imagines fancifully that Jane is in love with Mr. Dixon, the son-in-law of Colonel  Campbell, who raised Jane. In the meantime, Emma finds herself romantically attracted  to Frank Churchill, who is secretly engaged to Jane. Realizing Emma's romantic  fantasies about him, Churchill uses her to hide his engagement to Jane. Emma plays  into his hands, flattered by his compliments on her appearance. At a party given  by the Coles, Emma and Frank talk and laugh. Jane feels humiliated by Frank's  frivolous behavior. On the other hand, Emma finds Jane too reserved; she also  resents Jane, who is much more accomplished and elegant in manners than Emma   At the Coles' party, Frank decides to arrange a ball. The Westons immediately  agree, and the Crown Inn is selected as the place. A day before the party, Frank  gets the news that his aunt, Mrs. Churchill, is seriously ill; therefore, Frank  leaves for Yorkshire. Before departing, he indicates that he wants to speak to  Emma, but then he does not. Emma foolishly concludes that Frank intends to propose  to her, but she is not sure she loves him. Emma also senses that Knightley is  attracted to Jane Fairfax. She does not want him to marry Jane, for she wants  her nephews to inherit his property. When Frank returns, the ball at the Crown  Inn is held. Emma dances with both Frank and Knightley. On the day after the ball,  Harriet, during her walk, wanders into a camp of gypsies from whom she feels a  threat. Luckily, Frank happens to be passing by and saves her. When Harriet narrates  this misadventure and her rescue from the gypsies to Emma, Emma thinks that Frank  is now falling in love with Harriet. She is happy for Harriet who, however, tells  Emma that she loves someone much superior in status and intelligence. Knightley  suspects that Frank and Jane are romantically involved, but Emma does not agree  with him. As desired by Mrs. Elton, Knightley arranges a strawberry party  at Donwell Abbey, where Emma sees Knightley walking with Harriet. She also notices  that Jane leaves early, and Frank arrives very late. The next day, everyone goes  for a picnic to Box Hill. Emma and Frank behave in a very frivolous manner, with  Emma being very rude to Miss Bates; their behavior clearly annoys Jane. When the  party leaves Box Hill, Knightley accompanies Emma to her carriage and criticizes  her for her lack of elegance and vanity. Emma, feeling very ashamed, weeps on  her way home, fearing that she has lost Knightley's affection and goodwill. The  very next day Emma visits the Bates to apologize to Miss Bates and Jane. Jane,  however, refuses to greet Emma, and Miss Bates informs her that Jane has accepted  a job as a governess with the Smallridges in Bath. Frank's hopes of inheriting  the property of the Churchills are fulfilled. Now a wealthy man, he writes a letter  to his father to inform him about his secret engagement to Jane. It is during  this time that Harriet also confides in Emma that she loves Knightley. At this  news, Emma is shocked to realize that she herself is in love with Knightley. She  wishes she would have allowed Harriet to marry Robert Martin. In the meantime,  Knightley, without Emma's knowledge, has succeeded in bringing Harriet and Martin  together. When Emma breaks to Knightley the news of Jane's engagement to Frank,  Knightley tells her about Harriet's engagement to Martin. He praises Emma for  having refined Harriet's manners. He then proposes to Emma, who readily accepts. He admires Emma for her attachment to her father and agrees to live with her at  Hartfield after their marriage. The novel ends as a comedy. With the marriages  of Jane and Frank, Harriet and Martin, and Emma and Knightley, all of the major  characters of the novel are delightfully happy. ", "analysis": "", "url": "https://web.archive.org/web/20180820053844/http://www.pinkmonkey.com/booknotes/monkeynotes/pmEmma06.asp"}