{"name": "overview", "summary": "As the play opens, the reader sees Timon leading a happy and  prosperous life. He is a man who is known for his generosity. The reader, at this moment, can sense the outcome of his actions,  that is, his downfall. Timon is a rich aristocrat of Athens. He  loves and trusts his friends and compares them to brothers  commanding one anothers fortune. He runs into debt because  he is always lavishing expensive gifts on them. He is always  ready to come to the assistance of his friends who are in need, for  instance, his timely offer of money helps to free his friend  Ventidius from prison. Ventidius had been arrested for not  paying his debts. Ventidius offers to return the money because he  knows that Timon will brush aside his offer. The only true friend  of Timon is probably Apemantus, who often criticizes Timon for  his irresponsible actions. Timon however pays no heed to his  warnings. Towards the end of the first Act, the readers learn  about Timons empty coffer and mortgaged land. However,  Timon takes the whole situation very lightly as he has full faith  in his friends. Timons faith in his friends is similar to the faith  of Lear  in his daughters Regan and Gonevil. One notices that the scene is reversed in the second and third act. Timon discovers that he is in debt when creditors gather around  him. He sends his servants to his friends to get help, but they  all refuse by giving some excuse or the other. It is ironic that  Ventidius, who owes much to Timon for his help during his  crisis, refuses to help him when he is in need. Here Timons  good nature is contrasted with the corrupt society around him. Timon is not only hurt by this betrayal of his friends but is also  shocked by the nature of mankind. He decides to teach them a  lesson and show them what they are worthy of. He invites them  for a banquet. The guests arrive happily, thinking that they will  once again receive gifts from Timon. They however are in for a  surprise. When they uncover their dishes to eat, they discover  that they have only been served warm water. When they express  their surprise, Timon throws the warm water on them, curses  them and throws them out of his house. Flavius, the faithful  steward, feels sorry for his masters condition. Timon leaves the  city of Athens and takes shelter in a cave in the woods. One day  as he is digging for roots to eat, he unearths plenty of gold. Alcibiades comes to the woods to meet Timon. Two prostitutes,  Phrynia and Timandra accompany him. Timon is very angry to  see Alcibiades and the others because he does not want anything  to do with mankind. He bribes the two prostitutes with gold and  asks them to continue with their profession and spread venereal  diseases. When Alcibiades tells him of his plans to attack  Athens, Timon is very happy and advises him to not even spare  the lives of babies and women. Later Apemantus comes to visit  Timon in the woods. Their conversation soon leads to an  argument and then to abuse and Timon chases him out by  throwing stones at him. One-day robbers attack Timon, in order  to loot the gold that he possesses. Timon, who is now completely  disillusioned by mankind, offers them gold and asks them to  continue with their villainy. Timons faithful steward Flavius  also comes to visit Timon. When Timon is sure of his loyalty, he  offers him some of his newly found treasure on the condition  that, he will hate and curse mankind and not show charity  towards anybody. The news that Timon has acquired a fortune  reaches Athens. All the people who had earlier betrayed him now  rush back to him. But, Timon is now an enlightened man and can  distinguish true friends from false ones. When the painter and the  poet approaches Timon for gold, Timon beat them up and sends  them away. In the meantime, Alcibiades threatens the Senators of Athens. They come to the woods to seek help from Timon. Timon does  not bother to listen to them, as he no longer cares about what  happens to mankind. Readers can now see the contrast between  the prosperous Timon of Athens and the Timon, who is in the  woods after his fall. The disappointed Senators return to the city. There is a lot of similarity in the story of Timon and his friend  Alcibiades. Alcibiades is the commander of the army. His friend,  who was a soldier, had been sentenced to death for committing a  murder. Alcibiades begs the Senators to spare his life, as he had  killed in self-defense. Instead of listening to his request, the  Senators banish him for supporting a wrong cause. Therefore he  too is disillusioned by the behavior of the Athenian Senators. This is specially because he has done so much for the city. But,  unlike Timon, Alcibiades assembles a military force and marches  towards Athens to avenge against the Senators. The Senators  know that they will not be able to defend themselves against  Alcibiades and his huge army and therefore surrender. Alcibiades, in the meanwhile, learns that Timon is dead and that  somebody has buried him in the woods. Alcibiades therefore is  very sad. But, at the same time, there is hope, as Alcibiades  decides to establish a government based on noble principles. ", "analysis": "", "url": "https://web.archive.org/web/20180820050202/http://www.pinkmonkey.com/booknotes/monkeynotes/pmTimon08.asp"}