{"name": "overview", "summary": "Amelia Sedley and Rebecca Sharp leave Miss Pinkertons  academy and are ready to face the world. Amelia is a well to do  businessmans daughter, while Rebecca  is the daughter  of a poor artist and a disreputable opera dancer. Before Becky  can join her employers at Queens Crawley where she is going  as a governess for two girls, she stays with Amelia in her grand  home at Russel Square. Amelia has an elder brother, Joseph , employed in India,  who returns home and Becky sees this as a great opportunity to  seize and marry him. This would be her short cut to  respectability, which she is out to achieve. But her hopes are  shattered. She flatters and entices Jos, just enough so that he  proposes to her. Jos he gets drunk out of nervousness and, to  everyones embarrassment, creates a scene. Later, realizing the  indiscretion with which he acted, Jos flees to Scotland. Becky is  a little disappointed but she is all set to start afresh. Lt. George Osborne is the handsome Godson of Mr. John  Sedley, who wants him to marry Amelia. Amelia and George  have liked each other since childhood. George has a devoted  friend called Lt. William Dobbin, who too is in love with  Amelia, but sacrifices his wishes for his dear friend. Rebecca makes herself endearing in Sir Pitt Crawleys home  and wins over everybody. Even the old spinster sister of Sir Pitt,  Miss Crawley, who has a fortune of seventy thousand pounds, is  impressed with her. Sir Pitts elder son, Pitt Crawley, is a rather  insipid man, but his younger son, Capt. Rawdon Crawley is  handsome and extravagant, besides he is a favorite of his rich  aunt and is to inherit all her fortune. Becky secretly marries  Rawdon, thinking that the old aunt will first be hysterical but  later forgive her dear nephew and her favorite companion. On the other side, Amelias father becomes bankrupt and their house          and possessions are auctioned. Becky buys a picture of Jos and Dobbin          purchases the old Piano on which Amelia used to play and sends it to her          modest home at Fulham Street. All this while, George is busy gambling          and flirting with the rich ladies in London. Georges father, Mr. Osborne,          is a materialistic man who forbids him to marry Amelia for now she cannot          bring along any money. Dobbin cannot bear to see Amelia suffering because          she is separated from George and so he compels George to accept her even          in her poverty. George too is fond of Amelia and they marry without Mr. Osbornes permission, who disowns his son for having married a ruined          mans daughter. By this time, the war approaches and Capt. George Osborne, Capt. Dobbin,          Amelia, Jos Sedley, Capt. Rawdon Crawley and Becky meet at Brighton. Miss          Crawley too is in the same town for health reasons. Rawdon tries to meet          her but under the influence of the rectors wife, Mrs. Bute Crawley , all signs of Rawdons reconciliation with          Miss Crawley are erased. From Brighton, the army moves to Brussels and during all this time Becky          is out to entice George, in order to have her revenge as he had a hand          in her failure with Jos Sedley. Amelia is hurt and jealous at the way          her husband flirts with Rebecca. When the call for war comes, George is          shaken and ashamed of his deeds. He wonders what will happen to Amelia          and his unborn child if he dies at war. Amelia is hysterical with pain          and fear of losing George while Becky is calm and assured that Rawdon          has left her a private fortune in the form of his possessions and horses. She begins to flatter Jos once again, to prey on him incase her husband          falls in the war. Amelia is furious with Becky when Becky comes to meet          her, and rebukes her for letting down her old friend . Just the          noise of cannons is enough to mortally scare Jos who flees from the scene          leaving Amelia in the care of the courageous and kind Peggy ODoud. At the end of the war, George dies and Dobbin takes care of Amelia. Old          Mr. Osborne comes to see his sons grave, but refuses to accept Amelia. Amelia is lifeless and indifferent to her surroundings after Georges          death and only comes to life, once her son is born. Georgy is everything          for her and she grows into a very loving, yet possessive mother. Seeing          Amelia busy with her son, Dobbin leaves for India, but regularly writes          to Amelia and sends gifts, books, and toys for his godson, Georgy. Rawdon and Becky move to Paris after the war. Becky considers the Parisian          high society as her practicing ground and pleases everyone there. Miss          Crawley back home, refuses to forgive them. The moment the news arrives          that Becky has given birth to a son, Miss Crawley chooses Pitt Crawley          as her inheritor and urges the marriage of Pitt with an affluent and graceful          Lady Jane. Once Becky is respectable in Paris, she is bored as her goal achieved. She compromises with the creditor in London and they shift back to their          own country, leaving a long trail of debts behind them in Paris. In London, the condition of Sedley family gets worse with time. Amelia          cannot do much for her child due to financial constrains. Miss Jane Osborne          meets Georgy and also convinces her father to take care of Georgy. Old          Mr. Osborne sends his lawyer to Amelia asking for the guardianship of          the child; Georgy is to stay with him and meet Amelia sometimes, for parting          with her son, Old Osborne is ready to pay Amelia a large sum. This agreement          enrages Amelia, but later she agrees to it as she realizes that she cant          provide well enough for her son. She feels guilty at being so selfish          as to obstruct the good fortune of his son and in deep anguish parts with          him. Miss Crawley dies leaving a meager sum for Rawdon and most of her property          for Pitt Crawley. Rebecca and Rawdon return to London and prey upon Raggles,          who is the former butler of the Crawleys. He works hard enough to earn          a posh apartment, which the couple rent but never pay him a shilling. Later, poor Raggles is a ruined man because of them. Becky advises Rawdon          to be on good terms with his brother and sister-in-law. Their relations          improve and while Rawdon is touched by Lady Janes kind heart, Becky is          all set to captivate Pitt with his intelligence. In the meanwhile Sir          Pitt dies and Pitt becomes the new Baronet and Member of Parliament. With          Sir Pitt, she gets an entry into the Court and begins to hobnob with the          cream of society. Beckys character comes to prominence as Rawdons character          diminishes. Rawdon is busy with his son when Becky is realizing her ambition          of getting respectability. A Rev. Binney proposes marriage to Amelia but she politely refuses. Amelia gets the news that Dobbin is planning to marry Glorvina, the sister          of Peggy ODowd, in India. She is heartbroken, but writes a nice letter          blessing the couple. Dobbin is hurt to read her letter, but the last straw          is the news that Amelia is marrying Rev. Binney, which comes in his           sisters letter. Dobbin rushes to England. He is very relieved when he          is informed and assured by Jos that Amelia has no such plans. Jos is travelling          home with Dobbin. Becky tries to carve a niche for herself in high society for which she          uses influential people like Lord Styne. Lord Styne helps to put little          Rawdon into a good school and sends Miss Briggs, her servant,  away for a better Job. He also gets Rawdon arrested          for debt. Rawdon writes a frantic letter of help to Becky who makes an          excuse of bad health and asks him to wait for the next day. Angry with          Becky, Rawdon seeks Lady Janes help who obliges. In the meanwhile, Becky          and Lord Styne are having a good time together and are shocked when Rawdon          enters into the house. Rawdon hits Lord Styne and ignores Beckys hysterical          repetitions that she is innocent. Lord Styne tells him that he has paid          large sums to Becky and Rawdon finds this true on checking her secret          drawer. Rawdon is wounded at the thought that Becky did not share her          money with him in the time of dire need while all his life he had shared          everything he had with her. He forsakes Becky and with some hesitation          accepts a position of Governor of Coventry Island offered by Lord Steyne. Fortune smiles upon Amelia as Jos returns to take care of his family. Their parents die shortly. Georgy is very happy in his new house. Dobbin          implores with Old Osborne to reconcile with his sons wife. The patriarch          agrees, but he dies before a meeting can be arranged. Nevertheless, he          leaves half his property for Georgy with a good annuity for Amelia, restores          her son to her, and leaves Dobbin enough money to become Colonel. During this time, Rebecca leads the life of a vagabond moving from place          to place. Whenever she settles in a place, her past is quickly known and          she is uprooted from there. Soon she begins to mingle with low and cheap          people. Jos, Amelia, Georgy, and Dobbin plan a trip to Pumpernickel and have          a great time together. One day, Jos meets Becky in a shabby condition,          living in a cheap Inn. She quickly wins his sympathy and by narrating          the false story of her son being torn apart from her by her husbands          family re-wins Amelias confidence. Dobbin can see through her pretensions          and tries to warn Amelia who is rude to him. Dobbin realizes that Amelia          does not love him and she is not worth all the adulation he has given          her. He leaves in a bitter mood. Amelia and Georgy miss Dobbin. At last, Amelia sets aside her scruples          of loyalty to her dead husband and writes to Dobbin the same day that,          Becky shows her proof of her late husbands infidelity. Soon Dobbin and          Amelia marry and settle near Queens Crawley. They establish a wonderful          friendship with the Crawleys. They have a daughter whom they name after          Lady Jane. Little Rawdon is taken care by Sir Pitt and Lady Jane who become his          parents. Georgy and Rawdon are good friends and fight over Lady Janes          daughter. While Becky lives on the money Jos Sedley leaves her before          dying, she is seen doing acts of charity, which is the best punishment          for her. ", "analysis": "", "url": "https://web.archive.org/web/20180820033155/http://www.pinkmonkey.com/booknotes/monkeynotes/pmVanity09.asp"}