{"name": "Overview", "summary": "The novel is set in the late 1620's, chiefly in France. It begins with a young man named d'Artagnan (most of the characters are known only by their surnames) who is traveling from his native Gascony to Paris, with the hope of starting a military career. He is from a noble family, as opposed to the servant or bourgeois/trade/professional class, but is not wealthy. However he bears a letter of introduction to Monsieur de Tréville, captain of the Musketeers, that he believes will secure him a place in the King's Musketeers, an elite guard and military unit. This letter is stolen by two people who mistake him for a spy: the beautiful Englishwoman Milady de Winter and her friend Rochefort.<PARAGRAPH>When d'Artagnan arrives in Paris, he is without his letter of introduction and therefore cannot be placed in the Musketeers. During the interview, he becomes aware of a rivalry between the King (and his supporters the Musketeers, with Monsieur de Tréville) against the wily Cardinal Richelieu who at this time is young, strong, and at the peak of his brilliant political career. He decides to side with the Musketeers and the King against the Cardinal and the Cardinal's Guards.<PARAGRAPH>In a matter of hours, while attempting to stop Rochefort and to demand the return of his letter, d'Artagnan manages to offend three different Musketeers: Athos, Porthos, and Aramis. Athos is an aristocratic man of about forty who has been wounded in a recent fight, and d'Artagnan runs into him and aggravates Athos's shoulder injury. He also embarrasses Porthos and Aramis. Porthos is a large, bombastic but unintelligent man who pretends to be wealthy but who lives off the charity of his elderly mistress. Aramis is an intelligent man who originally studied to be a Jesuit priest, but who has extraordinary talent as both a swordsman and a seducer. Each of the three men challenge d'Artagnan to a duel, however when they all appear at the appointed time -- Athos's duel is first -- the four men are surprised by the Cardinal's guards, who try to arrest them for dueling. Impulsively, d'Artagnan joins the three Musketeers in their fight against the four Cardinal's Guards, and they are victorious. From this point on the men are inseparable, and d'Artagnan is rewarded with a place in Monsieur des Essart's King's Guards.<PARAGRAPH>Having taken lodging in an inn, d'Artagnan meets Constance Bonacieux, his landlord's young wife, and falls in love with her. Constance works in the palace and waits on Queen Anne. From time to time she is sent on an errand. But she sees and hears more than she should.<PARAGRAPH>Unbeknownst to most, Queen Anne is having an emotional affair with the Duke of Buckingham. Cardinal Richelieu hopes to find evidence of it. When one of his spies brings him news that the Queen has given away her diamond \"tags\" -- that is to say, diamond encrusted decorations attached to ribbons that are designed to be worn as a group -- the Cardinal carries the news of the missing tags to the suspicious King Louis XIII, who orders the Queen to wear them at an upcoming ball. Constance brings word of the problem to d'Artagnan. He, the Musketeers, and their four servants set out for England. Only d'Artagnan and his servant Planchet make it. In the process, he seriously injures the Count de Wardes, who is related to Rochefort. But d'Artagnan succeeds in warning the Duke of Buckingham. Unfortunately he cannot return all the tags: two of them have been stolen by Milady de Winter. Buckingham orders the ports of England closed while two replacement tags are made and attached to replace the missing ones. D'Artagnan returns the tags to the Queen and is rewarded with the gift of a ring with a small diamond in it.<PARAGRAPH>Constance Bonacieux is kidnapped by her husband and Rochefort. Although d'Artagnan sees it happen, he cannot do anything about it since he does not know where to start looking. He is finally formally introduced to Milady de Winter and becomes infatuated with her. Pretending to be the Count de Wardes, with whom Milady is in love, he visits her under cover of darkness and they enjoy a night of passion. Milady gives d'Artagnan a sapphire ring. Later, still pretending to be the Count de Wardes, d'Artagnan sends Milady an insulting, rejecting letter. Milady recruits d'Artagnan to kill the Count de Wardes, at which point she discovers d'Artagnan's deception. She attacks him, trying to kill him, but during the struggle the shoulder of her dress is torn to reveal a fleur-de-lys brand on her shoulder, which marks her as a thief, prostitute, or some kind of common criminal. This startles d'Artagnan, not solely because of the criminal association but because Athos, while extremely drunk, related a story about how \"someone he knew\" accidentally married just such a woman. Athos later recognizes the ring.<PARAGRAPH>The siege of La Rochelle begins. D'Artagnan and the Musketeers are sent off to war, and they pawn Milady's ring to buy the necessary equipment and supplies. Constance is released from prison, but the Musketeers overhear a discussion between the Cardinal and Milady in which the Cardinal orders Milady to kill Buckingham. He gives Milady a letter of pardon in advance, but Athos steals it.<PARAGRAPH>The Musketeers succeed in warning Buckingham, who orders Milady imprisoned, but she corrupts and manipulates a young Puritan guard by the name of Felton, who assassinates Buckingham. Milady meanwhile returns to France but cannot immediately return to Paris or to the Cardinal. She encounters Constance hiding in a convent and poisons her simply to retaliate against d'Artagnan. But the Musketeers catch Milady, bring the executioner of Lille to call her to account for her crimes beginning with her earliest thefts and offenses long before she met Athos, and ultimately conduct an impromptu trial for the murders of Buckingham and Constance. They sentence Milady to death, and the executioner decapitates her.<PARAGRAPH>Upon returning to La Rochelle, d'Artagnan and the Musketeers are captured. When Rochefort brings him before the Cardinal, d'Artagnan produces the letter of pardon the Cardinal originally wrote for Milady. As a gesture of respect and acknowledgement of defeat, the Cardinal writes out orders for a commission as a lieutenant in the Musketeers. Because Athos, Porthos, and Aramis are all planning to leave and pursue their own lives, it is d'Artagnan who receives the promotion.<PARAGRAPH>This novel is the first in a series of three purportedly related to the \"Count de la Fère\" (Athos's real name). The second, \"Twenty Years After\", reunites the four friends during the Fronde rebellion and the execution of the English King Charles I, with emphasis on Milady's son who seeks revenge for his mother's execution. The third novel, \"The Viscount of Bragelonne\", deals chiefly with a character not introduced in \"The Three Musketeers\": Athos's illegitimate son.<PARAGRAPH>A piece of historical fiction based partly on real characters such as King Louis XIII, Queen Anne of Austria, and Cardinal Richelieu, \"The Three Musketeers\" draws partly on earlier memoirs of d'Artagnan and the Count de la Fère, which were mostly fictional. Dumas, assisted by others, performed historical research in order to accurately depict the 17th-century musketeers and their world. Published in 1844, \"The Three Musketeers\" is an excellent example of a French romance: action packed, plot-driven, and with occasional snide references to the abuses of the \"Old Regime\" that existed prior to the French Revolution.", "analysis": "", "url": "https://web.archive.org/web/20180416043647/http://www.gradesaver.com/the-three-musketeers/study-guide/summary"}