{"name": "overview", "summary": "Don Pedro, the prince of Aragon, is an old friend of Leonato, the  governor of Messina. Don Pedro has been invited to stay with  Leonato after quelling the rebellion started by his illegitimate  brother, Don John. On the visit, two companions accompany Don  Pedro: the valiant fighter Claudio and the witty bachelor Benedick. Claudio is instantly attracted to Leonato's daughter Hero. He wants  to marry her, but is hesitant in wooing her. Therefore, Don Pedro  promises to woo Hero for Claudio at the masquerade ball. Leonato's niece, Beatrice, is a clever match for Benedick. Like  him, she vows never to marry. The two of them spar constantly,  claiming to dislike one another. Don Pedro and Leonato think up a  plan to bring Benedick and Beatrice together, since they know the  bickering couple is attracted to one another but do not want to  admit it. Meanwhile, Don John, Don Pedro's bastard brother, dislikes  Claudio intensely, since Claudio defeated him in the recent battle. Don John plots with his henchman Borachio to frustrate Claudio's  marriage plans. Borachio convinces Margaret (Hero's maid-in-  waiting) to stand at Hero's chamber window and talk to him late at  night. This way, the easily duped Claudio will think his bride-to-be  has betrayed him    Don Pedro puts his plan into action, dropping hints to Beatrice that  Benedick is madly in love with her, and dropping hints to  Benedick that Beatrice pines for him. Their egos are stroked, their  passions aroused. The plan succeeds and they emerge as a  confirmed pair of lovers. Don John and Borachio also succeed in their conspiracy. Claudio  waits for the marriage day to denounce his bride-to-be. Shocked  and humiliated, not to mention confused, Hero swoons and is  presumed dead. Claudio and Don Pedro leave, and the Friar of the  church comes to Hero's defense. The Friar keeps her in hiding till  Claudio is repentant of his unforgivable act. Beatrice asks her  newfound lover Benedick to avenge Hero's insult by challenging  his dear friend Claudio to a duel. Benedick, a slave to love,  reluctantly agrees. A couple of night watchmen of the palace overhear Borachio  reveal his part in the heinous plot and arrest him. The deception is  brought to light and Claudio repents of his lack of faith. Leonato  takes Claudio to Hero's \"grave\" to show that he is truly sorry. He  then brings out his niece (Hero in disguise) and offers her to  Claudio as a bride. A rejoicing Claudio sees that Hero is alive. The  two couples, Hero and Claudio and Beatrice and Benedick, marry. The news reaches them all that Don John has been arrested for his  evil deeds. The group dances and the curtain falls. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMuchado05.asp"}