{"name": "overview", "url": "https://web.archive.org/web/20180820033733/http://www.pinkmonkey.com/booknotes/monkeynotes/pmPortraitLady06.asp", "summary": "In Volume One, Isabel Archer is in the library of her family home reading casually from the German Romantics. Her aunt, Mrs. Touchett, comes into the room. Mrs. Touchett lives in Europe and visits America once a year. After finding her niece an impressive young woman, she decides to take her back to Europe and introduce her to European society. Before they leave, Isabel receives Caspar Goodwood as a visitor. He has been her suitor and she tells him she wants to travel in Europe and that she will not be able to give him an answer regarding their future together for another year at least. Isabel and her aunt first go to England where Mr. Touchett and his son, Ralph, live at the country estate, Gardencourt. Isabel is impressed by both men, both of whom are invalids, and by their neighbor, Lord Warburton. She finds herself constrained by her aunt in what are the forms of social interaction permissible between young women and men of their class and she submits to these constraints even though she finds them petty and incomprehensible. She visits Lockleigh, the neighboring estate owned by Lord Warburton, a prominent man in British Liberal politics, who believes that there should not be an English aristocracy even while being of member of it. Her American journalist friend, Henrietta Stackpole, comes to Europe to act as the foreign correspondent for her U. S. publication. She worries that Isabel will be ruined by what she sees as an unhealthy influence of European decadence. She receives a letter from Caspar Goodwood. He has followed her to Europe. While she is sitting in the garden of Gardencourt reading this letter, she is approached by Lord Warburton with a marriage proposal. She tells him to give her time. When he has left, she realizes she will certainly decline the offer no matter how spectacular a marriage to an English lord would be in the eyes of almost everyone she knows. She eventually tells Warburton of her decision. Then she finds out that Henrietta Stackpole has been working to get Caspar Goodwood invited to Gardencourt. Ralph Touchett has sent him an invitation. However, Goodwood never comes. She and Henrietta plan to visit London together and see the sights. Before they leave, Lord Warburton comes to visit the Touchetts and brings his very sweet and placid sisters who are charmed by Isabel and shocked by Henrietta. Ralph accompanies Isabel and Henrietta to London since it would be a violation of social codes for two young women to travel alone. There, Isabel has a chance to speak to Ralph alone one evening when Henrietta has another social engagement. When Isabel goes back to her lodging, she is surprised by a visit from Caspar Goodwood. She tells him he must leave her alone. She scolds Henrietta for interfering in her relationship to Caspar Goodwood. She has told him to let her have more time to experience Europe before she can give him an answer about their future. They are called back to Gardencourt with the news that Mr. Touchetts health is failing and he will likely die soon. As she is living at Gardencourt during this time, the Touchetts are visited by the socially successful but economically constrained Madame Serena Merle, a widow of forty. Isabel is very attracted to Madame Merles social graces and accomplishments. Madame Merle mentions the name of her friend, Gilbert Osmond, who lives in Florence as one of the best people in Europe to know. Mr. Touchett dies. Before he does, Ralph asks him to change his will and leave half his wealth to Isabel so she can have the liberty to enjoy life and do with it as she will. He does so, leaving Isabel a wealthy woman.", "analysis": ""}