{"name": "overview", "url": "https://web.archive.org/web/20180820053313/http://www.pinkmonkey.com/booknotes/monkeynotes/pmCymbeline06.asp", "summary": "As the play begins, the audience learns that Cymbeline, the King of Britain, has banished Posthumus Leonatus, whom the King's daughter, Imogen has married against the King's will. Posthumus is a valiant and noble son of a celebrated courtier who died of shock after his two other sons lost their lives in defense of their country. The King raises Posthumus and favors him to such an extent as to treat him like a son since the two elder brothers of Imogen, heirs to the throne, were abducted as infants. However, Posthumus's marriage to Imogen has upset her stepmother, whose original plan had been to have Imogen marry her son and thus assure his succession to the throne. After his exile, Posthumus sets out for Rome where he lodges with Philario, an Italian who was his father's friend. In Rome, Posthumus boasts of Imogen's virtue during a dispute among the courtiers of various countries over whose country has women \"more fair, virtuous, wise, chaste, constant, qualified and less attemptable.\" Posthumus vouches the superiority of the women of his country above those of all others. Iachimo, an Italian, immediately challenges Posthumus' view and when provoked by Iachimo's doubts and sneers, Posthumus wagers a diamond ring given to him by Imogen as a parting remembrance, while Iamchim wagers ten thousand ducats, if he should fail in his attempts to seduce Imogen. The challenge is that he should bring forth tangible evidence of Imogen's infidelity. Iachimo accepts the wager and proceeds to Britain with a letter of introduction by Posthumus. Not succeeding in his flagrant overtures to Imogen, Iachimo has recourse to stealth. Iachimo cunningly manages to gain admission to Imogen's bedchamber at night, by hiding himself in a trunk. He has persuaded Imogen to keep it in her safe custody for the night. While she is sleeping, he takes away her bracelet, which had been a parting gift from Posthumus to her. Iachimo makes a mental note of her bedchamber as well as a mole on her breast. Armed with this circumstantial evidence, he returns to Posthumus and convinces him of Imogen's infidelity. Thus he achieves the precious diamond ring. Occurring alongside this main action is the foolish wooing by Cloten of Imogen as well as her spirited resistance to his advances. Incensed beyond imagination, Posthumus immediately instructs his faithful servant Pisanio to put Imogen to death. He offers him an easy opportunity to do so by writing to Imogen that he intends to visit Milford Haven in Wales where the two should meet up, but instead of them reuniting, Pisanio will kill her on the way. Pisanio thinks that his master has been duped by some villain, so he decides not to execute his master's orders. He encourages Imogen to slip out of the court to Milford, but on the way he explains to her the reason for Posthumus's request. Finally, he persuades her to disguise herself as a male and join Posthumus' party where she will have firsthand knowledge of his course of action. Imogen loses her way and being hungry and tired, she enters the cave of Belarius, who had been unjustly banished from Cymbeline's court and had revenged himself twenty years earlier by kidnapping Cymbeline's two young sons, Guiderius and Arviragus. Belarius has changed his name to Morgan, and the boys have been renamed Polydore and Cadwell. Charmed by Imogen's appearance and her fascinating talk, they welcome her. She tells them that her name is Fidele. In the mean time the Romans are preparing to invade Britain because Cymbeline has not paid the tribute money to Rome.", "analysis": ""}