{"name": "overview", "summary": "The novel opens with a description of Jim, who is an inch or two  below six feet and employed as a water-clerk. He is powerfully  built and has a deep, loud voice. The son of a clergyman, Jim  decides to make a career at sea, passes examinations, and is made  an officer of a ship by passing the third test. Soon he is sent on  board the Patna as a first mate. The ship has eight hundred  pilgrims. Jim is not very friendly with the other officers of the  Patna. On a calm night in the Arabian Sea, the Patna collides with  a submerged wreck and is badly damaged in its forepeak  compartment. Assessing the damage, Jim knows that in no time the  water will rush in and the ship will sink. Along with the ship, all  the pilgrims will drown. The captain of the ship also senses the  danger. At any time the bulkhead of the ship may give way. Jim watches as the crew struggles to lower a boat. He is disgusted,  but cannot shout because it will create further panic. Already one  of the engineers has died of heart attack. The ship plunges. Jim  does not want to desert the pilgrims, but in a moment of indecision  and crisis, he jumps into \"an everlasting deep hole.\" This fills him  with guilt and affects him throughout his life. The Patna, however,  survives, and the ship, along with the pilgrims, is towed into the  Suez by a French warship. The four men who jumped ship are also  picked up by Avondale and delivered to an eastern port. The  inquiry starts. At the Court of Inquiry, Jim meets Marlow, the  narrator of the story. Marlow is attracted to Jim and feels himself  responsible for Jim's safety. At the inquiry, Jim is found guilty and  his certificate is canceled. Marlow decides to rehabilitate Jim. He  talks to Stein, a wealthy merchant, and arranges for Jim to go to  Patusan. Jim is very happy with the offer and hopes that his past  will be buried soon. In Patusan, as adviser and ruler of the Bugis,  he wins their trust and soon becomes Tuan Jim. He finds great  peace. Marlow visits him in Patusan and finds him very happy  there. He is also involved with Jewel, a woman half-native and  half-English. However, life does not continue in this manner. The  outside world in the form of Brown, a renegade Australian,  disrupts Jim's idyllic existence. Jim is not there when Brown arrives, so Dain Waris, Doramin's  son, takes charge. When Jim returns, Doramin, his son, and the  villagers want Jim to take charge and destroy Brown. Though  Brown knows nothing about Jim's past, he senses Jim's weakness  and persuades him to allow him and his men to return safely. Jim,  still guilty from his past mistake, promises this and urges Doramin  to allow them to retreat. Doramin is not happy with this decision. Dain Waris is sent to Brown. Instigated by Cornelius, Brown fires  on Dain Waris and kills him. The awful news reaches Jim. He  knows his blissful life has ended. He has lost the trust of the Bugis. He decides to face the final blow. He goes to meet Doramin, who  considers him as his son's murderer. Doramin shoots him, and Jim  falls like a hero at Doramin's feet. ", "analysis": "", "url": "https://web.archive.org/web/20180820051943/http://www.pinkmonkey.com/booknotes/monkeynotes/pmLordJim05.asp"}