{"name": "overview", "url": "https://web.archive.org/web/20180820042551/http://www.pinkmonkey.com/booknotes/monkeynotes/pmAllsWell06.asp", "summary": "Helena, the orphaned daughter of the celebrated physician Gerard de Narbon, is in love with the Countess's son, Bertram, but despairs of ever winning his affection because of the vast difference in their social rank. Bertram leaves his mother's home to present himself to the King for service, and Helena, despairing, thinks of a way to win his love. She will use her father's medicine to cure the King of France, and in return, will ask for a husband of her choosing. When the King is restored to health, Helena chooses Bertram, who vehemently objects to what he thinks is a humiliating alliance. Social rank is extremely important to Bertram, and he is too proud to have Helena for a wife, despite the fact that she is loved by all. Bertram finally agrees to marry Helena because he is afraid of displeasing the King. But with the encouragement of Parolles, Bertram decides to leave for Paris immediately after the wedding, abandoning his new bride before consummating their union. In his letter declaring that he is leaving her, Bertram agrees to consummate his marriage with Helena if she can do two things: first, she must obtain the family ring that he always wears around his finger, and second, she must have his child. Clearly, neither is feasible since he has run away and refuses to sleep with her. The King and Bertram's mother are incensed at his abandonment and vow to disown him. Helena is hurt by the fact that she has caused Bertram's flight to Paris. She disguises herself as a pilgrim and sets out for the shrine of Saint Jaques le Grand, hoping to trick Bertram into returning home. Helena learns on her arrival in Florence, that Bertram has attempted to seduce a young woman named Diana, who lives with her widowed mother. Helena convinces the widow that she is Bertram's wife and promises a generous reward to the two ladies if they will help her carry out a plan to win Bertram. She asks Diana to pretend to yield to Bertram's entreaties, then demand from him the ring on his finger. Then Diana is to fix a time for Bertram to come to her bed, and there, in the dark, Helena will take her place. Bertram, after sleeping with \"Diana\" and promising to marry her when his wife is dead, learns that Helena is dead . Bertram abandons the \"virgin\" he thinks he has taken, and returns to France. In France, everyone is prepared to forgive Bertram, and Lafeu, an aging Lord and good family friend, even offers his child as a second wife for Bertram, to help mend the wounds of the past months. Bertram agrees to the proposal and, as a favor for his bride-to-be, gives Lafeu the ring he had received from the woman he thought was Diana. The King immediately recognizes the ring as the one which he had given to Helena and, suspecting Bertram of plotting Helena's murder, orders him to be arrested. Diana arrives with her mother and accuses Bertram of seducing her and violating his promise to marry her after his wife's death. Bertram replies by lying and trying to smear her reputation. When all seems chaotic and confusing, Helena appears, quite alive, and very pregnant. She tells Bertram she has fulfilled his conditions, and he, seeing that she has indeed, answers that he is prepared to \"love her dearly, ever, ever dearly.\"", "analysis": ""}