{"name": "overview", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmManSuperman06.asp", "summary": "In Man and Superman, George Bernard Shaw portrays conventional courtship turned on its head. Traditionally, the woman is hunted and submits to the man. In this play, man is hunted by a relentless woman. Shaw believed that normally women like Ann Whitefield pursue their intended husbands with such persistence and subtlety that they lead the men to think themselves as the pursuers. The plot really consists of two storylines. The first is the courtship of John Tanner and Ann Whitefield. Tanner is a progressive thinker; he is opposed to all things associated with tradition or convention. At the start of the action, he has been appointed co- guardian of Ann Whitefield, a duty he shares with an older man, Roebuck Ramsden. Mr. Ramsden is a complete opposite of Tanner, for he is established and conventional to the core, even though he calls himself progressive. Both Tanner and Ramsden appeal to their charge to select one of them to fulfil her fathers wishes, but she will not make a choice. With the pretense of respecting her fathers last wishes, she humbly says she would like both to remain in their joint capacity as guardian. In reality, she is simply setting her trap for Mr. Tanner. Secondary to this developing plot is the story of Violet Robinson and Hector Malone. Violet is the sister of Octavius, a poet who is hopelessly in love with Ann. She announces that she is pregnant; then she announces that she is married, but she refuses to name her husband. Later, it becomes evident that Violets husband is a wealthy American named Hector Malone, whose father wishes him to marry a titled girl. Violet has persuaded Hector to keep their marriage secret so that he will not lose his wealth. In Act II, John Tanners car is broken down. Ann manipulates the situation so that she can ride with him. He tells his chauffeur he feels sorry for Octavius, saying Ann is playing with him in her ruthless pursuit. His chauffeur tells him it is he, not Octavius, who is the true goal of Miss Whitefield. In Act III, John Tanner flees his predicament by traveling to Europe. There, he is kidnapped by a group of marauding pirates. He falls asleep and has an extensive dream in which he becomes Don Juan, sent to hell. In the underworld, Don Juan has a discussion with his beloved Dona Ana de Ulloa , a Statue , and the Devil; they talk about the universal questions relating to men, women, love, and marriage. Through the dream, the playwright airs his views on existence and evolution, using such ideas as that of a Life Force and the Nietzchean vision of Superman. In this theory, women are the chief instruments of nature, and men are used by women to fulfill their own destinies. The Life Force that sustains existence would cease were it not for this cycle. \"Superman\" is the concept of man continually improving himself in each successive generation. Don Juan finally leaves hell, since he believes he has work to do in the world. The Devil tells Ana that Superman does not exist. She leaves in pursuit of a father to help her give birth to Superman. At the end of the act, Tanner wakes to find that Ann has found and rescued him. In the final act, Violet and Hector reveal their secret marriage and Violet manipulates Hectors father into continued financial support. John Tanner gives in to the inevitability of marriage and agrees to wed Ann.", "analysis": ""}