{"name": "overview", "summary": "Theseus, the Duke of Athens, is betrothed to Hippolyta, the queen  of the Amazons. As they are discussing their marriage, which is  just four days away, Egeus, an Athenian, comes to Theseus with a  complaint that his daughter Hermia has refused to marry  Demetrius, an Athenian youth chosen by him. He insists that  Hermia be put to death, per the law prevailing in Athens. Theseus  wants to give Hermia four days time to either agree to marry  Demetrius or face death. Hermia is in love with Lysander and does not want to marry  Demetrius, who has been unfaithful to Helena. The lovers decide  to leave Athens and go to Lysander's aunt, who lives seven  leagues from Athens, where Athenian law cannot be enforced. They decide to meet the following night in the woods outside  Athens. They reveal their plan to the heart-broken Helena in an  attempt to console her. Helena decides to inform Demetrius about  this plan, for she is certain that he will reward her for the  information. She expects that Demetrius will pursue the lovers  and decides to follow him to the woods. The woods outside Athens is a favorite haunt of a band of fairies headed          by Oberon and Titania. They have of late fought over a changeling boy          who is in the care of Titania. Oberon demands that Titania give the boy          to his page. Titania refuses and Oberon decides to teach her a lesson. He sends Puck, his attendant, to fetch the flower, called love-in-idleness,          which has a magical quality. If the juice of the flower is squeezed over          the eyes of a person who is asleep, it makes the person fall in love with          the object he/she first sees on waking up. He decides to cast this spell          over Titania. As he is waiting for Puck to return with the flower, Helena and  Demetrius enter the scene. All Helena's pleas are ignored by  Demetrius, who is in pursuit of Hermia. Oberon feels sorry for  Helena and decides to help her. When Puck arrives, he tells him to  go in search of an Athenian youth with a lady and anoints his eyes  with the juice of the flower. Oberon himself goes to Titania with  the flower. Puck mistakes Lysander and Hermia for Demetrius and Helena  and squeezes the juice on Lysander's eyes. Meanwhile, Helena  comes that way. Seeing Lysander, she calls out to him. Lysander  wakes up, sees Helena, and falls in love with her. Helena thinks  that he is teasing her and runs away from him, but Lysander  pursues her. In another part of the woods, the workmen from Athens have  gathered to rehearse a play that they plan to present in honor of  their Duke to celebrate his wedding. Puck sees them and decides  to play a trick on them. He places an ass's head on Nick Bottom's  shoulders. When his friends see Bottom transformed, they are  scared and run away. Bottom feels that they are all trying to play a  prank on him. To show them that he is not afraid, he starts  \"surging.\" The noise wakes up Titania, who is under the spell of  love-in-idleness. She sees Nick Bottom and falls in love with him. Oberon notices Demetrius still professing love to Hermia and realizes          that Puck has made a mistake. Hermia spurns Demetrius and goes in search          of Lysander. Demetrius, exhausted, falls asleep. Oberon orders Puck to          bring Helena there and squeezes the juice of the flower on the eyes of          Demetrius. Puck brings Helena to the scene, followed by Lysander. Demetrius          wakes up and falls for Helena. Thus, both men are in love with the same          girl, and Helena believes that they are both playing a cruel joke on her. Hermia arrives on the scene too. She is shocked to see the change in Lysander. Demetrius and Lysander decide to settle the matter by fighting a duel          and move into the woods. They are followed by Helena and Hermia, quarreling          with each other. Oberon chides Puck for the mix-up and instructs him to cause a fog and          lead the lovers into each other's path. When they fall asleep, Oberon          tells Puck to squeeze an antidote on Lysander's eyes. Oberon goes to Titania          and succeeds in making her give up the boy, because she is now in love          with Nick Bottom. Then he removes the spell from her. Puck manages to separate Lysander and Demetrius as they are preparing          for the duel. Through the fog he leads them to the same spot. When they          fall asleep, he removes the spell from Lysander. Theseus and Hippolyta lead their people to the woods to begin the wedding          festivities. They find Helena, Demetrius, Hermia, and Lysander fast asleep. When they wake up, Demetrius gives up his claim on Hermia and professes          his love for Helena. Lysander is restored to Hermia. Theseus is quite          happy with this turn of events and announces that all the weddings will          be solemnized on the same day. Puck has removed the ass's head from Nick Bottom, and he has returned          to his friends. On the wedding night, he and his friends present the interlude,          \"The Most Lamentable Comedy and Most Cruel Death of Pyramus and Thisbe,\"          much to the merriment of the company. Theseus and others retire for the          night, and the scene is taken over again by the fairies with their songs          and dance. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMidsummer05.asp"}