{"name": "overview", "summary": "Ivanhoe is set in England during the reign of King Richard I, also known as Richard the Lion-Hearted. The time is a little \nover a hundred years after the decisive battle of Hastings, at which Harold, the Saxon claimant to the English throne, was \nkilled by William, Duke of Normandy. The outcome of this battle is that the Saxons, who had owned and cultivated their \nlands since the early years of the first century, are now subjected to the rule of the foreign French Normans. The French \nlanguage has overshadowed the old Anglo-Saxon, while French rituals and courtly manners mock the simple and homely \nSaxon way of life.<PARAGRAPH>The few Saxon nobles left alive are resentful when their lands are either threatened or seized by the Norman lords. The \ncommon people are terrified of the cruel and unjust methods used to subdue them. The gap between the two races has \nwidened because neither William of Normandy nor his successors care to blend with the people, or to even learn their \nlanguage or their ways.<PARAGRAPH>When Richard I comes to the throne, he spends almost all of his reign fighting the Saracens  in the Holy Land. \nHe is a good and fair man, but as he is hardly in England, his greedy and corrupt brother, John, finds it easy to take over. \nJohn encourages the Norman lords to squeeze the Saxons of whatever wealth and lands they possess. The country is, in \nfact, in a chaotic state.<PARAGRAPH>It is against this background that Sir Walter Scott sets his narrative. Wilfred of Ivanhoe has been disinherited by his father, \nCedric the Saxon. Ivanhoe has earned his fathers displeasure by showing tolerance and loyalty to the Norman King \nRichard. Ivanhoe has also fallen in love with Rowena, Cedrics ward and a direct descendant of Alfred the Great. Being \npolitically ambitious, Cedric has intended that Rowena marry Athelstane, who also has royal Saxon blood. Such an \nalliance would produce a powerful Saxon claim to the English throne.<PARAGRAPH>At the tournament at Ashby-de-la-Zouche, Ivanhoe turns up in disguise as the Disinherited Knight. With the help of the \nmysterious Black Knight, he wins the tournament on both days. As the victor, he crowns Rowena his Queen of beauty and \nlove. Having suffered some severe wounds, he faints at Rowenas feet. Ivanhoe is looked after by Rebecca, the beautiful \nJewess daughter of Isaac of York.<PARAGRAPH>Cedric and Athelstane join in a grand banquet at Ashby Castle, hosted by Prince John. Here they are insulted by the \nNorman knights who mock their manners. After the banquet they travel through the forest towards York. On the way, \nthey meet up with and join Rebeccas party, unaware that the invalid with her is Ivanhoe. A little later, they are attacked \nby De Bracy and his men, disguised as yeomen outlaws. De Bracy has fallen in love with Rowena and wishes to persuade \nher to marry him. The prisoners are taken to Torquilstone Castle, now the property of Front-de-Boeuf.<PARAGRAPH>Wamba, Cedrics jester, is the only one who escapes. He decides to rescue his master by disguising himself as a priest \ncome to give absolution to the Saxon prisoners who have been condemned to death. Rebecca, also imprisoned, is being \ncourted by Brian de Bois-Guilbert. Cedric escapes and makes contact with Robin of Locksley  and his \noutlaws. They are joined by King Richard, still disguised as the Black Knight. Together, they attack the castle and free the \nprisoners with the help of Urfried, an old hag who is also a victim of Front-de-Boeuf. As the battle rages, Urfried sets fire \nto the castle, and both she and Front-de-Boeuf perish in the flames. De Bois-Guilbert manages to escape, taking Rebecca \nwith him. They reach Templestowe, where Rebecca is accused of witchcraft and condemned to be burned at the stake. \nIvanhoe follows and champions her in a trial by combat against de Bois-Guilbert. The latter is killed, and Rebecca is set \nfree.<PARAGRAPH>The novel ends with Ivanhoe marrying Rowena. It is also revealed that the Black Knight is actually Richard, King of \nEngland. Cedric realizes that the Saxons may never reclaim the throne, but decides it is possible to tolerate and even \nadmire some Norman rulers; he pledges his loyalty to Richard. Rebecca and her father leave England.", "analysis": "", "url": "https://web.archive.org/web/20190903025232/http:/thebestnotes.com/booknotes/Ivanhoe_Sir_Walter_Scott/Ivanhoe_Study_Guide04.html"}