{"name": "overview", "url": "https://web.archive.org/web/20210416215230/http://www.pinkmonkey.com/booknotes/monkeynotes/pmOthello05.asp", "summary": "The play opens late at night in the city of Venice. Desdemona has eloped with the Moor Othello, and Roderigo, her former suitor, is distraught. He is speaking angrily with Iago and resents that he has not been told of the love of Desdemona for Othello. Iago is also angry. Othello, whom he hates, has passed him over for a promotion, making Cassio a lieutenant instead of him. Iago and Roderigo go to the home of Brabantio, a Venetian Senator and the father of Desdemona. They call to him, and Iago, with glee, tells Brabantio that his daughter has eloped with Othello. Before the Senator can come downstairs, Iago flees the scene, not wanting to get involved. When Brabantio appears, he is furious over the news and demands to know the whereabouts of Othello and his daughter. Roderigo says he will take him to Othello. The next scene opens with Iago telling Othello about Brabantios anger over the marriage and his plans to take Desdemona away from the Moor. Cassio then enters and tells Othello that there is bad news from Cyprus and he must go at once to see the Duke of Venice. Before Othello can depart, the infuriated Brabantio comes on to the scene, accompanied by several armed men. Othello refuses to be drawn into a fight. Instead, they all agree to appear before the Duke and voice their complaints. Brabantio is certain that the Duke will take his side. As the Duke listens to both Othello and Brabantio, Desdemona appears and professes her love for her husband. The Duke tries to gain reconciliation between all parties. Brabantio refuses to listen and accuses Othello of using witchcraft or drugs to win Desdemona, which she refutes. In the end, Brabantio has no choice but to allow Desdemona to go with Othello, but he promises he will have nothing else to do with his daughter. He will not even allow her to stay in his house while Othello is off at war. Since Othello is to go to Cyprus the same night, Desdemona plans to follow him, accompanied by Emilia, her maid, and Iago, who is Emilias husband. After these plans are made, Desdemona and Othello go off together. Left alone with Roderigo, Iago tempts his friend. He tells Roderigo that Desdemona will quickly grow tired of the Moor and then Roderigo can win her love. He also persuades Roderigo to go to Cyprus in disguise. Feeling encouraged, Roderigo departs. Left alone on the stage, Iago, in a soliloquy, reveals his hatred of Othello and thinks of ways to destroy him. He decides to use Cassio to get his revenge. The scene changes to Cyprus, following a terrifying storm, which has battered the Turkish fleet. Cassio arrives on the first ship, followed by Desdemona, Emilia, Iago, and Roderigo. They all express anxiety about Othellos absence; Desdemona is particularly worried about her husbands safety. Cassio tries to entertain her and divert her mind from her fears. Othello finally arrives in the third vessel. Desdemona is delighted to see her husband, and they go off together. When Iago witnesses Desdemona and Cassio engaged in conversation, he begins to hatch a plot. He tells Roderigo that he is sure that Desdemona really loves Cassio and instructs him to provoke a quarrel with Cassio later in the evening. There is to be feast to celebrate Othellos victory and his marriage. During the festivities, Iago manages to get Cassio drunk. Roderigo then provokes him, and a fight ensues. When Montano, the Governor of Cyprus, tries to stop the fighting, Cassio wounds him. Iago sends Roderigo to ring the alarm-bell, which rouses the town and brings Othello and Desdemona on the scene. When Othello hears what has happened, he dismisses Cassio from his position of lieutenant. Iago advises Cassio to ask Desdemona to intercede for him with Othello and promises to arrange a meeting for him with Desdemona. When Cassio departs, Iago utters his third main soliloquy that gives details of his plan. Early in the morning, Cassio arrives before the castle with some musicians to play for Othello and to meet with Desdemona alone. Desdemona promises to request that Othello forgive Cassio and restore his lieutenancy. As Cassio leaves, Othello and Iago approach. As they talk, Iago begins to arouse Othellos suspicions about Cassio. When Desdemona enters, she begins to eagerly plead for Cassio, but her husband sends her away. Then Iago begins to suggest that Cassio and Desdemona are having an affair. The information puts Othello in a horrible mood. When Desdemona returns, she cannot understand why he is so irritable. She tries to calm him down by stroking his head with her handkerchief, but he pushes her away. In the process, she loses the handkerchief, which is picked up by Emilia and given to Iago. Othello returns to Iago and demands proof of his accusations about his wife. Iago thinks about the handkerchief that is in his pocket. He tells Othello that he has heard Cassio talk in his sleep about his love for Desdemona. He also says that he has seen Cassio wiping his face with a handkerchief embroidered with strawberries, just like one that belongs to Desdemona. With these words, the jealous Othello has all the proof he needs. He is furious and vows that both Cassio and Desdemona must die. In the meantime, Iago plans to leave the handkerchief where Cassio will find it. Othello goes to Desdemona and asks her to bring the strawberry handkerchief that he has given her. When she cannot give it to him, he is fully convinced of her infidelity and grows furious, stating the handkerchief has magical properties and disastrous consequences if it is lost. Desdemona is troubled by the loss of the handkerchief and by Othellos strange behavior. Iago continues to thicken his plot. He tells Othello that Cassio has confessed to sleeping with Desdemona. Othello falls in a trance at the news. Iago then arranges that Othello shall hear but not see him in conversation with Cassio. Iago and Cassio talk about Bianca, but Othello thinks that they are talking about Desdemona. Bianca appears along with the fatal handkerchief, which she angrily throws at Cassio because it is another womans. Othellos jealous mind is made up. When Cassio and Bianca leave, Othello tells Iago that he will strangle Desdemona in bed and that Iago must kill Cassio. As they talk, Lodovico enters with orders for Othello to return to Venice, leaving Cassio as Governor over Cyprus. When Desdemona talks with Lodovico, Othello become even more jealous. He strikes her, accuses her of infidelity, and refuses to listen to the protests from her and Emilia that claim her innocence. Othello then orders a humiliated Desdemona to bed. As she prepares for sleep, she sings the willow song and talks to Emilia about infidelity. Iago goes off to deal with Roderigo. Iago lies and tells him that Othello is to be sent to Mauritania and the best way to keep him in Cyprus with Desdemona is to kill Cassio. The gullible Roderigo agrees. Later that night, Roderigo and Iago search for Cassio. When he is found, Roderigo attacks him, but Roderigo is wounded. Iago rushes in to murder him, but only manages to stab Cassios leg. Othello hears Cassios cries and assumes he has been killed. He goes off to murder Desdemona. Iago murders Roderigo, for he is fearful that he will talk. Othello enters the bedroom, where Desdemona is sleeping. He gives her a last kiss, which wakes her. Realizing what is about to happen, she pleads for her life, or at least for some time, but Othello will not listen. He smothers her. Almost immediately, Emilia knocks at the door for admission. When Othello is sure that his wife is dead, he lets Emilia in. She tells him that Cassio has killed Roderigo . She then sees Desdemonas body and learns that her husband Iago is responsible for Othellos belief in Desdemonas guilt. She tells Othello that Iago has lied and goes out to call for help. Iago, Montano, Gratiano and others enter, and Othello tells why he has killed Desdemona. Emilia then reveals the truth about the handkerchief, saying that she had taken it and given it to Iago. In anger, Iago stabs and kills his wife. Othello wounds Iago before he escapes. He is then confined to the room as a prisoner. Lodovico and Montano come in with Cassio in a chair and Iago as prisoner. Lodovico takes command. He puts Othello under guard, places Cassio in his stead, and condemns Iago to torture. After a moving speech, Othello stabs himself and dies on Desdemonas body. Lodovico leaves to report the dreadful facts to the senate of Venice.", "analysis": ""}