{"name": "overview", "summary": "Titus returns to Rome triumphant after his victory over the  Goths. He is greeted by the grateful people of Rome who  choose him as their new Emperor. Titus declines this position  and nominates Saturninus as the Emperor of Rome. Saturninus  offers to marry Lavinia, an offer which, Titus accepts. Saturninus however lusts after Tamora, the queen of Goths. Seeing this, his brother Bassianus claims Lavinia as his  betrothed, and runs away with her. Marcus, Titus brother and  Lucius and Mutius who are Titus sons aid him in this. In anger  Titus kills Mutius for he sees this as an act of treachery. Saturninus sees Lavinias elopement as a blow to his pride and  directs his anger at Titus. Tamora, who hates Titus because he  had permitted the sacrifice of her son, advises Saturninus who is  now her husband to pretend to forgive the Andronici. She  promises him that she will destroy them all, in good time. Thus  a false goodwill is established among all present. The Royal party, along with the Andronici, goes to the forest for  hunting. There Aaron plots and executes a plan against Titus  family. As a result Bassianus is killed by Tomaras sons,  Lavinia is ravished and mutilated by them and Martius and  Quintus are falsely accused of Bassianus murder and  imprisoned by the angry and grief-stricken emperor. Marcus comes upon Lavinia and takes her to her father. In the  meanwhile Titus two Martius and Quintus, have been  sentenced to death for Bassianus murder. Titus tries to appeal  to the state of Rome for their lives but his pleas fall on deaf ears. When he sees Lavinia, in her mutilated condition, his grief  knows no bounds. Aaron plays a trick on him in which Titus  loses his hand, which is then delivered to him with the severed  heads of his sons. The effects of all this causes Titus to break  out in insane laughter, marking a change in him-he is  determined to obtain his vengeance. His son Lucius, banished  from Rome for trying to help his brothers, leaves to collect an  army of Goths to attack Rome and thus obtain justice. Titus obsession with revenge grows, making him hysterical at  times when he suspects even a fly as being his enemies, Tamora  and Aaron. Lavinia is able to communicate what has happened  to her with the help of a book of stories and she also puts down  the name of her wrong -doers in sand. This knowledge causes  Titus to determine a plan of revenge against Chiron and  Demetrius. Tamora gives birth to a black baby who is Aarons son. She  wants him dead because his color is a disgrace to her. But Aaron  does not let anyone harm his child and kills the nurse to keep its  birth a secret. He plans to kill the mid-wife as well and then  substitute it with a fair baby that will pass off as Tamora and  Saturninus son. He decides entrust his baby to the Goths. Titus seeks justice from the Goths and in a fit of emotion shoots  arrows loaded with messages addressed to various Roman Gods. These arrows fall down in the palace and serve to annoy  Saturninus who fears public disapproval. He sentences to death  the clown who passes on a message to him from Titus. When he  finds out that Lucius is raising an army of Goths to attack him  his fears escalate because he is well aware that the Romans  would revolt against him and support Lucius. Tamora takes the  situation in her hand to convince Lucius not to attack Rome. Accordingly a message is send to Lucius for a parley with the  emperor in Titus house. Aaron and his son are captured and brought to Lucius as  prisoners. In exchange for his sons life Aaron reveals the  names of all the people who have harmed the Androcini. When  Lucius receives Tamoras message he sets out for Rome. Disguised as revenge, and accompanied by her sons who are  also disguised Tamora visits Titus. She tries to talk Titus into  forgiving the empress (herself) and her sons. She is convinced  of his insanity and he encourages this belief by playing along  with her. He agrees to what she says and she leaves to get  Saturninus for the banquet. Titus then kills her sons and  prepares a feast for her with their bodies. At the banquet he kills Lavinia to end her sorrow. He tells  Tamora that she has feasted on her sons and then kills her. Angered by his wifes death Saturninus kills Titus and he is then  killed by Lucius. Marcus and Lucius present the whole truth to  the people of Rome and ask for their verdict. Lucius is  proclaimed as emperor of Rome. He orders Aaron to be starved  to death. Tamora is denied a funeral and he arranges an  honorable burial for Titus and Saturninus. The play ends with  him promising the people of Rome that such political instability  shall never occur again. ", "analysis": "", "url": "https://web.archive.org/web/20180820050202/http://www.pinkmonkey.com/booknotes/monkeynotes/pmTitus07.asp"}