{"name": "overview", "summary": "The novel opens with a preface that introduces its fictional narrator-protagonist. The writer of the preface says there are \nmany young people in the twentieth century who do not realize the enormous changes that have occurred in society, and \nhe has therefore decided to write a \"romance\" as a sort of enjoyable history lesson. He will present a character from the \nnineteenth century named Julian West, and his representative of the twentieth century will be Doctor Leete.<PARAGRAPH>The novel begins with Julian West's description of the nineteenth century as made up of four classes: rich, poor, educated, \nand uneducated. He describes the economic and social system as a huge coach pulled by people rather than horses. The \nfew at the top are pulled with difficulty by the many at the bottom. Everyone worries about falling off the top or getting \nonto the top. Julian West is thirty years old and engaged to Edith Bartlett. They are both wealthy. Julian West has spent \nthe day with Edith Bartlett and her family. They are upset over the labor strikes because they delay the construction of his \nnew house, and hence, their wedding. That night in his underground chamber, he is mesmerized  and falls \nasleep. When he wakes up, he is in the twentieth century, more than 113 years in the future. He meets Doctor Leete and \nhis family, Mrs. Leete and Edith Leete. Doctor Leete describes the new society of the twentieth century as perfect. The \nmode of production of the nineteenth century has evolved and reached the height of perfection. It has been nationalized, \nprivate ownership of capital no longer exists, and everyone is an employee of the nation. Doctor Leete informs him that \ngovernment's functions have been minimized with the abolition of competition and private property. Government exists \nto perform public service. The government is designed to help people discover their aptitude for work and to help them to \ndo that work. It balances the demand for jobs by compensating for inequalities.<PARAGRAPH>One morning, Julian West wakes up with an anxiety attack and wanders the streets. He is confused about his personality, \nsince he has moved so rapidly from one system to another. Nothing around him is familiar. When he returns home, Edith \nLeete helps him get over his attack with sympathy and care. He discusses what he has seen outside the house with Doctor \nLeete. The Doctor tells him there are now no banks, no stores, and that everything is directly distributed. People pay for \nthings with credit cards, which are handed out at the beginning of every year. All people get equal pay no matter what \ntheir level of functioning in the economy. They are given different kinds of honorable motives for working and being \nproductive. Edith Leete takes Julian West shopping where he witnesses the new method of distribution of goods. No \nlonger are there hundreds of stores competing with one another for the consumers. There are no middle men, no \nsalespeople, no waste, as in the old system. The shopper goes to a warehouse and chooses products, which are then \ndistributed to her/his home within minutes. Upon returning home, Edith shows Julian the music room, where one can \nhear perfect music twenty-four hours a day. He finds out from Doctor Leete that while inheritance is not outlawed, it is \nalso not desirable since everyone has all he or she needs.<PARAGRAPH>Doctor Leete further informs him of the incentives that inspire citizens to work in this society. The nation's work is \norganized as an army, called the Industrial Army, with ranks and sub-ranks like an army's organization. There is even an \nInvalid Corps for those unable to participate in the regular army. The main basis for production and compensation is a \nprinciple of mutual dependence and solidarity. Julian West also learns that the international situation largely resembles \nthe national one. Most countries of the Western Hemisphere have the same kind of equality and are working toward \ninternational consolidation. Edith Leete takes him to their home library, where he reads Charles Dickens and looks with a \nfresh perspective at the horrors of poverty in the nineteenth century. That evening, the family takes him to a public dining \nhall where most people have their meals. It is sumptuous, and Julian West finds out that the nation's wealth is lavished on \nsuch public places. He finds out that there is no concept of menial labor. Everyone works at every level, and therefore no \none looks down on those who make life good for them by performing needed services like waiting tables. At the social \nclub's library, Julian West learns that writers must pay to have their work published, and only if they are good enough, \ncan they live solely by writing. Newspapers and periodicals are supported by subscription. Doctor Leete offers a critique \nof the so-called free press of the nineteenth-century newspapers, stating that the newspapers, being privately owned, were \nnot the best means of voicing public sentiment.<PARAGRAPH>When he goes out the next morning, he finds that Edith Leete has been watching out for him because she is worried that \nhe would have another anxiety attack. He asks her about her nineteenth-century ancestors, but she avoids his question. \nHe asks Doctor Leete what he will be able to do in the twentieth century. Doctor Leete suggests that he lecture on \nnineteenth-century history at one of the universities.<PARAGRAPH>He visits a warehouse and marvels at the efficiency of distribution. Doctor Leete tells him of the science of gauging \ndemand so that supply is always even with it. People have much more control over production than they did in the \nnineteenth century. Doctor Leete tells him that the general of the industrial army is also the president of the nation. He is \nchosen by the alumni of the army, those who have retired. The voters therefore have no personal interest in becoming \npresident themselves. Julian West exclaims at the early age of retirement: forty-five. Doctor Leete tells him that work is \nnot the main goal of life. The nation allows people to finish work while they are still young so that they can do as they \nwish with their life.<PARAGRAPH>Julian West goes for a walk and realizes there are no prisons anymore. Doctor Leete calls all criminal activity atavism, a \nterm which means that a criminal act is a retrogression to an earlier stage of human development. Julian West feels like a \nbarbarian among the civilized people, and Edith Leete assures him that he is now one of them, no longer a nineteenth-century man. Doctor Leete tells him there are no prisons, very few and very simple laws, no lawyers, no state \ngovernment, and very little legislation. Julian West revisits the underground chamber where he slept for so many years. \nHe weeps over the loss of Edith Bartlett but is amazed that in general he feels at peace about her. He visits the \nuniversities and learns that everyone goes to the university until the age of twenty-one. He finds out from Doctor Leete \nall the reasons why the country is so wealthy. First, it no longer wastes so much money and energy in competition. It \nsaves all that money in concerted action and cooperation. Second, it has none of the wasteful forms of government and \nnone of the wastefulness of a wealthy class.<PARAGRAPH>Julian West asks Edith about a conversation he thinks he overheard when he was just coming to consciousness from his \nlong sleep. He heard her ask her father not to tell him something. Edith blushes and tells him to wait to find out the \nanswer. He visits the underground chamber again and brings back a newspaper for Doctor Leete to read. They discuss \nthe anarchists who were so active in the late nineteenth century, and Julian West says they would never have been able to \naccomplish anything. Doctor Leete informs him that it was the National Party, not the narrowly conceived Labor Party, \nthat brought the nation forward to the new mode of production and distribution. Julian West finally asks about women's \nplace in the nation. Doctor Leete informs him that women have a separate world of work, even a separate general of \nindustry, and that they get equal pay but still want to marry. On the Sunday of his first week in the new Boston, Julian \nWest hears a sermon on the moral changes that have occurred with the new economy. He feels depressed when it is over, \nthinking himself far behind everyone else and undeserving of the benefits of the twentieth century, since he did not help to \nwork for them. Edith Leete comforts him. He tells her he is in love with her, and she tells him that she feels the same \nway. He finds out she is Edith Bartlett's great-granddaughter.<PARAGRAPH>He wakes up to find himself back in the nineteenth century. After his dream \n        of a perfect society, he is horrified to find himself back in the midst \n        of labor wars, theft, and violence. He goes to Edith Bartlett's house \n        and tries to tell her and others of his new insights, but they throw him \n        out. In his struggle to get away from them, he wakes up. His return to \n        the nineteenth century was itself a dream. He feels guilty again that \n        he did nothing to contribute to the new society, but Edith Leete forgives \n        him and accepts him.", "analysis": "", "url": "https://web.archive.org/web/20190903025235/http:/thebestnotes.com/booknotes/Looking_Backward_Bellamy/Looking_Backward_Study_Guide03.html"}