{"name": "overview", "url": "https://web.archive.org/web/20180820044717/http://www.pinkmonkey.com/booknotes/monkeynotes/pmRichard06.asp", "summary": "Act I opens at Windsor Castle where King Richard listens to the allegations of his cousin, Henry Bolingbroke , who accuses Thomas Mowbray, Duke of Norfolk, of misappropriating royal funds and of masterminding the recent death of the Duke of Gloucester. Richard tries to effect a reconciliation between them, but to no avail. Richard has no other option left but to order that a trial by combat be held at Coventry to settle the dispute. Just before the combat begins, Richard decides to banish both the opponents: Mowbray for life and Bolingbroke for ten years, which is then reduced to six years. Richard notices the show of popular affection for Bolingbroke as he goes into exile. Richard himself makes plans to leave for Ireland where a rebellion has broken out. Before he leaves, he is summoned to the bedside of the dying John of Gaunt, Bolingbroke's father. In Act II, John of Gaunt anxiously awaits Richard's arrival. He is hopeful that the young king will listen to the advice of a dying man. When Richard arrives, Gaunt cautions him against the flatterers who surround him and berates him for his irresponsibility in administering the royal funds. Richard's sole reaction is to dismiss his uncle as a mad \"lean-witted fool.\" As soon as Gaunt dies, Richard confiscates his property and wealth, against the protests of the Duke of York, who reminds him of Bolingbroke's rights. Angered by Richard's outrageous behavior, Henry Percy, Duke of Northumberland, reviews the king's actions with Lord Ross and Lord Willoughby, who reveals that the banished Bolingbroke has already set sail for England with an army of three thousand men. In the meantime, Sir John Bushy attempts to comfort Queen Isabel, who is grieving over her husband Richard's departure for Ireland. Sir Henry Green bursts in with the news that Bolingbroke has landed and that he has won the allegiance of such powerful men as Northumberland and his son Harry. In Gloucestershire, Bolingbroke explains to York, who is acting as the regent in Richard's absence, that he has violated his sentence of banishment only to claim his inheritance as Duke of Lancaster. Arriving in Wales in Act III, Richard expresses his happiness at being in his kingdom once again and is confident that Bolingbroke's rebellion will soon lose support and collapse. Despite the encouragement of York's son, the loyal Duke of Aumerle, and the Bishop of Carlisle, King Richard's confidence declines as he learns from the Earl of Salisbury and Sir Stephen Scroop that all his supporters have deserted him, including his most trusted confidante, the Duke of York. In despair, Richard seeks refuge at Flint Castle. When Bolingbroke arrives before the castle and learns that Richard is within, he asks to see him, promising to lay down his arms if his sentence of banishment is revoked and his property is restored. Richard appears on the walls of his castle and grants Bolingbroke's demands. Despite his cousin's fair words, it is evident to Bolingbroke that Richard retains only a shadow of his former magnificence and power. Meanwhile, Queen Isabel seeks to drive away her cares in the garden of the Duke of York. A gardener appears, accompanied by two servants, one of whom wonders why they should take pains with their garden while disorder prevails in England. The gardener retorts that if Richard had looked after his garden as earnestly as they tend theirs, he would not be faced with the loss of his crown. At this point the Queen makes her presence known and learns that Bolingbroke has brought Richard to London.", "analysis": ""}