{"name": "overview", "url": "https://web.archive.org/web/20210416215230/http://www.pinkmonkey.com/booknotes/monkeynotes/pmWuthering07.asp", "summary": "On a business trip to Liverpool, the warm-hearted Mr. Earnshaw impulsively rescues from the street a dirty, ragged child, who speaks a strange language that no one can understand and is possibly the son of a foreign sailor. Mr. Earnshaw brings him home to Wuthering Heights and insists that he shall remain and be treated like one of his own children. He names the boy Heathcliff. From the very beginning, the dark, gypsy-like intruder breeds ill feelings in the family. Fourteen-year-old Hindley resents having to share his father with a stranger. He bullies Heathcliff, is punished for it, and broods upon being wronged. Mr. Earnshaw's favoritism not only antagonizes his son, but also rashly encourages Heathcliff's black temper and pride. The willful, wayward Cathy, however, grows deeply attached to her adopted brother, and they become inseparable. Then Mr. Earnshaw falls ill. As soon as he dies, Hindley, now master at the Heights, fulfills his threat of revenge by subjecting Heathcliff to harsh treatment. Heathcliff is banished to the servants' quarters and degraded to the level of farm laborer. Thoroughly neglected, he and Cathy grow up reckless and defiant, running wild together over the moors. Cathy bitterly rebels against the mistreatment of Heathcliff. However, she begins to compare his uncouth manners and appearance with the polished gentility of the young Lintons. After an escapade to Thrushcross Grange, which forces her to stay there for five weeks, she returns transformed into a \"very dignified person.\" As time goes on, Cathy wants to become a lady and encourage Edgar Linton's attentions. Finally she betrays her childhood companion, whom she really loves, by accepting the gentle, effeminate Edgar's proposal of marriage. Devastated by Cathy's marriage, Heathcliff runs away and is not seen or heard of for three years. He returns rich and self- possessed, outwardly a gentleman. However, he is unchanged at heart and secretly bent on settling his score with his enemies. Cathy welcomes back her old playmate with a delight so extravagant that it upsets her husband. Heathcliff now takes up residence with his former persecutor, Hindley. After his wife's death, Hindley has become an incurable drunkard and gambler. Although Heathcliff innocently protests that he wishes only to be within walking distance of Thrushcross Grange to call on Cathy, his presence at Wuthering Heights is sinister. Under Heathcliff's influence, Hindley steadily deteriorates, and his small son, Hareton, is soon set against him. Linton's shallow sister, Isabella, is infatuated by Heathcliff's dark good looks. Heathcliff detests and despises her, but perceives her as a means to avenge himself on Cathy for her betrayal and to gain Isabella's fortune. Unaware that Cathy has contracted brain fever, Heathcliff elopes with Isabella. Cathy, however, is still attracted to Heathcliff and feels torn between her passion for him and her allegiance to her husband. Never resolving her conflict, Cathy dies after giving birth to Edgar's daughter, the second Catherine. Maddened by grief and rage over Cathy's death, Heathcliff now lives only to complete his schemes for the ruin of both the Lintons and the Earnshaws. Finally, Hindley drinks himself to death after gambling all his property away to Heathcliff. Hareton is now a helpless dependent in his father's house. He grows up a rough, illiterate laborer, degraded in the same way Heathcliff was once treated by Hindley. An ailing child, Linton, is born of Heathcliff's marriage to Isabella. He will inherit Thrushcross Grange because Edgar Linton has no male heir. For that reason alone, Heathcliff claims him back after Isabella's death thirteen years later. Bad luck contrives to bring together Linton, \"the worst-tempered bit of a sickly slip that ever struggled into its teens,\" and the warm- hearted, affectionate Catherine, daughter of Cathy and Edgar. Through playing on Cathy's pity, Heathcliff manages to engineer a courtship between the two of them, against her father's wishes and commands. While Edgar is dying, the unsuspecting Cathy is lured to Wuthering Heights, detained there by force, and married to Linton. On her father's death and after Linton's death, Heathcliff's design is accomplished: he is master of both Wuthering Heights and Thrushcross Grange. Keeping Hareton and Cathy in close captivity at the Heights, he is able to savor at leisure the satisfaction of tormenting the children of his enemies. It proves, however, a hollow victory, for time takes its own revenge. In the end, Heathcliff is defeated by an unexpected turn of events. Hareton has been attracted to Cathy from the moment he first saw her. In her early unhappiness at the Heights, she scornfully repulses his clumsy advances and efforts to please. Later, she repents her cruelty, begs forgiveness, and promises to teach him to read. This is the beginning of the love that grows between them. Heathcliff is forced to watch his own past re- enacting itself, in the same house, through a younger generation. It is partly this, coupled with Catherine's likeness to her mother, which kills Heathcliff's desire to harm the cousins at the moment he has it most within his power to do so. An even stronger element in Heathcliff's failure to bring his revenge full circle is his own perception, which renders him increasingly indifferent to everything going on around him. Haunted ever more insistently by the spirit-presence of his beloved Cathy, he is unable to eat or rest and welcomes death, which unites him with her. The reader is left at the end with a sense of the triumph of love over the forces of darkness. As Lockwood observes of Cathy and Hareton: \"They are afraid of nothing. . . . Together they would brave Satan and all his legions.\" Through these young lovers, the unhappiness of their parents and the evil of the past are finally redeemed.", "analysis": ""}