{"name": "overview", "summary": "As the play opens, Lady Britomart, a British  woman in her fifties, is discussing with her son some permanent source of income  for her grown daughters, Sarah and Barbara, who are engaged to Charles Lomax and  Adolphous Cusins respectively. Lady Britomart comes to the conclusion that the  only solution to the present problem is to take monetary help from her estranged  husband, Andrew Undershaft. He is a very successful businessman who owns a munitions  factory that manufactures the world famous Undershaft Guns, submarines, and torpedoes. When their children were young, the couple separated due to questions about Undershaft's  wealth and how it would be distributed. Lady Britomart has managed to raise the  children by herself. Because Lady Britomart has decided to seek help from  her estranged husband, Sarah, Barbara, and Stephen are reintroduced to their father. In the course of their reunion, Undershaft learns that his daughter Barbara is  a Major at the Salvation Army shelter. Impressed by her, Undershaft pay her a  visit at the shelter in order to see her at work. As he watches her handling various  people with patience, firmness, and sincerity, he is impressed with her abilities. Undershaft decides that if anyone in his family is capable of managing his business,  it is his idealistic and committed daughter, Barbara. Undershaft brings his  daughter back to reality by revealing the darker side of the Salvation Army to  her. Disillusioned, Barbara leaves the shelter in tears to go with her father  to his ammunition factory. Adolphous follows her. He is soon made heir to the  Undershaft factory, because he is a foundling. According to the Undershaft tradition,  the heir to the Undershaft fortune must be an orphan who can be groomed to run  the factory. After all, Undershaft himself had been a poor young man, staying  at the Salvation Army shelter; he improved his lot by working hard, and he wants  to give some other young gentleman the same kind of opportunities. Major Barbara  soon marries Adolphous, and they live in the countryside near the factory. Barbara,  whose idealism has been tempered with reality, brings her words of salvation to  the workers in the factory. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMajorBarbara05.asp"}