{"name": "overview", "url": "https://web.archive.org/web/20180820051427/http://www.pinkmonkey.com/booknotes/monkeynotes/pmJaneEyre09.asp", "summary": "Young Jane Eyre is an orphan in the care of her aunt, Mrs. Sarah Reed. She is treated harshly and unsympathetically, even locked up at times. This arouses her defiant spirit. Her fear and unhappiness cause Mr. Lloyd, the apothecary, to advise Mrs. Reed to send Jane away to school. Jane is sent to Lowood, where she spends a wretched girlhood in appalling conditions. The severity of the regime is compensated for by the kindness of the superintendent, Miss Maria Temple, and a fellow orphan, Helen Burns, who dies of consumption in Jane's arms. Jane does get an education at Lowood and eventually teaches there. When Miss Temple gets married, Jane obtains a post as governess at Thornfield Hall. Her student is Adele, the ward of Edward Rochester, a man with a stormy disposition. During Jane's first visit she is greeted by Mrs. Fairfax, the housekeeper, and Adele. Jane learns that Mr. Rochester is seldom at home. Jane's first months at Thornfield Hall are quiet and uneventful. However, she is puzzled by a mysterious laugh which seems to come from upstairs at night. When Edward Rochester is home, Thornfield is enlivened. Jane is a plain girl without pretensions to charm, but she is endowed with a lively spirit and brilliant wit. Although Mr. Rochester can be very moody and harsh, he is naturally drawn to the young governess. Soon Jane learns to like him and look upon him as a friend. Hence, when Mr. Rochester goes away for a time, Jane feels lonely and unhappy. One day, Mr. Rochester returns to Thornfield, accompanied by a party of guests. Among the guests is a very beautiful and accomplished woman, Blanche Ingram. It is rumored that Mr. Rochester is going to marry her. But Blanche does not truly love him; she wants to marry him for his wealth and status. Mr. Rochester, disguised as a gypsy, tells Blanche that Rochester is planning to marry a poor girl. Jane is called to Gateshead where her aunt, Sarah Reed, is dying. After a month she returns to Thornfield. She feels that she will not be able to stay there for much longer if Mr. Rochester marries Blanche. Mr. Rochester tells Jane that he has no intention of marrying anyone except her. He proposes to her and she accepts him. The day of the wedding arrives. The marriage ceremony is interrupted by the arrival of Edward Rochester's brother-in-law and a solicitor. Mr. Rochester is accused of bigamy. He admits the charge and takes those present to see Bertha, his insane wife who is kept hidden on the third story of the house. The monstrous Bertha is the source of the mysterious laugh that Jane heard when she arrived at Thornfield Hall. Later, Mr. Rochester pleads with Jane to stay withhim. Jane, however, leaves Thornfield. After nearly perishing on the moors, Jane is rescued by St. John Rivers and his sisters, Diana and Mary. Jane later discovers that they are her cousins. Jane eventually inherits a legacy from Sir John Eyre, her uncle in Madeira. She has also worked hard as a schoolmistress for poor children. Under pressure from the dedicated St. John Rivers, Jane almost consents to marry him and share his missionary vocation in India. However, she is prevented by a \"telepathic\" appeal from Mr. Rochester. She rushes to Thornfield Hall, only to see it in ruins. Jane finds Mr. Rochester; he has been disfigured and blinded in the fire that almost destroyed the mansion. Jane marries him, and in the last chapter the readers learn that his sight is partially recovered and that the couple has been blessed with a son. <- Previous Page | First Page | Next Page -> Free Study Guide-Jane Eyre by Charlotte Bronte-Free Plot Summary Synopsis", "analysis": ""}