{"name": "overview", "url": "https://web.archive.org/web/20180820053313/http://www.pinkmonkey.com/booknotes/monkeynotes/pmCyrano06.asp", "summary": "Cyrano de Bergerac is a proud and courageous Gascon nobleman. He is known for his intellect, brilliant wit, fluency of speech, and swordsmanship. He is also known for his large, grotesque nose. Because he feels that he is very unattractive, he is convinced that no woman will ever love him, especially not one as beautiful as his cousin Roxane. Since he feels he cannot have Roxane for himself, he agrees to help Christian de Neuvillette court Roxane. Although Christian is very handsome, he is not very bright and has no way with words. Therefore, Cyrano agrees to coach him on what to say to Roxane in order to win her love. The plan works so well that Roxane marries Christian after a short time. Roxane's marriage upsets Count De Guiche, a powerful and influential Gascon nobleman who is married to Cardinal Richelieu's niece. Since he thinks Roxane is very beautiful, he desires her for himself. Since he is married, he plans for Viscount de Valvert, a weak and accommodating nobleman, to marry Roxane. De Guiche knows that Valvert will say nothing if he has an affair with Roxane, even if she is Valvert's wife. When he learns that Cyrano has helped to arrange the marriage of Roxane and Christian, he wants revenge. He immediately sends both men off to fight in the Battle of Arras. He then arranges for their regiment to be in a position where they are sure to be attacked and outnumbered by the enemy. When Roxane learns that her new husband is to be sent away from her, she makes Cyrano promise to have Christian write to her regularly. Cyrano seizes the opportunity to express his own love for Roxane in loves letters that he signs as Christian. Roxane is so moved by the professed love in the letters that she goes to the front to see Christian in order to express her deep love for him. Arriving at the battlefield, Roxane apologizes to her husband for at first loving him for being handsome. She claims that she now cares only about his poetic soul, not his attractive appearance. Christian is crushed, for he realizes that Roxane really loves Cyrano, the author of the letters. In his distress, he goes to Cyrano and says that Roxane must be told the truth. Then she can choose between Christian and Cyrano. Before Cyrano has the opportunity to tell Roxane the truth about the letters, the battle begins, and Christian is mortally wounded by the first shot. He now knows that he can never tell Roxane the truth and win her love. She must always believe that her dead husband was the author of the love letters. Roxane is so devastated by the loss of Christian, whom she believes to be the most poetic and noble of men, that she wears a veil of mourning for the next fifteen years and lives in a convent, away from temptation. The devoted Cyrano comes to the convent each week to visit Roxane, but he never tells her the truth about the letters or hints that he was the author. Instead, he entertains her with news of the outside world. Roxane looks forward to her cousin's visits. One Saturday, when Roxane is expecting Cyrano, De Guiche, who is now a Duke, comes for a visit. He drops a hint to Cyrano's friend, Le Bret, that there are plans to kill Cyrano and to make it look like an accident. The warning is too late. Cyrano has already been hit on his head by a block of wood. The accident, however, does not keep him away from Roxane. When he arrives at the convent, he is on the point of collapse. As a favor, he asks Roxane to let him read Christian's last letter to her, which she keeps on her person, close to her heart. As he reads the letter to her out loud, Roxane realizes that he is able to recite the letter without reading it. She realizes that it is his way of saying farewell to her. She also realizes that it was Cyrano, and not Christian, who had written the beautiful and noble love letters to her. As he dies before her, Roxane is upset that he has kept his love a secret and deprived her of his tenderness. Before his last breath, she tells him that she would have loved him all these years had she only known the truth. Her confession makes Cyrano die happy man.", "analysis": ""}