{"name": "overview", "summary": "Coriolanus is one of Shakespeares greatest political tragedies. In  Act I, the citizens of Rome are on the verge of revolt because of an  acute shortage of grain. The Roman citizens are especially bitter  towards the patrician (aristocratic) Caius Marcius, and think he is  the chief enemy to the people. Although he has rendered great  services to the state, the citizens think that the main motivation of  his actions is his excessive pride and a desire to please his mother. Menenius Agrippa, a friend of Marcius and  one that hath always  loved the people, tries to persuade the hungry plebeians that the  patricians are genuinely interested in their welfare. He narrates a  fable in which the members of the body revolt against the belly,  but eventually realize that the belly sustains them all. Marcius,  however, openly denounces the plebeians for their inconstancy and  presumption and is disgusted that the Senators have appointed five  tribunes to protect the interests of the commoners in response to  their petition. The rebellion in progress is interrupted by a revolt inspired by the  Volscians under the leadership of Tullus Aufidius. Marcius wife,  Virgilia, is unhappy at the news of Marcius departure and refuses  to leave her house until he returns. In contrast, Marcius mother,  Volumnia, is extremely pleased; she rejoices in her sons military  exploits and reminisces about the day when he won his first victory  in the battle against the Tarquins. Near Corioli, the Volscian capital, the Roman soldiers lose heart,  but Marcius inspires them to capture the city by his own bravery. Although Marcius refuses his share of the war loot and scorns the  praise of his fellow comrades, Cominius declares that from  henceforth Marcius will be known as Coriolanus, in honor and  memory of his great victory. Unfortunately, the victory has also  resulted in an enmity with Tullus Aufidius, who resolves to destroy  Coriolanus at any cost. In Act II, Sicinius Velutus and Junius Brutus, the two tribunes, try  to convince Menenius Agrippa that Marcius suffers from excessive  pride. Menenius, however, derides the ambition and servility of the  tribunes and defends Marcius. When Coriolanus returns to Rome,  the plebeians give him a heros welcome. He soon becomes a  candidate for the consulship and quickly wins the approval of the  Senate. With great reluctance Coriolanus bows to the custom that  requires office seekers to don a gown of humility and to solicit the  citizens votes by displaying their wounds. Initially, the plebeians  readily give him their votes, but later some of them assert that  there was mockery in his appeal. With the encouragement of the  tribunes, many commoners withdraw their approval of Coriolanus. Act III opens with Coriolanus discussion of the news that Tullus  Aufidius, who has shifted his headquarters to Antium, is preparing  to take up arms again. In the midst of this, Sicinius Velutus and  Brutus announce that the plebeians no longer approve of  Coriolanus election. They accuse Coriolanus of having opposed  the free distribution of wheat among the commoners. Coriolanus  replies that since they were not willing to fight for their country,  the commoners do not deserve the grain. The tribunes summon the  commoners, who are wild with rage and try to seize Coriolanus. The Senators, with Coriolanus help, manage to repel the crowd. When the tribunes demand the death of Coriolanus, Menenius  subdues them by promising to bring him to the Forum to answer  the charges levied against him. Coriolanus, however, refuses to  yield to Menenius request and only relents to the entreaties of his  mother, who argues that policy, combined with honor, is as  essential in peace as in war. ", "analysis": "", "url": "https://web.archive.org/web/20180820053313/http://www.pinkmonkey.com/booknotes/monkeynotes/pmCoriolanus07.asp"}