{"name": "overview", "url": "https://web.archive.org/web/20180820050202/http://www.pinkmonkey.com/booknotes/monkeynotes/pmTroilus06.asp", "summary": "The Prologue speaks of the 69 Greek princes who had sent ships laden with men and weapons to recapture Helen, wife of Greek king Menelaus who has run away with Paris, son of Priam the King of Troy. The action is placed on the Dardan Plains outside Troy. In Act I, Scene 1 Troilus, the youngest son of Priam, proclaims his love for Cressida and laments about the impossibility of getting to her without going through Pandarus, the go-between. In Scene 2, Cressida pretends to disdain Troilus. She later reveals that she has been playing hard to get because she believes a woman is only really precious when she is being courted and that a mans pleasure lies in trying to win her. So, though her heart is full of love for Troilus, she will not let him know the truth. In Scene 3, Agamemnon complains to his fellow Greeks that despite their seven-year siege, Troys walls were still standing. Ulysses launches into his degree speech and says that disregard of order in nature led to plagues, mutinies, earthquakes, and high winds. Likewise, communities, academic ranks in schools, guilds and societies, the prerogatives of age, and inheritance could only be maintained by respecting hierarchy. Anarchy rules in its absence. So the strength of the Trojans lay in the discord among the Greeks. Ulysses then paints a vivid picture of Achilles being entertained by Patroclus ridiculous imitations of the Greek leadership. Nestor adds that others like Ajax had been infected by this attitude. Aeneas enters and presents Hectors challenge to a duel. It is clear that the challenge is aimed at Achilles. Nestor says that it would be supposed that whoever met Hector was the choice of the Greek leadership, and whichever warrior won, it would influence the performance of the whole side. Ulysses says that it would be appropriate for Achilles not to meet Hector - should he defeat Hector, he would become even more intolerable. If, instead, he were defeated, then the reputation of the whole Greek side would be destroyed because of the disgrace of their best man. He suggests that they decide by lottery - which would be fixed so that Ajax drew the lot. Then he would be acknowledged as the better man, thus deflating Achilles pride. If Ajax returned safely, theyd make much of him: if he failed, theyd continue to maintain that they had a better man than the Trojans. In the first scene of Act II, Ajax tries to get the gist of the proclamation from a railing Thersites but to no avail. An exasperated Ajax beats him and threatens to continue unless he hears about the proclamation. Achilles and Patroclus enter and tell Ajax about the proclamation. Achilles says that if it hadnt been for the lottery, he himself would be the best match for Hector. Scene 2 begins with Priam revealing that Nestor had reiterated that if Helen was delivered to the Greeks, all damages would be forgotten. Hector suggests that they let Helen go. Troilus disagrees vehemently. Using the metaphor of marriage, he says that once a man was committed, he was obliged to stand by his decision. He reminds them that they had cheered for Paris when in retaliation for the long-ago kidnapping of an old aunt, he had brought back a young Grecian queen - an object of supreme worth whose value had launched more than a thousand ships and turned kings into merchants. Cassandra enters and exhorts the Trojans to learn to weep as Troy would burn unless they let Helen go. Troilus denounces her for a madwoman, and says that the rest of the Trojans had committed themselves to honoring Helen. They may, he implies, be proved imprudent by the consequences; but justice cannot be made merely pragmatic. Paris says he would wipe off the soil of Helens rape by keeping her honorably.", "analysis": ""}