{"name": "overview", "url": "https://web.archive.org/web/20180820050202/http://www.pinkmonkey.com/booknotes/monkeynotes/pmTessD06.asp", "summary": "The plot opens with John Durbeyfield, Tess' lazy father, walking from Shaston to the village of Marlott. Along the way, he meets the Parson who tells him about the nobility of his heritage and his relation to the wealthy family named D'Urbervilles. As a result of this news, John and his wife Joan send their daughter Tess to seek financial help from the Widow Mrs. D'Urberville. Tess meets Alec D'Urberville, the son, who is impressed with Tess's beauty and offers Tess a job at Trantridge, the estate of his mother. Even though she despises Alec, she accepts the position in order to help her family, who is extremely poor. After working at Trantridge for several months, Alec seduces Tess in the woods. She stays with him for a few weeks, but when she can no longer stand to be around him, she returns to her parents and is filled with guilt and remorse. Her parents accept the situation without complaint. A child, appropriately named Sorrow, is born to Tess, but the baby soon falls ill and dies. In an attempt to overcome her sorrows and begin a new life for herself, Tess leaves Marlott after a year and goes to work as a dairymaid at Talbothay's farm. Here she meets Angel Clare, an apprentice at the farm, who is extremely conventional about morality. He is attracted to Tess for her beauty and freshness. Tess also admires and respects Angel, but at first keeps him at a distance. Her past misadventure forces her to consider herself unworthy of him. As the summer passes, a relationship develops between them. When he proposes marriage, she initially refuses because of her past, but his persuasion eventually breaks her resistance. Before the wedding, she tries, on several occasions, to confess her past to Angel, but he always stops her. He says they will make confessions to one another after they are married, but Tess tries one more time. Just before the wedding, she writes a letter about her past and pushes it under the door of Angel's room, but Angel does not notice the letter. She, at first, assumes that he has read the letter and intends never to mention her revelation out of love for her. Then two hours before the wedding, she discovers the truth and is overwhelmed with grief and anxiety, but the wedding takes place. During their honeymoon, Tess musters up her courage and explains her victimization by Alec to her husband. Angel is shocked by the news. Tess is equally appalled that Angel's love for her and her devotion to him could be marred by a past event in which she was no more than an innocent victim. Angel, however, is unable to forgive the past. After a few days, he announces to Tess that they must part, but that her material needs are to be met by money he would give her. Deserted by her husband who goes to Brazil, Tess is shattered and returns to work in the fields. Her imploring letters to Angel are ignored, and gradually she is convinced that she will never see him again. Later she again encounters Alec, her seducer, who has become a preacher. Upon seeing Tess, he revives his passion for her and deserts his ministry. Although he has genuine regret for the suffering he has caused her in the past, he pursues Tess relentlessly and begs her to marry him. She writes to Angel and begs him to return and help her. Tess's sister appears one night at the farm to tell her that their parents are not well. Mr. D'Urberville soon dies, and the family, without any means, is turned out of the house. Alec steps in and provides Tess's mother, brothers, and sisters with a home and security. Tess is moved by Alec's generosity and begins to listen to him and see him. In the meantime, Angel returns from Brazil in ill health and ill spirit. During his separation from Tess, he has realized that he still loves his wife and regrets his harsh treatment of her. On arriving in Wessex, it is difficult for Angel to find out where his wife is living. He is finally told that she is at Sanbourne. When he finds her there in a lodge, they are both horrified at seeing each other in such circumstances. Angel is struck with regret to find his wife with Alec. Tess is shocked beyond words that her beloved husband has returned to her, but she sends him away out of shame. Feeling trapped again by her old seducer, Tess seizes a carving knife and kills Alec. She then runs away from the hotel after her husband. When she catches up to him, they reconcile and spend several wonderful days together; but they know their time together is short. A few days later, Tess is caught by the police and taken to prison. She is later hanged for the murder. Thus, Tess's efforts to fight against fate prove to be futile. Hardy believed that everyone is a toy in the hands of fate, and that fate was particularly harsh to women.", "analysis": ""}