{"name": "overview", "summary": "The underground man, who is the unnamed  narrator of the book, begins his story with self-confession, describing himself  as a sick and spiteful man. He blames his misery and inability to become someone  worthwhile on the fact that he suffers from excessive consciousness. He also confesses  that he has lived a barren and negative existence for so long that he now takes  pleasure in pain, torment, and humiliation. The narrator claims that he has  sought self-definition, but failed in his search. He has longed for human relationships,  even reaching out to some of his old classmates, but had none. He has sought stimulation,  but has been unable to find any. As a result, he spends his time reading books  and fantasizing about his existence. The narrator is full of criticism of  others. Since he is incapable of taking action himself, he mocks those that do,  saying they possess limited intelligence. He also rants and raves against people  who operate by means of logic, reason, and common sense. Several times in  the book, the narrator does try to reach out to others. He contacts one of his  old classmates, Simonov, and actually visits him several times. It is during one  of his visits that he learns of a farewell dinner being planned for Zverkov, another  old schoolmate. He forces them to invite him, and at the dinner, he is mocked  by all present. Feeling humiliated, he insults everyone present at the dinner. At the end of the evening, the narrator is left behind as the rest of the men  proceed to a brothel. Filled with thoughts of revenge, the narrator follows them  and finds Liza, a young and despairing prostitute. He begins by tormenting her,  but then gives her his address and tells her to come to him for help. The  narrator quickly regrets his foolishness in having given Liza his address and  fears that she may actually call upon him. When she does come to him, he humiliates  and rejects her, driving her away an utterly broken woman. After she is gone,  he feels sad and miserable about how he has treated Liza; he justifies his actions  by stating that he could never care about anyone. As he writes the book, the narrator  is still haunted by his behavior towards Liza, for he has missed his one opportunity  to do good or have a relationship with another human being. THEMES   Major Theme  The major theme in the book is the misery caused when  a person feels alienated and isolated from the world. The central character of  the book, the underground man, has divorced himself from society, from reality,  and even at times from himself. Since he has never felt love or found acceptance,  he has become inhuman, inspiring mockery or hatred in everyone he encounters. Because he lives in the big, impersonal city of St. Petersburg, it is easy for  him to hide away from life, living in an underground world of fantasy and misery. Minor Theme   The minor theme of the book is the power of mankind  to inflict destruction and despair. The underground man inflicts pain on Liza  when he offers to help her and then rejects her; after having sex with her when  she comes to his house, he sends her away a crushed and broken woman. The narrator  also inflicts pain and destruction on himself. Ironically, the pain of his self-destruction  makes him feel alive. MOOD   The mood of the entire book is dark  and gloomy. The narrator, who suffers from a sense of alienation and isolation,  portrays the misery he inflicts on himself and others throughout the story. ", "analysis": "", "url": "https://web.archive.org/web/20180820034941/http://www.pinkmonkey.com/booknotes/monkeynotes/pmNotesFrom04.asp"}