{"name": "overview", "url": "https://web.archive.org/web/20180820034609/http://www.pinkmonkey.com/booknotes/monkeynotes/pmSenseSensibility08.asp", "summary": "The novel opens with the death of Henry Dashwood. His wife and three daughters are left to fend for themselves on a nominal income. His son, John Dashwood, intends to help them financially, but under the influence of his avaricious wife, he refrains from doing so. Shortly afterwards, John and his wife, Fanny, arrive at Norland Park and take charge of the house. Mrs. Dashwood feels slighted but lives in the hope that her stepson will help them. During this period, Fanny's brother, Edward, arrives at Norland on a visit. He gets acquainted with Mrs. Dashwood and her daughters. He takes a liking to Elinor, who is also attracted to him. However, Fanny detects their mutual fondness and warns Mrs. Dashwood about it. Mrs. Dashwood is understandably hurt. When she receives a letter from John Middleton offering her a house at Barton Estate, she decides to move. Barton Cottage is ideally situated near a valley and surrounded by beautiful countryside. The Dashwoods find their new home cozy and comfortable. They also find a good neighbor in John Middleton, who is generous and friendly. Thus they spend many pleasant evenings at the Park. Here they get acquainted with Mrs. Jennings, the amusing old mother of Lady Middleton. Another acquaintance is Colonel Brandon, a cultured but reserved landowner. One day, while walking in the countryside, Marianne sprains her foot and falls down. She is helped home by a handsome young man named Willoughby. The accidental meeting culminates in friendship. Encouraged by Willoughby, Marianne becomes emotionally involved with him. All is well until Willoughby suddenly leaves for London. Marianne goes into a state of deep depression. Shortly afterwards, Elinor and Marianne accompany Mrs. Jennings to London. Marianne eagerly looks forward to meeting Willoughby. She writes to him and waits for his arrival. One evening, she meets him at a party but is absolutely shocked at the cold response he gives her. Her disillusionment is complete when she receives a letter from him, informing her of his engagement to another lady. The news shatters Marianne. Mrs. Jennings keeps herself busy with her engagements and attending to her daughter, Charlotte, who has just had a baby. John Dashwood pays a visit to Portman Square and invites Elinor and Marianne to his house. In the meantime, the Steele sisters arrive in London and renew their acquaintance with the Dashwood girls. Lucy tells Elinor of her secret engagement to Edward. Elinor is horrified but able to restrain her emotions admirably. The Steeles are invited by Fanny Dashwood to spend a few days with them. However, when the secret engagement of Lucy to Edward is revealed to her, Fanny throws a fit and vents her anger at the Steele sisters. Mrs. Ferrars disowns Edward, but Colonel Brandon ultimately offers him a position at Delaford. At the invitation of the Palmers, Elinor and Marianne leave for Cleveland, along with Mrs. Jennings. A few days after their arrival, Marianne falls sick. When her condition deteriorates, Colonel Brandon volunteers to travel to Barton Valley to bring Mrs. Dashwood to Cleveland. Meanwhile, Willoughby makes a surprise visit to Cleveland after he hears about Marianne's illness. He confesses his guilt to Elinor and relates to her the circumstances which led to his engagement to Miss Grey. He professes his love for Marianne and regrets his marriage to Miss Grey. Marianne recovers miraculously. Mrs. Dashwood arrives at Cleveland, but as soon as Marianne's health improves, she leaves for Barton along with her daughters. They all feel grateful to Colonel Brandon for his valuable help. Marianne revives her will to live. After hearing Willoughby's story, she is relieved that she is no longer associated with him. Colonel Brandon visits them at Barton and is delighted to see Marianne so cheerful. One day their man-servant informs them of the wedding of Lucy to Mr. Ferrars. The Dashwoods are distressed at this news. However, when Edward arrives at Barton, their doubts are cleared. Edward relates to them the circumstances which led to his engagement with Lucy and even mentions the letter she had written a few days earlier, releasing him from his commitment to her. He then proposes to Elinor and she accepts. Mrs. Ferrars excuses Edward and eventually accepts Elinor as her daughter- in-law. Shortly afterwards, Elinor and Edward get married and settle down at Delaford. Lucy earns the favor of Mrs. Ferrars. She and Robert thus move to London. Colonel Brandon succeeds in capturing the heart of Marianne. They both settle down at the mansion at Delaford after their wedding. Mrs. Dashwood lives at Barton but makes frequent visits to Delaford. The Middletons remain their good neighbors. Margaret grows up into a charming young woman.", "analysis": ""}