{"name": "overview", "url": "https://web.archive.org/web/20180820040441/http://www.pinkmonkey.com/booknotes/monkeynotes/pmHenry807.asp", "summary": "King Henry VIII is the ruler of England. Cardinal Wolsey, a statesman as well as a clergyman, assists the King in administrative matters. The Duke of Buckingham resents the fact that Wolsey, a man of humble birth, has risen is high on the bases of his ability. He is aware that Wolsey plays political games with his own advantage in mind and Buckingham is determined to inform the King of Wolseys true motives. Even as he is planning this, he is put under arrest on the charge of high treason. A new tax, imposed on the people on Wolseys orders, has resulted in revolt and unrest. When Queen Katherine informs the King of the situation, he cancels the tax and grants pardon to those who revolted against. Wolsey contrives to let it be known that it is due to his intervention that the King granted pardon. Wolsey presents Buckinghams ex-surveyor as a witness in the latters trial. The surveyor as a witness in the latters trial. The Surveyors testimony convinces the King that Buckingham had designs on the throne and would have murdered him to succeed to it. Wolsey gives a lavish party for many nobleman and noblewomen. The King and his men masked, and disguised as foreigners join the party. The King chooses Anne Bullen, a young noblewoman as his dancing-partner. Wolsey recognizes the King and the latter unmasks. The King is much struck by Annes beauty and the party continues till the small hours of the morning. Buckingham is found guilty and executed on the change of high treason. The common people grieve at the death of a man they admired. The rumor of a possible separation between the King and Queen is confirmed. Cardinal Campeius has come as the pap legate to represent Rome in this matter. The common peoples sympathy is on the Queens side. They believe that Wolseys hand lies behind the matter because the Spanish Emperor, Katherines nephew, denied him the archbishop-ship to Coledo. Learned men from universities in Italy and France, clergyman from Christian countries is in England to preside the divorce. The King decides that the proceedings will occur in Black Friars and informs the Queen of his decision through his secretary Gardiner. Meanwhile, he makes Anne the Marchioness of Pembroke and bestows a thousand-pound a year income on her to go with the title. The divorce proceedings come to a halt due to the Queens refusal to be tried by the present gathering; she appeals directly to the Pope. Wolsey and Campeius visit her in her apartments and succeed in convincing her to take their counsel. The King comes across certain papers that incriminate Wolsey - a letter to the Pope requesting him to halt the Kings divorce and an inventory of Wolseys personal wealth. At the Kings orders, Wolsey is made to give up the great seal, all his wealth reverts to the King and has to confine himself to the Asher House. He dissuades Cromwell from accompanying him and advises him to seek the Kings patronage. The King openly acknowledges Anne as his wife, and the popular sentiment is on her side when her coronation occurs. The Kings divorce from Katherine has been finalized and she is now in residence at Kimbolton. The King makes Cromwell the master of the jewel house and a member of the Privy Council. Katherines health is rapidly disintegrating and her end is near. She is informed of Wolseys death and shortly afterwards receives a visit from Capucius, an ambassador from Emperor Charles V, her nephew. She gives him a letter to be delivered to Henry VIII and after stating her last instructions for her funeral and she dies. Queen Anne is in labor and not expected to survive the childbirth. Gardiner expresses his thought to Lovell that the end of Anne, Cromwell and Cranmer will proves beneficial to England. The King summons Cranmer and tells him about the complaints he has received against the latter. He advises Cranmer to attend the council meeting, where his case will be tried. Then he gives Cranmer his personal ring to be used to make direct appeal to the King, if the need should arise. An old lady brings the news of the birth of the girl to the King. At the council meeting, it is decided that Crankier be confined to the Tower seeing all is lost. Cranmer presents the ring and recognizing it the counselors regret their action, fearing the Kings anger. The King himself arrives at the scene and after reprimanding the counselor for their shabby treatment of Cranmer, he affects reconciliation among them. The young princess is baptized \"Elizabeth\" and Cranmer makes a prophecy about the glory she will bring to the land. The King is overjoyed to hear this and the christening party goes to visit Queen Anne.", "analysis": ""}