{"name": "overview", "url": "https://web.archive.org/web/20180820034609/http://www.pinkmonkey.com/booknotes/monkeynotes/pmSiddhartha05.asp", "summary": "The son of a Brahmin, Siddhartha, at first seems content to follow the pious Hindu's path to salvation. He religiously reads the scriptures and performs sacrifices. He realizes, however, that the doctrine of his parents and tutors do not comply with his spiritual needs. He decides to leave home to seek his own salvation. His friend Govinda goes with him. Both Siddhartha and Govinda learn to restrain their impulses and concentrate on the spirit. Such concentration is achieved by the practice of the Samana discipline of self-denial. Soon they realize that the Samana way does not yield true satisfaction. It is only a means to realization of the self but not the end. Siddhartha, through Govinda's urgings, listens to the teachings of Gotama Buddha. He strives \"to die from himself, to be an ego no longer,...to be open to the miracle in a selfless spirit.\" He learns that the Buddha teaches his disciples to restrain their senses without necessarily denying them. This leads to Nirvana or salvation. Govinda becomes a Buddhist monk, but Siddhartha cannot accept the whole doctrine. He must seek his own path of salvation. Siddhartha enters a stage in Hindu, which is called \"Samsara\", the disturbing cycle of earthly happenings. In order to become the lover of the courtesan, Kamala, he must become a rich merchant. He also begins to gamble and drink, slowly letting the precepts of the Samanas as well as his inner voice dwindle to a whisper. This life proves empty, since it is related to the world of humans and material things. Siddhartha leaves his wealth behind and in a moment of despair sets out to drown himself in the river. He is saved, however, by the resounding of Om within his spirit, which he hears from the river. Siddhartha goes to live with the ferryman, Vasudeva, and is taught by him to live in harmony with nature by communing and listening to the river. Siddhartha has a momentary vision of absolute divinity beyond all worldly deceptions. He pronounces the sacred syllable Om and anticipates a life of mystic intuition. He has taken the first step by giving up his luxurious existence and living a simple life of solitude, yet he must also learn to love. Kamala, who has borne him a son, dies of snakebite. Siddhartha attempts to become a father to his son, but his son rejects his ways and leaves him. Through this experience, Siddhartha learns the pains of love. Once Vasudeva retires to the forest to die, Siddhartha himself becomes the ferryman. He lives beside the river and consoles all travelers. Govinda, who comes to visit him, believes Siddhartha to be a saint. He is taught by Siddhartha the unity of life, the unity of night and day, of \"I\" and \"thou,\" of poverty and affluence, of flesh and spirit. In a soliloquy, Siddhartha explains that only by living a life of both the spirit and the senses can a person gain peace.", "analysis": ""}