{"name": "overview", "url": "https://web.archive.org/web/20180820050202/http://www.pinkmonkey.com/booknotes/monkeynotes/pmTypee06.asp", "summary": "The novel, Typee begins with Tommo, the principal character, addressing the reader. He goes on to explain that he is abroad the ship Dolly, which had set out to snare sperm whales, but was now meandering aimlessly without food and drink for the crew. When the ship decides to port at one of the bays, at the Marquesas Islands, Tommo decides to leave the ship and set forth on an adventure into the heart of the island. He allows Toby, a crewmate, to accompany him, and together, with a few essential belongings, they stealthily leave their ship and disappear into the forest. From here onwards, a detailed description of their hazardous journey into the forests is given. The two young lads have to plod through deep valleys, ravines, and mountains, with no food and water, until they sight upon a cluster of houses. At this point the boys are unsure whether the tribals are the dreaded Typees or the peace-loving Happars. They, however, decide to risk their entry into the village and merely hope for the best. As so happens that the village they enter turns out to be that of the savage Typees and now it is too late to retreat. So they surrender themselves into the hands of the Typees, hoping only for survival. Surprisingly, the Typee natives treat the two boys cordially. Tommos leg, which had suffered injury during their expedition, is carefully treated and both of them are comfortably housed along with a family of three, Marheyo, Tinor, and their son Kory-Kory. From here onwards, the reader is given glimpses of the Typee people, their surroundings, their culture, religion, food habits, clothing and a natural history of the valley itself. Tommo with his avid curiosity learns extensively about these tribals. He cannot help comparing these people to the civilized people he had hither to lived with, and surprisingly, he finds these uneducated natives to be better human beings than the civilized men of the world. Their kindness to Tommo and Toby, the respect and care with which they treat their womenfolk, and their closeness and affinity to one another, is a lesson for all to learn from. The only thorn in the flesh, as it were, is the increasing awareness that Tommo is a prisoner among these natives. This, Tommo realizes wherever he attempts to discuss his return to his land. He is always closely guarded by his humble servant, Kory- Kory, and any mention of returning is warded off. The keenness to flee from this valley is renewed when Tommo realizes the cannibalistic tendencies of these natives which till now, had not emerged. When Tommo sees some dead bodies of enemies carried into the village, and the next day, sees the remains of some bones in a calabash, his suspicious are confirmed, and his need to leave becomes keener. In the meanwhile, Toby had already left the valley, through mysterious circumstances, and Tommo has to find a way to escape, alone. Most of his attempts are thwarted. But, finally with some aid from Marnoo and a lot of help from Marheyo, Kory-Korys father, Tommo finally manages to escape from this dreaded valley of the Typees and returns to his own land. This, then is the vivid adventure of Tommo and Toby at the flawed Polynesian Eden of Nukuheva. The narrative is skillfully managed, and in a literary point of view, the execution of the work is worthy of the novelty and interest of its subject. There is a life and truth in the descriptions and freshness in the style of the narrative, which is in perfect keeping with the scenes and adventures it dwells on.", "analysis": ""}