{"name": "overview", "summary": "The narrator arrives in Starkfield and strikes up an acquaintance  with several of the townspeople. He notices Ethan Frome at the  Post Office and wonders who this strange, silent, disfigured man  is. He gathers pieces of Ethan's story. During a winter storm,  Ethan turns up to drive the narrator to and from his train every  morning and evening. One day the storm is so bad that Ethan  drives the narrator the entire ten miles to his job and back again. The weather is so bad that they can't make it all the way back to  town and stop at Ethan's farmhouse for the night. The action of the earlier story then begins. It is a flashback to a          winter twenty-four years earlier when Mattie Silver is living with Ethan          and his sickly wife Zeena. Ethan has a special affection for the young          and lively Mattie, and she returns his regard. Zeena, who is constantly          trying out \"cures,\" leaves one day for an overnight visit to          an aunt and a new doctor in a neighboring town. While left alone, Mattie          and Ethan seem happy in each other's company, and Ethan cannot imagine          his dull life without the shining brightness of Mattie's presence. Zeena,          however, senses Ethan's affection for Mattie and grows unhappy with her          work. She announces that Ethan must hire a more capable girl and send          Mattie away. Ethan is frantically unhappy and sees no way to keep Mattie          on the farm. When Mattie is ready to leave the farm, Ethan insists on driving  her to town to catch the train. The two are miserable at having to  part. At a corner of the road near the church, they pass a sledding  track, and Ethan suggests they take a long-promised and delayed  sled ride. As they ride down the snowy hill, Mattie says that she  cannot live without Ethan and suggests that they should drive the  sled into the elm tree at the bottom of the hill in order to end their  misery. Ethan agrees with the suicide plan and steers the sled  towards the tree. Unfortunately, they both survive the accident in  a very maimed condition. The story then moves back into the narrator's present time when he is          visiting the Frome household during the snowstorm. After seeing the dire          poverty of the place, hearing the complaints, and entering the dismal          kitchen, he realizes the horror of the three lives. The paralyzed Mattie          has become more bitter and unhappy than Zeena ever was. Zeena is stoic          and rundown, and Ethan exists in angry silence. The story ends with the          narrator speaking to Mrs. Hale about what he has seen. Mrs. Hale suggests          that it would have been better if Mattie had died and that the Fromes          living on the farm are not much different than the Fromes in the graveyard. ", "analysis": "", "url": "https://web.archive.org/web/20180820053844/http://www.pinkmonkey.com/booknotes/monkeynotes/pmEthanFrome06.asp"}