{"name": "overview", "summary": "Act one opens with a group of people seeking shelter from a heavy downpour          of summer rain under the portico of St. Paul's Church, Covent Garden. This assorted group includes a lady, her daughter and son, a note taker          (Higgins), a military gentleman (Colonel Pickering) and a flower girl          (Eliza) among other pedestrians and the after theatre crowd. While they          wait for the rain to stop Higgins takes note of the interesting Cockney          accent of the flower girl who wheedles some money out of the Colonel. A bystander who sees Higgins take notes suspects him of being a police          informant and warns the flower girl to give the Colonel some flowers in          return. This alarms the flower girl who begins to loudly protest her innocence. The crowd is sympathetic enough to take the side of the flower girl. Higgins          tries in vain to allay her fear. He claims that he is able to place any          man within two miles in London solely by virtue of his speech patterns. Higgins displays his phonetic prowess and correctly guesses the origins          of several people. When the rain stops the crowd disperses and Higgins is left alone with          the Colonel and the flower girl. Higgins explains to the Colonel that          he is a phonetician by profession and asserts that he can teach anybody          any dialect, including how to speak correctly. The flower girl is still          hysterical about the imagined harm to her respectability and Higgins loses          his temper. He declares that he can transform her into a duchess and even          get her a place as a shop assistant. It so happens that the Colonel and          Higgins know each other by repute and strike up an acquaintance. As they          leave together Higgins throws some money into the flower girl's basket. Delighted by this unexpected fortune the flower girl boldly summons a          cab to take her home. The second act opens the next day at Higgins' Wimpole Street laboratory. Higgins is engaged in a technical discussion about vowel sounds with Colonel          Pickering when Mrs. Pearce (Higgins' housekeeper) announces that a common          flower girl has come to see him. Excited by this stroke of good luck,          Higgins eagerly asks Mrs. Pearce to show the girl up. He knows that this          will enable him to demonstrate to Pickering how he can make records. However          to his utter disappointment the girl turns out to be the same flower girl          whom he had met last night. The girl introduces herself as Eliza Doolittle          and says that she wants to be a lady in a flower shop, but cannot get          a job unless she can \"talk more genteel.\" She wants Higgins          to teach her correct pronunciation. After indulging in some playful banter,          Higgins seizes her as an excellent subject and vows that he will \"make          a duchess of this draggletailed guttersnipe.\" within six months and          she is entrusted to his housekeeper. A little while later, Eliza's father, Alfred Doolittle, a dustman, arrives          with the explicit intention of inquiring about his daughter. However in          reality he does not care about Eliza and his sole concern is not to let          her go for nothing. Higgins cunningly foils his plans and tells him that          he may take Eliza away at once. Doolittle confesses that all he wants          is five pounds in return for which Higgins gives a long discussion about          middle class morality. Anxious to leave quickly with his booty, Doolittle          fails to recognize his own daughter who is dressed in a clean kimono. There is an angry exchange of words between the father and daughter before          Doolittle leaves. The act draws to a close with a typical lesson where          Higgins teaches Eliza correct pronunciation. The third act opens at Higgins' mother's house on her at-home day. A          few months have elapsed since the last act. Mrs. Higgins is dismayed when          her son shows up unexpectedly, since his social clumsiness always offends          all her friends. Higgins informs her about his latest phonetic project          to pass off a common flower girl, Eliza, as a duchess in six months. He          also tells her that he has invited Eliza to her at-home. Before Mrs. Higgins          has any time to voice her objections they are interrupted by the arrival          of two guests - Mrs. and Miss Eynsford Hill. Soon Freddy Hill and Colonel          Pickering also arrive. Higgins who has had a lingering suspicion that          he has seen Mrs. and Miss. Eynsford Hill somewhere before now recognizes          them as the mother and daughter who were under the portico in Covent Garden. Soon Miss Doolittle is announced and Eliza enters exquisitely dressed. She however fails to restrict herself to the topics prescribed by Higgins          (health and weather) and the conversation takes a dangerous turn. A short time later, taking Higgins' hint, Eliza rises to leave. At the          same time Freddy, smitten by her beauty, offers to take accompany her          while she walks across the park. It is here that Eliza responds with the          famously infamous words, \"Walk! Not bloody likely!\" which shocks          everybody present. Soon the at-home breaks up and the Eynsford Hills leave. Higgins and Colonel Pickering excitedly discuss Eliza with Mrs. Higgins. They agree with her that Eliza needs to undergo more training before she          is presentable. Mrs. Higgins rebukes the men for their unconcern about          Eliza's future. She accurately foresees that the advantages imparted by          Higgins will transform Eliza into a lady, which would disqualify her from          earning her own living without giver her a lady's income. However Pickering          and Higgins do not consider this as any significant problem and Mrs. Higgins          can only exclaim in frustration \"Oh men! men!! men!!!\"        Finally, Eliza's successful social appearance as a duchess is witnessed. This happens at an embassy in London one summer evening. A considerable          period of time has elapsed since her appearance at Mrs. Higgins' at-home          and in the interim, Eliza has lost her coarse way of speaking and plays          her role to perfection. She impresses everybody present and the hostess          is convinced that she is of royal blood. The act draws to a close with          the Colonel congratulating Eliza for winning Higgins' bet for him ten          times over. Act four constitutes the climax of the play. It opens at midnight at          the Wimpole Street laboratory. Higgins, Pickering and Eliza have returned          after her successful appearance as a duchess. Eliza sits silent and brooding          on a bench while the men voice their relief and happiness now that the          whole affair is over. Unmindful of Eliza's feelings, Higgins declares          that he would have abandoned the silly project much earlier had he not          wagered a bet. After Pickering leaves, Eliza becomes furious at Higgins          for his insensitivity and lack of concern. She throws his slippers at          him and demands to know why he had bothered to pick her out of the gutter          if he wanted to throw her back again. She is worried about her future          since now that she has been made a lady, she is fit for nothing else. When Higgins suggests that she might marry somebody, Eliza sarcastically          remarks that as a lady she isn't fit to sell anything but herself. Higgins          loses his temper when Eliza returns all the jewels and even the ring,          which Higgins had bought her in Brighton. She is hurt because she has          fallen in love with Higgins while she is nothing more than an experiment          for him. Higgins throws the ring violently into the fireplace and leaves. Eliza kneels to look for the ring and after finding it she flings it down          on the dessert stand and furiously goes upstairs to change her dress and          leave. She meets Freddy and reciprocates his kisses since she needs to          be comforted. They take a taxi and Eliza resolves to call on Mrs. Higgins          in the morning for some advice. In the fifth and last act, a flustered Higgins arrives at his mother's          house to tell her that Eliza has run away. He does not know that Eliza          has fled to his mother for support. Shortly thereafter Alfred Doolittle,          who has been sent from Wimpole Street, arrives. He accuses Higgins of          having delivered him into the hands of middle class morality. He complains          that he had been left a legacy of three thousand pounds a year by an American          language fanatic, Ezra D. Wannafeller and holds Higgins responsible for          suggesting his name as the most original moralist present in England. He dramatically mourns his loss of freedom. He is however unwilling to          add to his burdens by taking the additional responsibility of providing          for Eliza. Higgins points out that Doolittle had already received five          pounds in return for Eliza and he has no claim over her. Soon Eliza enters          and torments Higgins by telling the Colonel that it was his genteel manners          and kindness that really made her a lady and not Higgins who merely taught          her to speak correctly. Alfred Doolittle leaves to marry the woman he          has lived with as Eliza's stepmother. Higgins is at last left alone with          Eliza. There follows a remarkable encounter that depicts the fundamental incompatibility          of their views. Higgins practically begs Eliza to return to Wimpole Street          because he has become used to having her around, and is dependent on her          for all sorts of little services. He would obviously miss her if she would          go away. However Eliza goes on to accuse him of creating Duchess Eliza          without thinking about the trouble that it could bring. To Higgins's surprise          Eliza reveals that Freddy loves her and would make her happy. Higgins          tells her that her choice is between the cold unfeeling world of Science          and Art and the life of the gutter. Eliza revenges herself by stating          that she will advertise in the papers that Higgins's Duchess is only a          flower girl that he taught and that she will teach the same to anybody          for a hundred guineas. Although hurt Higgins is at the same time happy          that he has made \"a true woman\" out of Eliza since she is so          outspoken and has broken away from her subjugated position. He says that          now they can live together like three old bachelors instead of only two          men and a silly girl. The play concludes on an ambiguous note with Eliza          leaving along with Mrs. Higgins to attend her father's wedding ceremony. The audience or readers are left guessing whether she might indeed marry          Higgins. However, Shaw does provide a resolution to the action          in his anti-romantic epilogue where he states that Eliza weds Freddy and          settles down with him. ", "analysis": "", "url": "https://web.archive.org/web/20180820033733/http://www.pinkmonkey.com/booknotes/monkeynotes/pmPygmalion06.asp"}