{"name": "overview", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMacbeth05.asp", "summary": "Macbeth is a tragic play about a man who lusted after power, stole the throne of Scotland from the rightful Prince Malcolm, and threw the country into chaos through his evil reign. In the end, his own greed and guilt defeat him. Ironically, at the beginning of the play, Macbeth has everything going for him. He is an honored and valiant Scottish warrior who has just won his greatest battle and the title of Thane of Cawdor. Unfortunately, shortly after the battle, he meets three evil witches who sow the seed of greediness in his soul when they predict he will become the King of Scotland. Macbeth, encouraged and manipulated by his even greedier wife, murders King Duncan in order to seize the throne for himself. But the stolen crown gives him no pleasure, for he is riddled with guilt over the murder and fearful of being discovered. In order to protect himself and his throne, he kills his good friend Banquo, whom he has begun to fear most of all. The two murders on his conscience are more than he can sanely bear, and at a banquet, attended by all the lords and ladies of the land, he thinks he sees the ghost of Banquo sitting in his chair. He claims to the assembled crowd that \"Thou canst say I did it,\" and clearly incriminates himself of murder. No longer a rational man, he rants and raves, hallucinates, kills the family of Macduff for no reason, and throws all of Scotland into fear and chaos. Tortured by himself to madness, the king returns to the three witches to find out his future. The evil ones warn him of Macduff , tell him he will be harmed by no man born of woman , and promise he will not be vanquished until Birnam Wood comes to Dunsinane . Macbeth, ironically, perceives these prophesies as positive ones, but they are still no balm to his chaotic, tortured soul. In the most famous words of the play, offered by Macbeth after he finds out his wife has killed herself, the evil king reveals the total emptiness of life, which is \"a tale told by an idiot, full of sound and fury, signifying nothing.\" The noble Macduff, heartsick over the state of affairs in Scotland, goes to Malcolm, who has fled to England, and encourages him to fight Macbeth in order to gain the throne which is rightfully his. He learns that Malcolm has already assembled 10,000 English soldiers who are ready to fight Macbeth. The English forces, 2coupled with the Scottish rebels, attack the mad king and the pitiful forces that still support him. The Scottish loyalists are easily overcome, and Macduff personally beheads Macbeth in revenge for the murder of his family. The play ends with the promise that goodness will prevail in the person of Malcolm and that order and reason will replace the chaos found in Scotland under the reign of the greedy, evil Macbeth.", "analysis": ""}