{"name": "Overview", "summary": "CONTEXT\nKing Lear is concerned with power, old age, and folly. \n                                 The play also demonstrates how children can deceive their father, and that true love cannot be measured on a materialistic scale.\nThe story begins with the Earls of Kent and Gloucester in discussion.  \n                                We learn that Gloucester has two sons, his heir Edgar and his younger illegitimate son Edmund.  These characters form the sub-plot to the main plot involving King Lear.\nKing Lear is tired of ruling his troublesome Kingdom and wishes to retire \n                                from public duty, but still retain the title of King. \n                                 He proposes to split his Kingdom three-ways amongst his three daughters.  His eldest daughter is Goneril who is married to the Duke of Albany.  His next daughter is Regan who is married to the Duke of Cornwall.  His youngest daughter is Cordelia who is unmarried, but has two suitors the Duke of Burgundy and the King of France.  It is Lear's plan to give the two most troublesome regions of his Kingdom to his oldest two daughters, for their husbands will be able to keep the peace in these areas.  The central part of his Kingdom will go to Cordelia and he will reside with her.\nThe egotistic Lear, before partitioning his Kingdom, wishes his daughters to \n                                undergo a test of love for him, and he will make the division of his Kingdom according to their testimonies.  The two eldest daughters exaggerate their love for their father, and he fails to see through their \n                                pretence.\nWhen Cordelia comes to make her testimony she merely tells her father that \n                                she loves him, as a daughter should.  The aged Lear is disappointed at Cordelia's apparent lack of devotion and banishes her.  He then divides his Kingdom equally between Goneril and Regan.\nBeing without a dowry, the Duke of Burgundy loses interest in Cordelia, but \n                                the King of France sees Cordelia's honesty and agrees to marry her.  When the Earl of Kent tries to intercede on Cordelia's behalf, he too is banished.\nKing Lear takes up residence with Goneril in her castle, but now she has the \n                                power she quickly loses any respect she had for her father, and also loses patience with his entourage. \n                                 Lear's influence is soon diminished and he rants like a petulant child and soon leaves the inhospitable Goneril to live with his other daughter Regan.\nMeanwhile, Edmund is becoming increasingly unhappy about his illegitimacy \n                                and the fact that he will not inherit any of his father's property.  He devises a plot in which to disinherit Edgar, and forges a letter purportedly from Edgar, urging Edmund to join him in a plot to kill their \n                                father, after which they will split his wealth between them. \n                                 Edmund easily convinces his father of Edgar's &#8216betrayal'.  Edmund wounds himself and pretends that it is Edgar that has inflicted the wound, and that Edgar will try and kill his father.  Edmund warns Edgar that his father has gone mad and intends to kill him, so he escapes to the woods and takes on the disguise of a beggar known as Poor Tom.\nThe Earl of Cornwall, Regan's brutal husband, orders that the King's \n                                messenger, the disguised Earl of Kent, be placed in the stocks.  King Lear arrives at Regan's castle and realizes that he has lost all his authority, for Regan too treats him coldly.\nFull of anger and pride, Lear leaves Regan's castle and rides into the storm \n                                with only his Fool for protection.  The Fool tries to reason with the King, but he is distraught at his betrayal by his two daughters.  The pair is joined by Poor Tom, the disguised Edgar.\nRumor now abounds in the Kingdom that there may be an invasion from France \n                                in order to save the King. \n                                 Edmund allies himself with the Earl of Cornwall with a view to obtaining some regard, perhaps title and lands.  He tells Cornwall that his father, the Earl of Gloucester, will conspire with France in support of the King.  Gloucester is captured and tortured by Regan, and Cornwall gouges out Gloucester's eyes.  One of Cornwall's servants draws a sword and stabs Cornwall, fatally wounding him.  Edgar is reunited with his blinded father by one of his own tenants.  In disguise, Edgar agrees to take his father to the cliffs at Dover where he plans to commit suicide.  Edgar employs a ruse by which Gloucester is made to believe that he has fallen from the cliff, but miraculously survived.\nMeanwhile, Cordelia returns to find Lear living off the land dressed in \n                                flowers and weeds. \n                                 She tenderly cares for her father, trying to restore his mental condition.  Father and daughter are reconciled.  When the King returns to his senses he believes he has been saved by some miracle.  Albany becomes more appalled by his wife's behavior, especially as she now plans to murder her own father.  He denounces her.  Both sisters now lust after Edmund and they make him Commander in Chief of the English forces.  Reluctantly, Albany joins forces with Edmund as he still regards France as the greater threat.\nLear and Cordelia are captured by Edmund, but Albany tries to help them.\nGoneril poisons her sister Regan, and then stabs herself when her adultery \n                                is revealed.\nEdgar decides to reveal himself to his father, and when he learns of all \n                                that has happened from Kent, he dies of a broken heart.\nAlbany captures Edmund on a charge of Treason. \n                                 Edmund's treachery is revealed and he engages in a fight with Edgar, although he does not recognize his brother.  Edmund is fatally wounded by Edgar.  However, Edmund had issued secret orders for the execution of King Lear and Cordelia, and Albany is unable to prevent Cordelia from being hanged.  The old King fought to save his daughter's life and revive her, but died in the effort.\nThe play ends with Edgar, Kent and Albany faced with the task of restoring \n                                the Kingdom."}