{"name": "overview", "url": "https://web.archive.org/web/20180820040441/http://www.pinkmonkey.com/booknotes/monkeynotes/pmHeddaGabler05.asp", "summary": "Hedda Gabler, the beautiful daughter of General Gabler, has married George Tesman a pedantic academic. A doctorate has been conferred on him and he is now known as Dr. Tesman. While on their honeymoon, Tesman cannot tear himself away from his precious research and spends much of his time researching his next book. He is blind to Hedda's emotional and psychological needs and at the beginning of the play, the audience sees her as bored and frustrated. Hedda has married Tesman in sheer desperation because he represents stolidity and respectability. Because she was getting old and no one else has proposed to her who had the financial means nor the reputation, she finds herself trapped in a loveless marriage but unable to break away because she fears censure and scandal. She will never do the unconventional thing. This results in her becoming mean-spirited and frustrated. She shifts her maternal instincts, degrades Aunt Julia and expresses hostility towards her husband as well as his relatives. She forms an underhanded alliance with Judge Brack, one of her admirers from her old set. Even to Brack, she declares that she never jumps of the train and keeps her pistols, a gift from her father, ready just in case his advances become importunate. In the first act, Mrs. Thea Elvsted, Hedda's old schoolmate, comes to visit them. She is married to District Magistrate Elvsted. However, she finds being married to an unloving, elderly man in order to care for his household is highly unsatisfying. She has found satisfaction in assisting and inspiring the work of a creative and brilliant writer, Lovborg. She has managed to channel his undisciplined energies and also reform him. He is no longer a dissipated bohemian. He has just written a book, and Mrs. Elvsted is afraid that with money in his pockets and seeking out the wrong crowd he will soon revert to his old ways. She requests Tesman to receive him in the house so that he will not give way to temptation. Though Lovborg is his rival and contests the same post of professorship, Tesman readily sends a letter of invitation. In private, Mrs. Elvsted confesses to Hedda that she has left her husband for good and has followed Lovborg. Unknown to anyone, Hedda and Lovborg have been very intimate with each other. In her father's house she would question him indirectly about his disreputable adventures for she was curious about the outside world. When their friendship threatened to develop into something deeper, Hedda, fearing scandal, took the cowardly way out and threatened him with her pistols. When Hedda sees the influence Mrs. Elvsted has over Lovborg, she strikes back like a cobra because she cannot control human destiny like Thea has. When Lovborg shows up later in the evening, she goads Lovborg into drinking again. Lovborg is hurt by the lack of trust Mrs. Elvsted shows in his determination to drink just two glasses of punch. He becomes insolent and accompanies Tesman and Brack to their bachelor party. Hedda thinks she has liberated Lovborg for she envisions him returning with \"vine-leaves in his hair.\" Although he is supposed to return at ten that evening to ostensibly accompany Thea home, Lovborg never shows up and the two women end up spending the evening together. The next morning neither Lovborg nor Tesman have returned so Hedda tells Thea to go upstairs and get some rest as they has not slept all night. After Thea goes upstairs, Tesman returns. He tells Hedda that he is envious of Lovborg because the manuscript he has written is brilliant. He also describes Lovborg's drunken behavior at the party and says that he was so drunk that he did not even notice he had dropped the manuscript on his way home. Tesman had picked it up and brought it back with him. Tesman says he will return it when Lovborg has recovered from his drinking binge. Hedda takes the manuscript and says that she will give it to Lovborg later. In the meanwhile, news has arrived that Tesman's Aunt Rina is dying and he leaves to attend her bedside.", "analysis": ""}