{"name": "overview", "summary": "Carol Milford is a student of Blodgett College. Her ambition is to  settle down in a prairie village and transform it into a place of  beauty. She works as a librarian at St. Paul after her graduation. She meets Dr. Kennicott at a friend's house. He falls in love with  her. After a courtship of two years they get married and  Kennicott takes her to Gopher Prairie, the prairie town that he is  proud of. Carol finds people of Gopher Prairie to be provincial. They gossip all the time. She finds the houses are ill assorted and  the shops look ugly. She tries to change the ideas of the people  and to get them to build a new school, a new city hall and library  and a better looking, more comfortable rest room for the farmer's  wives. She is not encouraged by any one-not even her husband. She is attracted by the intelligence of Guy Pollock-the lawyer. But she gets over it when she finds that he loves only dead  elegance and does not care for any social reformation. The  members of the Jolly Seventeen criticize her ideas, her dress and  her party and Carol feels miserable. She finds a friend in Vida  with whom she can discuss books. She's full of reverence for her  husband's work as a doctor. But life in Gopher Prairie offers no  challenges. She gives birth to a boy. She likes her Swedish maid, Bea Sorenson. She likes to talk to  the town's handyman, Bjornstam who is disliked by the majority  of the people for his democratic and atheistic ideas. Bea gets  married to Bjornstam and Carol treats them as her close friends. Bea and her son Olaf die of typhoid. Heart broken, Bjornstam  leaves the town. Her friend Vida marries Raymond  Wutherspoon. The great European War breaks out and Vida's  husband, Raymond joins the army. Kennicott wants to enroll too  but the medical council requests him to stay back to look after  the health of the people of the town. Erik Valborg, a Swedish  farmer's son comes to Gopher Prairie as the tailor's assistant. Fern Mullins, a young lady teacher also joins the school at  Gopher Prairie in Vida's place. Carol finds their company very  stimulating because of their love for books, dance, music and  drama. Cy Bogart, the brutish son of the town's scandalmonger  Mrs. Bogart, ruins Fern's reputation and she is forced to resign  and leave Gopher Prairie. Erik is attracted by Carol and goes out  with her for long walks. Kennicott knows about the attraction  between them but does not worry because he knows that Carol is  interested only in the mind of Erik and that she does not care for  physical intimacy. However, after the Fern Mullins episode,  when Carol goes for a long walk with Erik, Kennicott brings  them back to save Carol from a scandal. Erik leaves the town. Carol ignores all the tongue-in-cheek comments made by her  acquaintances. Kennicott takes her on a long tour to California  and other places. Carol returns to Gopher Prairie. She tries to be enthusiastic about  the town but feels tired of the hypocrisy and decides to leave. Kennicott feels distressed and she assures him that she would  come back if she is able to find out what she needs. She takes her  son along with her. She works in Washington for two years. Though she enjoys  looking at the beautiful buildings and feels happy to be in the  company of intelligent young people, she feels old, rustic and  lonely. Kennicott visits her in Washington to woo her for the  second time. Carol mellows and admits her desire to return to  Gopher Prairie. Kennicott asks her to return only when she is  whole-heartedly prepared to return. She talks to the leader of the suffrage movement who tells her  that she cannot achieve anything without total dedication. She  points out that Carol has a child to take care of. She convinces  Carol that she can play at least a small role in changing life by  persistently asking questions whenever she finds anything that  hinders social change. This idea is acceptable to Carol. Her life  in Washington helps her to acquire a mature outlook towards life  and she is ready to return to Gopher Prairie. Carol is at last able to accept Gopher Prairie and its people as  they are. But she does not give up her fight to make Gopher  Prairie a better place. She gives birth to a daughter and feels  optimistic that her daughter will carry on the fight that she had  started and witness a united world. ", "analysis": "", "url": "https://web.archive.org/web/20180820035130/http://www.pinkmonkey.com/booknotes/monkeynotes/pmMainStreet08.asp"}