{"name": "overview", "url": "https://web.archive.org/web/20180820040441/http://www.pinkmonkey.com/booknotes/monkeynotes/pmHeartDarkness05.asp", "summary": "The novel opens on the Nellie, a cruising yawl , anchored outside London on the Thames River. On board are the Director of Companies, the Lawyer, the Accountant, and Marlow. Marlow tells them a tale, which makes up the entire novel. At points in the narration, readers are reminded of this scene of telling. The last paragraph of the novel returns the reader to Marlow on the Nellie. Marlow tells his companions of his trip to Africa as a seaman. Out of work and feeling extremely alienated by the city of London, Marlow begins looking for a contract to go to sea. When he cannot find one, he contacts his aunt, who is living on the European continent and who has contacts in a Trading Company, which operates in Africa. After having a physical, where his head is measured in the interests of science and to find out if changes happen to people who go to Africa, Marlow ships out. He later finds out that his aunt has represented him to the company as an idealist who believes that the European mission in Africa is to bring enlightenment to the natives rather than to grab their resources for the sake of money. When Marlow arrives in Africa, he finds mass destruction of the earth, the people, and even the machinery. He sees what seems like senseless work and senseless dying on the part of the Africans. He finds the Europeans to be oblivious to the immorality of what they are doing. At the Outer Station, Marlow meets the Chief Accountant, whom Marlow admires somewhat ironically because in the midst of the chaos he \"kept up his appearance.\" The Chief Accountant tells Marlow of Kurtz, a man who runs the Inner Station and who sends back more ivory than all the rest of the company's agents. Marlow next travels to the Central Station, run by the Manager, who Marlow finds embodies all the worst of the European imperialism. He calls the Manager a hollow man without values. The Manager is purely greedy and desperately competitive with other agents. Marlow finds an atmosphere of petty intrigue at the Central Station and regrets having to stay there for months because his steamer is out of order. He lacks the necessary parts-- rivets--to repair his riverboat and leave the Central Station. While there, Marlow hears more about Kurtz this time from the Manager, who is jealous of Kurtz's success. He also finds that Kurtz is a \"universal genius\", gifted in oratory, painting, and poetry, but has recently stopped sending ivory down the river and has gone out of communication. Marlow begins to idealize Kurtz as a sort of a savior, who can redeem the petty greed of imperialism with an idea. He suspects that the Manager is intentionally delaying the sending of relief to Kurtz in order to dispose of him as competition in the company. Marlow finally repairs his steamer and travels further up the Congo River toward the Inner Station, where Kurtz lives, taking on board with him the Manager and other company officials sent to find out what had happened to Kurtz. During the trip, Marlow is terrified by the immensity of nature that surrounds him. Here nature is unconquered and uncontrolled, making Marlow feel small and powerless, alienated from his usual identity as a European. Marlow is also terrified and fascinated by the Africans he sees along the shore. He struggles with \"the suspicion that they were not inhuman,\" that he has some \"remote kinship\" with them. He is relieved by the antics of his fireman, an African man, whom Marlow refers to as \"an improved specimen\" and who fits all of Marlow's expectations of Africans as superstitious, child-like, and foolish. As Marlow approaches Kurtz's station, natives using arrows and spears assault his riverboat. Marlow watches as his helmsman, an African, dies and ironically feels a strange bond to him, more so than he does to the Europeans on board. The Europeans, whom Marlow refers to as pilgrims, reveal their true inhumanity as they fire randomly into the bush, hoping to kill as many natives as possible. As Marlow contemplates the situation in Africa, he becomes extremely anxious that Kurtz may be dead and he may never be able to talk to him. Before meeting Kurtz, Marlow breaks the story line to talk to his companions on the Nellie. He describes his extreme alienation from the Europeans and their actions in Africa, his intense interest in talking to Kurtz, and he tells them that he ends up lying to Kurtz's Intended , even though Marlow hates a lie worse than anything. Marlow then returns to the narration of his story and tells of his encounter with the Russian, a man dressed like a harlequin, who cheerfully describes Kurtz as a sort of god to the Africans. He reveals that Kurtz is an egomaniac, a man who \"wanted an audience\", and who made the African chiefs crawl to him. As Marlow listens to the Russian, he uses binoculars to look at Kurtz's station. He sees human skulls resting on poles outside of Kurtz's house and realizes the ruthless nature of the man. He also learns that Kurtz ordered the attack on the steamer by the natives, for he does not want to leave the Inner Station. Marlow is very disturbed by what he sees and hears about Kurtz and describes him as an empty man, \"hollow at the core,\" who is all talk with no real beliefs. While the Russian is on board the steamer, Kurtz's African supporters come out to make a show of force. Among them is an African woman, apparently Kurtz's lover, who is richly dressed and beautiful. She is forlorn that her lover is being taken from her. When the steamer pulls away from the station the next day, she reaches out in anguish towards the departing boat and is needlessly shot by the brutal Europeans. The Europeans manage to bring Kurtz on board, but he escapes and flees to shore. Marlow leaves the boat to find Kurtz on land. As Marlow subdues him, Kurtz tells Marlow that he had had \"immense plans\" for Africa. He then realizes that Kurtz's \"soul was mad.\" Marlow coaxes Kurtz back on board, but Kurtz dies during the journey. His last words, \"The horror, the horror!\" seem to refer to the entire human condition. Marlow returns to Europe and manages to keep Kurtz's papers, entrusted to him, away from company officials. He also visits Kurtz's Intended, feeling that Kurtz's vision enters her house with him. He hears the words \"the horror, the horror!\" echoing in his ears; but when the Intended wants to know Kurtz's last words, he answers that Kurtz dies saying \"your name.\" He also lies and tells her that Kurtz purpose in Africa was noble to the end. The novel ends back on the Nellie with a sky of black clouds overhead and the river seeming \"to lead into the heart of an immense darkness.\"", "analysis": ""}