{"name": "overview", "summary": "The  story begins with a young boy, Jude Fawley, who is an eleven- year-old orphan. He lives with his aunt, Drusilla Fawley, in the village of Marygreen. The village  schoolmaster, Richard Phillotson, is leaving the village and going to Christminster  University to get a degree and eventually to be ordained. Jude, inspired by the  schoolmaster's example, also wants to go to Christminster to become a scholar  and a famous clergyman. While helping his aunt in the bakery, Jude studies on  his own in his spare time, reading Greek and Latin classics. Jude is poor, but  intelligent and hardworking and he manages to make considerable progress in his  studies even though he is without a teacher. As he grows up, he realizes he needs  a trade to support himself when he gets to Christminster. He gets apprenticed  to a stonemason in Alfredston and learns the basics of free-stone working and  restoring churches. At the age of nineteen, he meets and falls in love with Arabella  Donn, whose father is a pig-farmer. Arabella traps Jude into marriage by claiming  to be pregnant. But soon they realize that they do not have much in common. After  frequent quarrels, the marriage ends, and Arabella leaves Jude and moves off to  Australia. Jude is now free to pursue his old ambition of going to Christminster. On reaching  the city he earns his living by doing ecclesiastical stonework, repairing the  masonry of churches and colleges. In Christminster Jude meets his pretty young  cousin, Sue Bridehead. Almost immediately he falls in love with her. She is a  contrast to Arabella: she is delicate and refined, with intellectual interests. Jude introduces Sue to Phillotson, his teacher, who is still a schoolmaster, having  given up his plan of getting a degree. Very soon Sue becomes an apprentice teacher  under Phillotson. Jude is extremely upset when he finds out that Phillotson is  interested in Sue. Jude himself is in love with Sue, and the fact that he is still  legally married to Arabella does not permit him to pursue his cousin. Meanwhile,  Jude is refused entrance to any of the colleges in Christminster and is extremely  disheartened. He decides to give up his dream of pursuing academic and theological  studies. Sue by now has enrolled at a teachers' training college in Melchester  and has promised to marry Phillotson when she gets her certificate in two years. Sue and Jude go out on an excursion, and they are delayed when they miss their  train. Sue is punished by the college authorities for staying out all night with  Jude. She impulsively leaves the college and rushes to Jude for assistance. Although  he is warm towards her, Jude does not receive any demonstrations of affection  from Sue. This leaves him thoroughly confused. Sue goes to Shaston to stay  with a friend when she learns that the training college has expelled her and will  not take her back. Jude meets Sue and tells her of his earlier marriage to Arabella. Sue is very surprised at the news, and impulsively gets married to Phillotson,  even asking Jude to give her away at the church. Jude is terribly depressed after  the wedding and tries to drown his sorrows in drink. In the bar he runs into Arabella  again. She has returned from Australia and has entered into a bigamous marriage  with a man called Cartlett. Jude and Sue keep in touch with each other. It  is obvious that Sue's marriage to Phillotson is a disaster, and she admits to  Jude that she is unhappy. When Aunt Drusilla dies, Sue comes to the funeral in  Marygreen. When they part, Sue and Jude exchange a kiss, which makes Jude realize  that his continuing passion for Sue is incompatible with his aspirations for a  church career. Sue returns to Shaston but asks Phillotson to let her live separately  from him in the house. However, though he is a considerate husband, Sue finds  his company increasingly distasteful and begs him for her freedom. Phillotson,  realizing her aversion to him, allows her to go, even though his friend, Gillingham,  advises him against it. As a result of the scandal, Phillotson's professional  life is ruined, and he is later forced to resign from his teaching post. Sue  and Jude go off together, living as companions , and not  as lovers. After some time both their divorces come through. When Arabella returns,  Sue becomes insecure about Jude's attachment to herself. It is under such circumstances  that she consents to a more intimate relationship with him. Jude and Sue continue  living in Aldbrickham, and though now both are free to remarry, they never do  so, always postponing the decision. Arabella, now free of Jude, marries Cartlett  and writes to Jude, claiming she has a son by him. She writes that he was born  eight months after their marriage, when she was in Australia. She sends the child,  Little Father Time, to Jude and Sue. Both of them agree to accept him and extend  their care to him. The child is a strange, anxious and withdrawn boy with a morose  temperament. Although Jude and Sue again plan to marry for the sake of Little  Father Time, the wedding is put off. Sue and Jude are now expecting a child  of their own, but because of their unmarried status, they are tormented by gossip. Jude loses a job and is forced to resign from a local artisans' committee. Ultimately  they decide to leave Aldbrickham. They lead a nomadic life for over two years,  stopping at small towns and villages wherever work is available. Jude's health  begins to fail due to the demands of his trade, until the couple is finally reduced  to baking and selling cakes. By now they have two children of their own and a  third is expected. One day Arabella sees Sue in the town of Kennetbridge, and  being a widow now, her interest in Jude is renewed. Jude meanwhile is not  well, and so Jude and Sue decide to return to Christminster. It is Remembrance  Day and Jude is depressed and bitter. They find it difficult to secure accommodations,  partly because of Sue's condition. Sue's despairing words make a deep impact on  Little Father Time, who kills himself along with the other two children. This  event is a turning point for Sue, who blames herself for the tragedy. She loses  her unborn child and begins to be tormented by feelings of guilt. She considers  the deaths of her children as a punishment and finally decides to remarry Phillotson  as an act of atonement. She returns to Marygreen, and she and Phillotson are once  again married. Jude is desolate and ill and takes to drinking, and Arabella  tricks him into marrying her again. Jude's health begins to deteriorate severely,  and he goes to Marygreen to pay Sue a last visit. Sue, though astonished at Jude's  visit, confesses that she still loves him, but she asks him to leave. As an act  of mortification, from that day onwards she begins to share Phillotson's bed. Jude's condition worsens steadily, and finally he hears from Arabella that Sue  and Phillotson are now living as husband and wife. It is Remembrance Day and also  the anniversary of the deaths of his children. While Arabella is out enjoying  the festival, Jude dies, alone and unattended. ", "analysis": "", "url": "https://web.archive.org/web/20180820051427/http://www.pinkmonkey.com/booknotes/monkeynotes/pmJude04.asp"}