{"name": "overview", "summary": "David Balfour starts relating  the story of his adventures from 1751, when he was a youth of sixteen. Shortly  after the death of his father, he decides to leave his birthplace in search of  fortune. Mr. Campbell, the clergyman of Essendean, gives him a letter from his  father, which asks him to go to Edinburgh to meet his uncle. Mr. Ebenezer  Balfour is not very happy to see his nephew but allows him to stay with him all  the same. Disliking the intrusion into his privacy and afraid of losing his property,  he plots to kill David by sending him to the tower of the house on a dark night. When his attempts fail to trap David, he has the boy kidnapped and taken on board  the \"Covenant\" with the help of his friend, Hoseason. After the  initial seasickness, David adjusts to the life on the ship and makes friends with  its crew. When the ship heads towards the southwest of Scotland, it hits another  boat, whose sole survivor, a Jacobite rebel, boards the ship. The captain and  his mates plot to kill Alan Breck, but David reveals their evil plan to him beforehand. Together David and Alan defeat the crew and show their superior strength to the  captain. Shortly afterwards, as the ship sails through a dangerous route, David  falls overboard into the sea and is separated from Alan. He reaches the Isle  of Mull and meets people who direct him to Appin. However, on the way he meets  Colin Campbell and becomes a witness to his murder. The followers of Colin Campbell  (the Red Fox) suspect David of being an accomplice in the murder and pursue him. David finds Alan, and with the help of James of Glen, they make their escape into  the wilds of the Highlands. After a long and strenuous journey, they finally reach  the Lowlands. David hires a lawyer, and they devise a plan to make his uncle  confess his crime. When Mr. Ebenezer realizes he has been discovered, he agrees  to pay two-thirds of the income from the estate to his nephew. As a result, David  succeeds in recovering his money and establishing his identity in the world. THEMES    Major Theme   The main theme of Kidnapped is good conquers  evil. While Ebenezer tries his best to harm his nephew and keep all the wealth  for himself, David bravely fights against his antagonist and succeeds in exposing  his uncle, regaining his identity, and acquiring the wealth due to him. Minor  Themes   There are two minor Themes in the novel. The first one is in the  struggle for existence, the fit will survive. David must fight all kinds of odds  to survive and return to Scotland to expose his uncle and his cruel plot. A second  minor theme is that no one character is completely good or evil. Even the wicked  Ebenezer shows some decency at the end of the novel. MOOD   The  prevailing mood of the novel is serious. Stevenson, however, offsets the somber  mood by maintaining action and suspense throughout the plot and by creating eccentric  characters who are entertaining. The clergyman Campbell's emotional farewell,  Alan's pompous talk, and Mr. Rankeillor's pretended forgetfulness also lighten  the novel's atmosphere. Kidnapped becomes a delightful adventure story. ", "analysis": "", "url": "https://web.archive.org/web/20180820035817/http://www.pinkmonkey.com/booknotes/monkeynotes/pmKidnapped05.asp"}